{
    "totalResults":"8",
    "news":
    {
        "global":[   
            {
                "id":"G201020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"CM inaugurates Tripura Start-Up Week.IT sector will play an important role building a self-reliant Tripura: CM",
                "description":"The IT sector will play an important role towards building a self-reliant Tripura in future and the state government had taken initiatives towards development of the IT industry over the past four years.",
                "imageName":"G141020221.jpg",
                "publishedAt":"Agartala, October 20, 2022",
                "content":"<p>The IT sector will play an important role towards building a self-reliant Tripura in future and the state government had taken initiatives towards development of the IT industry over the past four years.</p><p>Besides this, the state government also had started Tripura IT/ITES Start-Up Scheme-2019 to create opportunities for young IT graduates through more numbers of IT/ITES Start-Up industries in the state, said Chief Minister Dr Manik Saha after inaugurating Tripura Start-Up Week at Rabindra Satabarshiki Bhavan on Wednesday.</p><p>He said,&quot the state has an apt environment for the development of the IT sector. In fact, the rate of literacy of the state is commendable as compared to other states in the country. There are schools, colleges, university, medical college, engineering college, polytechnic institute and ITI including government and private technical institutions in the state. As a result, the youth of the state are becoming skilled in the IT sector from such institutions. Apart from that, the state has an uninterruptible power system, pollution-free environment, transport system such as rail, road and direct connectivity between Bangladesh and different parts of the country through airways for growing scope of IT sector&quot.</p><p>The Chief Minister also called upon the industrialists to make use of the apt environment for setting up IT industries in the state.</p><p>The Chief Minister inaugurated two Start-Up products (‘Chitrika’ and ‘Oman’) and Medic App, Career Vichar and Grocell App services on the occasion of Tripura Start-Up Week. The Chief Minister also launched Tripura IT/ITES Policy-2022 and Tripura Venture Capital Fund. He said, there are 50 Start-Up IT/ITES in the state so far that are registered under Start-Up India Portal. Among these, 13 Start-Ups are registered under Tripura IT/ITES Start-Up scheme. These are being provided with financial and different kinds of assistance by the IT department.</p><p>The Chief Minister said the state government has started the New Generation Innovation Network scheme to bring all technical and educational institutes under one roof of the Start-Up ecosystem. There is an opportunity to provide a one-time grant of 10 lakh rupees for infrastructural development and 5 lakh rupees each year to educational institutions for management under the scheme. Total four technical institutes so far including NIT, TIT, ICFAI and Techno India have been brought under the New Generation Innovation Network scheme.</p><p>The Chief Minister said, the present time is completely dependent on modern technology. Prime Minister Narendra Modi has taken different initiatives to build Digital India. Now people don’t have to worry much since e-services have been started in different sectors. Chief Secretary J. K. Sinha said, students of different technical institutions in the state are showing their growing interest regarding Start-Ups. They are moving ahead using different modern technologies. He said, there are scopes to create different products through Start-Ups to further simplify daily facilities. Different facilities including incubation centre, venture capital fund are there to open Start-Up in the state. The Chief Secretary called upon the investors including students of different technical institutions to make proper use of these and open Start-Ups.</p><p>Principal Secretary of IT department Punit Agarwal and Director Dr. Naresh Babu N. also spoke on the occasion. One-time grant of 10 lakh rupees was provided to two Start-Ups under New Generation Innovation Network scheme in the programme. The Chief Minister handed over the cheques to the authorities of the both Start-Ups.</p>"
				
				},
           {
                "id":"G191020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"PM to visit Tripura either Oct 27 or 28, will inaugurate number of projects, CM",
                "description":"The  Prime Minister Narendra Modi is scheduled to visit Tripura on October 27 or 28, and this sudden one-day tour  of the Prime Minister will rejuvenate the ruling BJP just few months before the next assembly elections in Tripura.",
                "imageName":"G191020221.jpg",
                "publishedAt":"Agartala, October 19, 2022",
                "content":"<p>The  Prime Minister <b>Narendra Modi</b> is scheduled to visit Tripura on October 27 or 28, and this sudden one-day tour  of the Prime Minister will rejuvenate the ruling BJP just few months before the next assembly elections in Tripura.</p><p>Chief Minister Dr Manik Saha Tuesday  sharing brief information over the proposed visit of Prime Minister Narendra Modi with media  in Agartala said that the PM will visit the state either on October 27 or 28 and will inaugurate a number of developmental projects.</p><p>Official sources said that during one day visit to the state, the Prime Minister will address a mass gathering at Vivekananda stadium in Agartala, where the PM will unveil the ‘Greha Prabesh’ ceremony for thousands of houses constructed under PMAY scheme in the state.</p><p>Dr Saha said that during the PM visit  either on October 27 or the next day, will also hold a public rally, besides laying the foundation stones of some projects. The union government had sanctioned 1.60 lakh dwelling huts under Prime Minister Awas Yojana (PMAY) for Tripura state during 2021-22 financial year and many of the dwelling units are ready for inauguration.</p><p>Over the question of inauguration of the proposed Dental college in Tripura, Dr Saha said that it will not be possible because so far the Dental Council of India (DCI) has not approved the proposed college.</p><p>The Chief Minister also said that Prime Minister Modi is also scheduled to go to Arunachal Pradesh and added that if the Prime Minister goes to Arunachal Pradesh on October 27, he will visit Tripura on October 28 or else he will be in Agartala on October 27. The final tour programme has not been finalized yet  and soon the government will announce his tour schedule.</p><p>While, political sources said that in the backdrop of the anti-incumbency factors of the BJP government, the ruling BJP will kick-start the assembly election preparation with Modi's visit as the party would take a desperate attempt to retain power in Tripura.</p>"
				},
		   {
                "id":"G181020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"CM Inaugurates 15 new Log Huts at Narkel Kunja  in Dumbur lake",
                "description":"Chief Minister Dr Manik Saha on Monday inaugurated 15 new log huts at the Narkel Kunja (coconut island)  surrounded by Dumbur lake in Gomati District of Tripura.",
                "imageName":"G181020221.jpg",
                "publishedAt":"Agartala, October 18, 2022",
                "content":"<p><b>Chief Minister Dr Manik Saha on Monday inaugurated 15 new log huts at the Narkel Kunja (coconut island)  surrounded by Dumbur lake in Gomati District of Tripura.</b></p><p>Inaugurating the beautiful log huts and enchanting beauties of Dumbur lake, Chief Minister Dr Saha stressed for campaigning of the hot tourist spots of the state across the globe to attract more tourists.</p><p>Under the &quotSwadesh Darshan&quot scheme, a total 23 log huts construction were started with a cost of Rs. 7.59 crore and among these, 15 log huts construction has been completed, which were inaugurated on Monday.</p><p>Chief Minister Dr Saha also inaugurated adventure water sports activities in the Dumbur lake, which is a vast water body of 41 square kilometers and has almost 48 islands.</p><p>The Chief Minister appreciating the role of Tourism Minister Pranajit Singha Roy and Tourism department’s secretary Kiran Gitte for improving the tourism scenario of the state said  people always love travel , especially in vacation period. He said that Tripura has to highlight the tourism destinations of the state before the world, then more and more tourists will attract marvelous tourism spots of the state.</p><p>He said that nowadays his idea over Narkel Kunja has been changed after visiting the spot a few days ago and has also highlighted his experience of visiting Dumbur lake before several union ministers  and urged them to visit the spot.</p><p>&equotWe should campaign immensely on Sunday. I shared the pictures of Narkel Kunja from my pages on different social media platforms. It’s being said that the number of shares and likes that took place in the last 24 hours is highly appreciable,&quot said Dr Saha.</p><p>Dumbur is a unique gift of nature and with the induction of eco-friendly log huts, now tourism lovers will be able to feel the enchanting beauty of Dumbur lake, said Chief Minister and added that the government is working relentlessly to improve the tourism sectors of the state.</p><p>Around 5 lakh tourists visit Tripura every year and the government's target is to raise the graph of visitors at its many folds in the coming days, said Dr Saha.</p><p>During the inauguration programme, Tourism Minister Pranajit Singha Roy, MP Rebati Tripura, local MLA Parimal Debbarma, MDC Bhumikananda Reang, District Magistrate of Dhalai district UK Chakma and other officials, members of women-led SHGs and local people were also present.</p><p>It may be recalled here that the log huts have been constructed by Wood Barn India  Pvt Ltd at a project cost for Rs7. 59 crore using prefabricated pine originated from Canada.</p><p>Recently, Tripura’s tourism department is contemplating to introduce a houseboat facility in this lake and Rs 7.38 crore has been sanctioned for development of 5 islands in Dumbur Lake along with sports adventure activities.</p>"
			},
			
            {
                "id":"G171020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"Tipra-Motha to organize statewide protest Oct 19 against denial of VC polls",
                "description":"As the prospect of holding election of Village Committees (VC) in the  Areas Autonomous District (ADC) of the  before the next assembly election in absence of fresh electoral rolls, the Tipra-Motha on Sunday claimed that governments intentionally deprived the rights of village people for their political intention.",
                "imageName":"G171020221.jpg",
                "publishedAt":"Agartala, October 17, 2022",
                "content":"<p>As the prospect of holding election of Village Committees (VC) in the  Areas Autonomous District (ADC) of the  before the next assembly election in absence of fresh electoral rolls, the Tipra-Motha on Sunday claimed that governments intentionally deprived the rights of village people for their political intention.</p><p>The State Election Commission (SEC) on last date of final roll publication of October 15, was unable to published the rolls  for the Village Committee election before the final publication of voter list for the assembly by the Election Commission of India (ECI), which is scheduled to be published on January 5th, 2023 next.</p><p>Addressing a press conference her at Chandra Mahal, the president of Tipra-Motha Bijoy Kumar Hrangkhwal accompanied by other leaders of the party including chairman of ADC Jagadish Debbarma strongly condemned the government’s steps and said that Motha protest of the deliberate intention of the both central and state government will organize satewide protest demonstration in subdivisions and all districts on October 19th next.</p><p>Tipra-Motha will also organize another mass gathering of party supporters on November 5th next by organizing a big rally at Vivekananda stadium (Astabal ground) to tell the governments of their negative attitude towards the development of ADC, said Bijoy Kumar Hrangkhwal.</p><p>He said &quotit is a serious matter and has been created by the state government by confusing the rural areas of the state and they trying to blindfold the people of the state in an excuse point of inclusion of 22,000 Bru voter names and in the last one year, the government has included the names of only 5000 Bru votes,&quot said Hrangkhwal .</p><p>The aim and object of the government is very clear to avoid the village development and unless and until, the Village Committees are not formed constitutionally, it is very difficult for VC to continue the developmental works in hills, said Hrangkhwal.</p><p>&quotToday, we are really sorry to say that the ruling both centre and the state governments had stalled the development of VCs and they are not given any regards and any respect to the constitution after two times, the High Court of Tripura indicated to hold the VC elections,&quot said Hrangkhwal.</p><p>&quotWe don’t under the denial of people’s right and direct denial, whereas the state had conducted other civic bodies elections despite pandemic”, said Hrangkhwal and that the people of Tripura are not with the intentional denial of their rights.  He said that Tipra-Motha’s supremo Pradyut Kishore Debbarma instructed all party leaders to stand together against the direct denial of governments and Tipra-Motha strongly condemned the process of the government by which they denied the rights of the people.</p>"
            },
			{
                "id":"G151020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"Every health centre of the state is being converted to Health & Wellness Centre: CM",
                "description":"The government continues to make efforts towards development of health services in the state. The government has prioritized infrastructural development of health to provide all kinds of modern treatment facilities across the state, said Chief Minister Dr Manik Saha",
                "imageName":"G151020221.jpg",
                "publishedAt":"Agartala, October 15, 2022",
                "content":"<p>The government continues to make efforts towards development of health services in the state. The government has prioritized infrastructural development of health to provide all kinds of modern treatment facilities across the state, said Chief Minister Dr Manik Saha.</p><p>Addressing the 4th anniversary of Ayushman Bharat PM Jan Arogya Yojana and 1st anniversary of Ayushman Bharat Digital Mission at Rabindra Satabarshiki Bhavan on Saturday , the Chief Minister said that each and every health centre of the state is being converted to Health & Wellness Centre.</p><p>He said, Ayushman Bharat PM Jan Arogya Yojana is one huge health insurance scheme in the world. Prime Minister Narendra Modi has been appreciated in the world arena for its successful implementation. Under the scheme, the beneficiary families are getting cashless assistance of up to 5 lakh rupees for treatment purposes.</p><p>This has somewhat lessened the burden of the weaker section of people in terms of getting treatment facilities. The Chief Minister said, Tripura as compared to other states is not behind in any case in terms of healthcare services. It is important to build good relations between doctors and patients to provide good service. The patient and their family also must have faith in the doctors and their treatment. The Chief Minister also emphasized upon keeping cordial behavior with the patient and their families. He mentioned the efforts of the government towards upgradation of Tripura Medical College to the level of RIIMS and NEIGRIHMS, setting up of AIIMS hospital and a dental college. He also spoke about the important role of ASHA and healthcare workers in the successful Mukhyamantri Sustha Shaishab, Sustha Kaishor campaign.</p><p>He said, the government is giving great importance to setting up of modern health infrastructure in the state. The Oxygen plant set up in IGM and AGMC hospital is the largest of its kind in the Northeast. He also spoke on different initiatives being taken by the government towards empowering women. Chief Secretary J. K. Sinha mentioned about the important role of the healthcare workers in terms of providing benefits of different health related schemes of the government till the last person of the society. Director of Guwahati based Regional Resource Centre Dr. Ashok Roy also spoke on the occasion. Secretary of Health & Family Welfare department Dr. Debashish Basu and other officials were present during the programme. Welcome speech was delivered by Chief Executive Officer of Tripura Health Safety Samiti Subhendu Debbarma. Vote of Thanks was delivered by Director of Family Welfare & Preventive Medicines department Dr. Radha Debbarma.</p><p>A documentary was shown on the success of Ayushman Bharat PM Jan Arogya Yojana and of Ayushman Bharat Digital Mission. The Chief Minister interacted with beneficiaries who have benefitted under Ayushman Bharat PM Jan Arogya Yojana. A logo of the Health & Family Welfare department was also launched by the Chief Minister in the programme. For the successful implementation of Ayushman Bharat PM Jan Arogya Yojana, District Program Coordinators from different districts and the beneficiaries brought under the scheme were felicitated in the programme. Arogya Mitras were awarded on the ground of best implementation, issuance of the largest number of Ayushman cards and admitting patients to the hospital. Besides this, different health institutions were awarded for the issue of Abha card, National Quality Assurance Standard and implementation of Lakshya programme. The awards were handed over by the Chief Minister and the guests.</p>"
            }, 
			
            {
                "id":"G141020221",               
                "category":"NEH",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"CM inaugurates newly built Vigyan Bhawan of Ramkrishna College in Kailasahar",
                "description":" The state government is determined towards infrastructural development of each and every college in the state. 21 colleges among 22 colleges of the state have been recognized by NAAC recently. Online admission has been started to bring transparency in the admission process of students in colleges, enunciated Chief Minister",
                "imageName":"G141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>The state government is determined towards infrastructural development of each and every college in the state. 21 colleges among 22 colleges of the state have been recognized by NAAC recently. Online admission has been started to bring transparency in the admission process of students in colleges, enunciated Chief Minister</p><p>Dr Manik Saha after inaugurating the newly built Vigyan Bhawan of Ramkrishna College in Kailasahar today. The two-storied Vigyan Bhawan consisting of 25 rooms was built at the cost of 9 crore 17 lakh 70 thousand rupees.</p><p>The Chief Minister said the college was established in 1950. Tapas Chaitanya Maharaj was its founder. Dr. Sachidanand Dhar was the first professor of the college. The college was brought under the state government in 1982. Presently, there are 2,882 students studying in the college. 19 courses are being taught in the college at present. Students are getting the opportunity to do Honours on 16 courses.</p><p>The Chief Minister said, integrated courses in Chemistry and Commerce branch have been started in the state. Students are getting loans under Mukhyamantri B.Ed Anuprerna Yojana. 991 students have been provided with loans recently for their higher education. The state government is working so that the students would not have to shift to colleges outside the state for higher studies. The Chief Minister said, initiative has been taken to build a medical college at Ambassa. He said, sports have to be given equal importance as academic studies. Respect must be paid to the teachers. The Chief Minister called upon everyone to complete all tasks within bounded time for the sake of development of the state. As a part of Prati Ghare Sushason campaign, the Chief Minister handed over land pattas to five tea garden workers of Hichacherra tea garden and a cheque of 2 lakh rupees to the representatives of Nivedita Self-Help Group in the programme.</p><p>The programme was presided over by Sabhadhipati of Unakoti Zilla Parishad Amalendu Das. Welcome speech was delivered by Director of Higher Education department N. C Sharma. Social Welfare & Social Education Minister Santana Chakma, Labour Minister Bhagaban Chandra Das, MLA Sudhangshu Das, Sahakari Sabhadhipati of Unakoti Zilla Parishad Shyamal Das, Chairperson of Kailasahar Municipal Council Chapala Debroy, Vice Chairperson Nitish Dey, TIDC Chairman Tinku Roy, Unakoti DM & Collector Uttam Kumar Chakma, SDPO Kanta Jangir and Principal In-charge of Ramkrishna College Dr. Pinaki Pal were present in the programme.</p><p>The Chief Minister officially inaugurated the Vigyan Bhawan by unveiling the plank of the Vigyan Bhawan and cutting the ribbon. Then he looked around the Vigyan Bhawan and planted a tree sapling in the campus.</p>"
            },           
            {
                "id":"G131020221",               
                "category":"NEH",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"President flags off two trains connecting Agartala with Guwahati, Manipur and Kolkata",
                "description":"President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.",
                "imageName":"G131020221.jpg",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.</p><p> On Thursday morning in a bid to further strengthen connectivity and boosting prosperity in the North Eastern region, the extended services of passenger train Agartala – Jiribam - Agartala Jan Shatabdi Express up to Khongsang in Manipur  and Guwahati – Kolkata - Guwahati Express up to Agartala has been flagged off by the President from Agartala station in presence of Chief Minister Dr Manik Saha, deputy chief minister Jishnu Dev Varma, union minister of state Pratima Bhowmik, Transport Minister Pranajit Singha Roy and Anshul Gupta, General Manager of Northeast Frontier Railway (NFR) along with other dignitaries was present.</p><p>The Agartala – Jiribam - Agartala Jan Shatabdi Express, which was the first direct train service connecting Tripura and Manipur has now been extended up to Khongsang in Manipur, which is a stretch of about 55 km. The train will run on Monday, Wednesday and Friday between Agartala and Khongsang. Khongsang station has been constructed as part of the ongoing Jiribam – Imphal new line project.</p><p>NFR said that this will be the first train service for this newly constructed station. People of a vast area of Manipur will be able to travel by train for the first time for their medical, educational and other needs. Train journey travel time will be less than half, as the journey time will be around 07 hrs covering a distance of 300 Km against about 15 hrs or so by road. The Jan Shatabdi Express will be having new Linke Hofmann Busch coaches with latest amenities for passengers. Moreover, a Vistadome coach has also been added in this train.  The entire route passes through very scenic hilly areas. This can be visualized by the passengers,tourists through the Vistadome coach. This train will connect people of three Northeast states Tripura, Manipur and Assam boosting economic activities.</p><p>The Guwahati – Kolkata - Guwahati Express which used to run between Kolkata and Guwahati, has now been extended up to Agartala once a week. The train will run on Wednesday between Agartala and Kolkata. This service will connect the capital of Tripura to Guwahati and other states. This train service will benefit people travelling between Agartala and Kolkata via Guwahati.</p><p>After flagging off both trains, President left the capital city through Air Force choppers towards Udaipur and visited Mata Tripura Sundari temple along with daughter, Chief Minister, Tourism Minister and local MLA Biplab Kumar Ghosh.</p><p>After arriving in the Agartala airport on Thursday afternoon through choppers, the  President Droupadi Murmu has left the state capital towards Guwahati after her two-day visit to the state . Governor Satyadeo Narain Arya and Chief Minister Prof. (Dr.) Manik Saha along with Chief Secretary J K Sinha,  DGP Amitabh Ranjan, West Tripura District Magistrate (DM) Debapriya Bardhan and Superintendent of Police of West Tripura district Shankar Debnath were also present in the airport.</p>"
            }          
        ], 
        "tripura":[
            {
                "id":"T201020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"BJP, TIPRA Motha show strength in hills, sporadic violence, few injured",
				"description":"Amidst statewide prevailing tension over political demonstrations among ruling BJP and Tipra-Motha in rural and hilly areas of the state, sporadic violence reported from few parts of the state and after pitch-battle among the supporters of both parties, about one dozen supporters’ sustained injuries and a TSR jawans also suffered injuries.",
	            "imageName":"T201020221.jpg",
                "publishedAt":"Agartala, October 20, 2022",
                 "content":"<p>Amidst statewide prevailing tension over political demonstrations among ruling BJP and Tipra-Motha in rural and hilly areas of the state, sporadic violence reported from few parts of the state and after pitch-battle among the supporters of both parties, about one dozen supporters’ sustained injuries and a TSR jawans also suffered injuries.</p><p>Police sources said that on Wednesday, Tipra-Motha organized protest demonstrations and submitted their memorandum before all BDOs of 58 blocks towards the Governor demanding early Village Committee (VC) elections in ADC areas and supporters of BJP had also organize rallies and submitted memorandum before the authorities of ADC zonal and sub-zonal offices demanding execution of developmental works in hilly areas.</p><p>But, during the rallies by both parties, clashes were reported in Baijalbari and Taidu areas of Khowai district and Ompi Nagar, resulting in about dozen of supporters of both parties suffering injuries.</p><p>Police sources added that they have deployed a large number of security forces in all areas where political parties organized their rallies and barring some stray incidents in three separate places, the political programmes by both BJP and Tipra-Motha completed peacefully.</p><p>Sources said during the deputations in the Baijalbari area of Khowai, the rallies of both parties faced each other in a spot and they started pelting stones targeting each other. During pitch-battle altogether 10 supporters and TSR jawans suffered injuries. Immediately, large numbers of security forces cordoned the entire area and dispersed all supporters.</p><p>Similar clash has also been erupted at Taidu and Ampinagar areas, but timely action by police forces the situation controlled within hours.</p><p>Sources added that when some unruly supporters of Tipra-Motha during their demonstration started pelting stones towards the supporters of BJP and they also ransacked the Ampinagar Mandal office and Gamako branch office of BJP. Within minutes the situation turned volatile and both party supporters started pelting stones targeting each other. As a result, four supporters of BJP and one supporter of Motha suffered injuries.</p><p>On Wednesday evening BJP Janajati Morch’s general secretary David Debbarma filed an FIR against a few supporters of Motha at West Agartala police station along with three of their injured supporters. Speaking with media persons, Debbarma alleged that when their supporters peacefully submitted their deputation before the Sub-zonal office at Simna, a group of Motha supporters attacked them and injured their four supporters. He said that after primary treatment at GB Hospital, they rushed to West Agartala police station and registered their complaint against miscreants of Motha.</p><p>Meanwhile, Tipra-Motha chairman Pradyot Kishore Debbarma in a social media post said that “if ma death can bring a solution then let it be so! This culture has ruined us and this is the reason why we have become slaves in the last 75 years. One day when I am no longer around you will realize the sacrifices of ours.” He also condemned the violence held during the protest and burning of his effigy by BJP supporters.</p><p>However, police said that after the attack and counter attack, the situation in three separate places including Taidu, Padmabil and Ampinagar are under control and large numbers of security forces were deployed in these areas.</p>"
		},
		{
                "id":"T201020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"156 schools to identify for introduction of PM SHRI Schools, Ratan Lal Nath",
				"description":"Altogether 156 schools in all 58 blocks and 20 urban bodies of the state will be identified for up gradation under PM SHRI Schools (PM Schools for Rising India) schemes.",
	            "imageName":"T201020222.jpg",
                "publishedAt":"Agartala, October 20, 2022",
                 "content":"<p>Altogether 156 schools in all 58 blocks and 20 urban bodies of the state will be identified for up gradation under PM SHRI Schools (PM Schools for Rising India) schemes.</p><p>Addressing a press conference here at Civil Secretariat on Wednesday evening, Education Minister Ratan Lal Nath said that more than 14,500 schools will be developed across India under the PM SHRI scheme with all the components of NEP 2020.</p><p>He said that NEP 2020 encourages a holistic, flexible and multidisciplinary approach to education as envisioned by the Prime Minister. &quotIt is based on foundational pillars of access, equality, quality, affordability and accountability. It is aligned with Sustainable Development Goals 2030 goals.&quot</p><p>Nath added that online, open and multi-modal learning has been promoted under the PM- eVidya.</p><p>The PM SHRI scheme has been implemented by the central government for the development of more than 14,500 schools across the country. The total project cost in PM SHRI scheme is Rs. 27,360 crore which includes a central share of Rs. 18,128 crores for the period of five years from the year 2022-23 to 2026-27.</p><p>The PM SHRI scheme will provide several benefits which include quality and innovation, Science and Math kits will be provided to these schools, annual school grants, early childhood care and education including balvatika and foundational literacy and numeracy equity and inclusion including the provision of safe and appropriate infrastructure for girls and CWSN, among other benefits. The PM SHRI scheme will also focus on strengthening existing infrastructures in schools and implementing green school initiatives.</p><p>Nath said that soon the identification for 156 schools will be completed and added that Vidyajyoti scheme is state sponsored scheme and it will be separated from PM SHRI Schools.</p><p>While giving details over the release of job offers for TET qualified candidates, Nath said that  on Wednesday the Education department has released offer letters for 179 Post-Graduate Teachers (PGT) including 43 for economics, 46 for sociology, 49 for geography and 41 for physiology. He said that a total of 256 offers were released for TET-I and among them 196 persons submitted their offers till last date and the department has released 258 offers for TET-II and among them 247 persons submitted their offers.</p><p>Nath added that the Education department had already published advertisements through TRBT to fill up 3,108 vacant posts including 757 vacant posts for TET-I and 2,351 posts for TET-II. Apart from these, TRBT has also issued advertisements to fill up 60 more posts.</p><p>The Education Minister said that the Chama language will be introduced in 36 schools of the state including in secondary, higher secondary and in primary schools.</p>"
				 },
				 
             {
                "id":"T191020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Only education can guide the society towards right direction: CM",
				"description":"Education is the backbone of society and only education can guide the society towards the right direction, said Chief Minister Dr Manik Saha after inaugurating Sri Aurobindo General Degree College at the old DIET building, Kunjaban in Agartala on Tuesday.",
	            "imageName":"T191020221.jpg",
                "publishedAt":"Agartala, October 19, 2022",
                 "content":"<p>Education is the backbone of society and only education can guide the society towards the right direction, said Chief Minister Dr Manik Saha after inaugurating Sri Aurobindo General Degree College at the old DIET building, Kunjaban in Agartala on Tuesday.</p><p>He said the college is the first government English medium College of the state. This is a mentionable step towards higher education in the state, said Dr Saha and added that English language is important for attaining higher education and a new chapter has been started in higher education in the state through inauguration of the English medium college.</p><p>The Chief Minister said, opening a new college is not an easy task. It was possible to open the college with the tireless efforts of the Education Minister and the department despite all challenges. The government will make more efforts in future towards infrastructural and academic development of the college.</p><p>Addressing the students, the Chief Minister said, only academic knowledge is not enough but practical education is also necessary. One has to build himself up as a human in society. One has to be good not only in academic learning but also in extra-curricular activities. One has to involve himself in social activities. The juniors must learn to respect their seniors. Only then, a student can build himself up as a true human being. Addressing the teachers, the Chief Minister said, the teachers must also keep themselves ready with new knowledge and information. This will only enhance teaching. The Chief Minister advised the parents to be mindful of their children to keep them away from the reach of drugs. He said, the state government is also continuing its efforts against addiction. The Chief Minister had paid tribute to Hrishi Aurobindo.</p><p>Education Minister Ratan Lal Nath in the programme said, only through education, one can achieve success in life. The present state government is playing its role responsibly towards development of human resources. It is possible to build human resources through proper education and improved healthcare services. The government is giving equal importance to these two factors. The Education Minister said, there are 128 pre-primary schools in the state at present. 21 colleges out of 25 colleges in the state have been recognized under NAAC. Lakhsya scheme has been started for national level skill development for students of the state. he said, Master Degree Courses in Bengali and English languages have been started in six General Degree Colleges.</p><p>Principal of Sri Aurobindo General Degree College Dipankar Chakraborty delivered a welcome speech. Mayor of Agartala Municipal Corporation (AMC) Dipak Majumdar and Director of Higher Education department N. C. Sharma also spoke on the occasion.</p>"
				 },
				 
			  {
                "id":"T191020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Students have to play a vital role to restore democracy in Tripura, Manik Sarkar",
				"description":"Time has always changed character and the present situation of the state is also changing rapidly and all people including students have to play vital roles for coming movements to restore the democracy in the state, said opposition leader Manik Sarkar.",
	            "imageName":"T191020222.jpg",
                "publishedAt":"Agartala, October 19, 2022",
                 "content":"<p>Time has always changed character and the present situation of the state is also changing rapidly and all people including students have to play vital roles for coming movements to restore the democracy in the state, said opposition leader Manik Sarkar.</p><p>Addressing the 20th state conference of Students’ Federation of India (SFI), held at Agartala Town Hall on Tuesday, Sarkar appeals to students to increase their public contact and conquer divisive politics of the ruling party.</p><p>&quotStudents of the state have to play a strong and concrete role in the coming greatest movements to restore the proper atmosphere for education and they have to connect with more and more students for the coming movements, &quot, said Sarkar.</p><p>While castigating the rule of both central and state governments for introduction of new education policy, Sarkar said that the new policy does not have any presence and secular and democratic spirit of the country.</p><p>Highlighting the rule of the previous Left Front government for expansion of education across the state, Sarkar previous governments had budget allocation of about 21 to 23 % for education and the present government by decreasing it handing over the education system to private parties.</p><p>Sarkar, mentioning the four and half years old rule of BJP government in Tripura alleged that they have snatched the democratic rights of common people and has also snatched rights of education for poor people by introducing the privatization in education system.</p><p>The situation rapidly changed and within four and half years of time, altogether 6 MLAs belonging to ruling parties had resigned and highlighted the betrayal politics of the BJP government, said Sarkar and urged the people to take the advantage of changing situation and should create massive resistance against the violent politics of the ruling part.</p><p>‘Just 10 months before the next assembly elections, the central leadership of BJP had changed the chief minister of state, but they did not change their policies of deprivation,’, said Sarkar and added that by changing chief minister ruling BJP cannot overruled the 55 months long politics violence and misgovernance.</p><p>&quotA total anarchy and total lawlessness prevails across the state and all people united should resist them to restore the rules of law and democracy in the state,&quot said Sarkar and appealed to all student leaders to visit educational campuses and connect with more students.</p>"
				 },
				 
			   {
				"id":"T191020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Six IAS officers transferred including two DMs",
				"description":"In a minor administrative reshuffle, few district magistrates (DMs) of the state were transferred including reshuffle of six senior IAS officers.",
	            "imageName":"T191020223.jpg",
                "publishedAt":"Agartala, October 19, 2022",
                 "content":"<p>In a minor administrative reshuffle, few district magistrates (DMs) of the state were transferred including reshuffle of six senior IAS officers.</p><p>As per the notification issued by the General Administration (Personnel and Training) department  of the state said that senior IAS officer  L H Darlong has been posted as Principal Secretary for Chief Minister and after his leave period , he will join the post.</p><p>Incumbent District Magistrate (DM) of Dhalai district L T Darlong has been transferred and posted as secretary of the state government and on assumption, Darlong will hold the charge of Tribal Welfare department and with additional charges of Director of Tribal Welfare department.</p><p>The director of Social Welfare and Social Education, Dr Siddhartha Shiv Jaiswal has been transferred as new District Magistrate (DM) of Dhalai district.</p><p>The DM of Unakoti district Uttam Kumar Chakma has been transferred and posted as secretary of the state government  and Dr Vishal Kumar, the present director of Tribal Welfare department  has been transferred as new DM for Unakoti district.</p><p>The notification added that on expiry of child care leave, IAS officer Smt. Smitha Mol is posted as new director of the Social Welfare and Social Education department and she will also hold the additional charges of CEO, TRLM and Mission Director of NULM, Agartala.</p>"
				 },
				{
				"id":"T191020224",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Police arrested a drug peddler, recovered tablets, cough syrups",
				"description":" Based on the interrogation statements of an arrested drug peddler, the capital city police on Tuesday burst a major drug supply  network and arrested another paddler with large quantities of contraband items.",
	            "imageName":"T191020224.jpg",
                "publishedAt":"Agartala, October 19, 2022",
                 "content":" <p>Based on the interrogation statements of an arrested drug peddler, the capital city police on Tuesday burst a major drug supply  network and arrested another paddler with large quantities of contraband items.</p><p>Giving details, SDPO(Sadar) Ajoy Kumar Das said that based on the confessional statement of arrested drug paddler Soumyabrata Banik, who was arrested on Monday from Math Choumohani area under East Agartala police station with Brown Sugar, police on  Tuesday arrested another drug paddler identified as Sujit Bhowmik of Jagaharimura area, who was with his Scotty moves every corner of the city and delivered banned and contraband tablets and cough syrups to their customers.</p> <p>Police based on the information have laid traps in different parts of the city and managed to arrest him from Jail road and in the course of search operation, police recovered large quantities of SP tablets and Eskuf cough syrup under his possession, said Das and added that police also seized his scotty. Arrested paddler Sujit Bhowmik will produce before a local court on Wednesday with police remand appeal to unearth the entire nexus of drug smugglers and their chain of network.</p>"
				 
				 },
				 
			   {
                "id":"T181020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Voting for AICC president post held at Congress Bhavan",
				"description":"The voting for the election to the post of All India Congress Committee (AICC) president was completed on Monday morning after 22 years here at Congress Bhavan along with other parts of the country.",
	            "imageName":"T181020221.jpg",
                "publishedAt":"Agartala, October 18, 2022",
                 "content":"<p>The voting for the election to the post of All India Congress Committee (AICC) president was completed on Monday morning after 22 years here at Congress Bhavan along with other parts of the country.</p><p>A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible and casted their votes to elect Congress president candidates Shashi Tharoor and Mallikarjun Kharge.</p><p>PCC president Birajit Sinha said among the voters 63 voters casted their votes in TPCC office in Agartala and another voter and veteran party leader Gopal Roy cast his vote in Arunachal Pradesh. He said that the voting process started from 10 AM and continued up to 4 PM and voters cast their votes through a secret ballot. During the poll process Tripura Pradesh Congress’s working president Sushanta Chakraborty and Pancham Misra acted as election agents for both candidates.</p><p>AICC  leader Abdul Hannan, the presiding officer for elections in Tripura said that the state’s ballot box has been sent to Delhi and counting will take place on October 19 and results will be declared the same day.</p><p>Hannan said AICC has set up 67 polling booths  across the country  'Kharge vs Tharoor' fight, where the last electoral contest for the top post of the party took place in the year 2000 when Jitendra Prasada had suffered a crushing defeat at the hands of Sonia Gandhi.</p><p>For the Congress president election, Shashi Tharoor and Mallikarjun Kharge are the party's two contestants and the counting of ballots will be taken up on October 19 and results will be declared as to who between the two candidates, octogenarian Mallikarjun Kharge or shashi Tharoor, will win the election.</p>"
			 },
			 {
                "id":"T181020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"In a devastating fire 5 shop, 2 houses completely gutted",
                "description":"In a devastating fire incident held at Hathkatha Bazar under Khowai district on Monday morning, five shops and two houses completely gutted into ashes, which had broke out from a computer shop.",
				"imageName":"T181020222.jpg",
                "publishedAt":"Agartala, October 18, 2022",
                "content":"<p>In a devastating fire incident held at Hathkatha Bazar under Khowai district on Monday morning, five shops and two houses completely gutted into ashes, which had broke out from a computer shop.</p><p>After the fire incident, immediately, firefighters rushed to the spot and in association with local people, they somehow managed to douse the engulf.</p><p>Firefighter sources said that fire erupted in the five shops from an electric short-circuit and engulf started from a computer shop near Bir Chandra HS School in Hathkatha Bazar and within minutes, the fire spread into four more shops.</p><p>At the back side of these shops house of one Ajoy Deb and house of another person were also completely gutted into ashes. Seeing the high flames of fire, another firefighting engine has also rushed to the spot and they managed to douse the fire.</p><p>Sources added that the properties amounting in lakhs have also been destroyed in the fire incident.</p>"
			},
			{
                "id":"T181020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"City police arrested a drug peddler, recovered drugs",
                "description":"As part of the anti-narcotic drives by the Agartala city police on Monday evening one drug peddler was arrested from Math Choumohani area under East Agartala police station with large quantities of Brown Sugar and illegal liquors under his possession.",
				"imageName":"T181020223.jpg",
                "publishedAt":"Agartala, October 18, 2022",
                "content":"<p>As part of the anti-narcotic drives by the Agartala city police on Monday evening one drug peddler was arrested from Math Choumohani area under East Agartala police station with large quantities of Brown Sugar and illegal liquors under his possession.</p><p>Giving details of the raid, SDPO (Sadar) Ajoy Kumar Das on Monday evening said that based on specific information over procurement and sale of narcotic items, a team of police raided at the house of Sishir Kumar Banik at Math Choumohani area and in the course of search operation, police recovered large quantities of Brown Sugar vials and illegal liquors. Police arrested his son Soumyabrata Banik for running narcotic trade under NDPS Act case and he will be produced before a local court on Tuesday for further interrogation.</p><p>Das also said that police started an investigation to crack the nexus of drug peddlers across the city and area and after interrogation of the arrested peddler, they will be able to find out the routes of drug smuggling.</p><p>Based on other specific information, the police personnel from Battala and Ramnagar town outposts (TOPs)  conducted joint raids and nabbed two drug peddlers namely Kudduch Miah of Bhati Abhoynagar and Mama Miah of bordering Rajnagar. Police also recovered and seized two pouches of Brown Sugar approximate weight of 16 grams under their possession. Both drug peddlers were arrested under Narcotic Drugs and Psychotropic Substances Act, 1985 (NDPS Act) case and will forward them before a local court on Tuesday with police remand appeals for further interrogation.</p><p>SDPO Das said that they will unearth the entire nexus of drug smugglers and will arrest more such peddlers operating in the city areas.</p>"
				},
             {
                "id":"T171020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Former UP Minister Mahendra Singh nominated as poll observer for state BJP",
                "description":"The central leadership of BJP on Sunday appointed Mahendra Singh, a former minister in Uttar Pradesh, as the election in-charge for Tripura, where the Assembly polls will be held in 2023.",
                "imageName":"T171020221.jpg",
                "publishedAt":"Agartala, October 17, 2022",
                 "content":"<p>The central leadership of BJP on Sunday appointed Mahendra Singh, a former minister in Uttar Pradesh, as the election in-charge for Tripura, where the Assembly polls will be held in 2023.</p><p>Rajya Sabha member Samir Oran and national president of BJP ST Morcha will be the co-in-charge. Singh, known as a strong and dedicated organizational leader of the BJP, who has served the party as national secretary and was also in charge of the party's affairs in Assam.</p><p>Singh is an MLC from Uttar Pradesh. He was a minister in the first Yogi Adityanath government in the state, but was not retained after the BJP was re-elected to power this year.</p><p>Chief Minister Dr Manik Saha in his tweet message said &quotheartiest congratulations to Hon’ble MLC Shri Mahendra Singh Ji and Shri Samri Oran Ji for being nominated as BJP’s observer and co-observer for upcoming assembly polls in Tripura. I believe the BJP will secure a historic win in the Assembly polls.&quot</p>"
             
            },
			{
                "id":"T171020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Two Digital Banking Units in Agartala and Udaipur starts functioning",
                "description":"The Prime Minister Narendra Modi dedicated 75 Digital Banking Units (DBU) across 75 districts to the nation via video conferencing and 75 DBUs, two are in Agartala and Udaipur were also inaugurated by dignitaries.",
                "imageName":"T171020222.jpg",
                "publishedAt":"Agartala, October 17, 2022",
                 "content":"</p>The Prime Minister Narendra Modi dedicated 75 Digital Banking Units (DBU) across 75 districts to the nation via video conferencing and 75 DBUs, two are in Agartala and Udaipur were also inaugurated by dignitaries.</p><p>The Agartala branch of Union Bank of India (UBI) and Udaipur’s Gokulpur branch of Punjab National Bank (PNB) have equipped DBU facilities in Tripura.</p><p>While, kicked off the DBU services in UBI branch at Agartala on Sunday, Information and Cultural Affairs (ICA) Minister Sushanta Chowdhury accompanied by chairman of Dainik Sambad Trust and veteran advocate Sanjoy Paul said the 75 Digital Banking Units (DBU) will further financial inclusion and enhance banking experience for citizens. “DBU is a big step in the direction of Ease of Living for the common citizens”, he said and added that such a banking setup, the government aims to provide maximum services with minimum infrastructure, and all of this will happen digitally without involving any paperwork.</p><p>It will also simplify the banking procedure while also providing a robust and secure banking system.&quot “People living in small towns and villages will find benefits like transferring money to availing loans. Digital Banking Units are another big step in that direction which is going on in the country to make the life of common man of India easier&quot, said Chowdhury.</p><p>He said that the government's aim of banking services to the last man in line will further expedite the DBU facilities.</p><p>Inaugurating the DBU services in Gokulpur’s PNB branch, Agriculture and Tourism Minister Pranajit Singha Roy hoped that the local people including businessman, farmers and other citizens of the locality will get the facilities of DBU.</p><p>Singha Roy said  that the aim of the government is to empower the common citizen and make them powerful, and as a result, policies were made keeping in mind the last person and the entire government moving in the direction of their welfare and will make the banking system more transparent and user friendly to common people.</P><p>It may be recalled here that as part of the Union budget speech for 2022-23, the Union Finance Minister announced setting up the 75 DBUs in 75 districts to commemorate the country's 75 years of independence. The DBUs are being set up with the objective to ensure the benefits of digital banking reach every nook and corner of the country and will cover all the states and Union territories. 11 Public Sector Banks, 12 Private Sector Banks and one Small Finance Bank participated in the Sunday’s endeavour.},</p>"
				 },
				 
				 {
                "id":"T171020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Three youths died in past 24-hours, two suspected murders",
                "description":"In three separate incidents, three persons were died in three separate parts of the state and the family members of two persons alleged they were killed, while another body was found in hanging condition.",
				"imageName":"T171020223.jpg",
                "publishedAt":"Agartala, October 17, 2022",
                 "content":"<p>In three separate incidents, three persons were died in three separate parts of the state and the family members of two persons alleged they were killed, while another body was found in hanging condition.</p><p>Police sources said that on Saturday midnight, one Samir Bhowmik (34) suffered critical head injuries near Kumarghat petrol pump under Unakoti district and was shifted to a local hospital. After his condition deteriorated, injured Samir was shifted to GB Hospital. But, on Sunday noon succumbed to death due to his critical head injuries.</p><p>While, victim family persons alleged that during the incident, Samir had Rs. 1 lakh with him, which has been missing after the accident and they also complain that considering the nature of injuries, it’s not a simple road accident and some foul play behind the death of Samir.</p><p>In another incident one 26-year-old young boy named Tapas Roy was severely beaten to death by some local youths owing allegiance to the ruling party in Chelagang Subhash Colony area under Amarpur police station on Friday evening. Later, the family members of the injured boy rescued him and took him to a local hospital. But his condition was critical and he was shifted to GB Hospital for better treatment where succumbed to death on Sunday.</p><p>It is alleged that the youths demanded a large amount of Durga Puja subscription, but Tapas Roy's family refused to pay the huge amount of subscription as per their demand. Later on Friday, some youths of the area got together and entered his house and they vandalized the house, then they beat Tapash Roy and his mother. On Sunday morning during treatment Tapas Roy died in the GB Hospital.</p><p>Later, his family filed a specific FIR against all miscreants responsible for the death of Tapas, who was an active worker of DYFI.</p><p>In the third incident, the local police of Bholagiri area under NCC police station Agartala noticed a body of a young man hanging in a tree and they informed the matter to police. Police rushed to the spot and recovered the body and identified the deceased youth as Ranjit Sarkar (35), by profession a driver.</p><p>After autopsy police handed over the body to his relatives and they speaking with media persons said that they are in to total dark over the reason of suicide of Ranjit Sarkar. While, police added that they registered an unnatural death (UD) case and started investigation to unearth the reason for his suicide.</p>"
				 },
			{
                "id":"T151020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"More leaders to join Tipra-Motha to strengthen Tipraland demand, Pradyot",
                "description":"Before the ensuing 2023 assembly elections in Tripura, the regional Tipra-Motha will not leave any stone unturned to win the elections to fulfill their main demand of ‘greater Tipraland’, said Tipra-Motha’s chairman Pradyot Kishore Debbarma.",
                "imageName":"T151020221.jpg",
                "publishedAt":"Agartala, October 15, 2022",
                 "content":"<p>Before the ensuing 2023 assembly elections in Tripura, the regional Tipra-Motha will not leave any stone unturned to win the elections to fulfill their main demand of ‘greater Tipraland’, said Tipra-Motha’s chairman Pradyot Kishore Debbarma.</p><p>Addressing a press meet here at Manikya Court on Saturday afternoon, where after resigning from Tripura assembly, former IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Saturday formally joined Tipra-Motha along with hundreds of supporters and leaders from Raima Valley.</p><p>Pradyot said that one malicious propaganda has been campaigning against their party by spreading false narrative that Motha is a communal party, but in reality the Motha only wants development of Autonomous District (ADC) areas and its people irrespective of caste and creed.</p><p> &quot;I am from the family, which has given patronage to Rabindranath Tagore and lakhs of refugees, &quot;, said Pradyot and added that nowadays the politics of regional parties has been changed and more and more people are strengthening the movements of Tipra-Motha.</p><p>He said more leaders from different political parties will soon join Tipra-Motha and strengthen their movements for ‘greater Tipraland’.</p><p>He once again reiterated that if the government of India wants for dialogue , they are ready for that and the government has to assure them in writing for greater Tipraland. He said that they are not against any political party, but will not repeat the politics, which had been formed before last 2018 assembly elections.</p><p>He also appealed to the government that they are elected representatives and the government should invite them for dialogue, especially the Union Home Ministry to fulfill their demands.</p><p>Pradyot again reiterated that Motha will contest the 2023 assembly elections of its own and will not take a single penny from political parties like the BJP, CPI(M) or from Congress.</p><p>Speaking in the press meet former IPFT MLA Dhananjoy Tripura alleged that ruling BJP did nothing for the development of 12 lakh tribal populations of the state and strengthen the movements led by Pradyot Kishore, he has decided for resignation.</p><p> &quot;We will work for 12 lakh Tiprasa under the leadership of Maharaja and will strengthen the ‘Dopha’ (society) to fulfill the dream of greater Tipraland, &quot; said elated Dhananjoy.</p><p>He also said that there are no politics remaining in ruling alliance IPFT as the guardian of the party is now battling for his life due to illness.</p><p>Tripura said that with the so-called package for ADC, the development for indigenous people will not come into reality else they are now empowered with separate state status. Former IPFT MLA has also asked why not a smart city project for Khumulwng, if the present BJP government wants to develop the socio-economic status of the tribal.</p>"
             
            },
			
            {
                "id":"T151020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"13 TPS, IPS officers transferred",
                "description":"In another administrative reshuffle, altogether 13 police officers including one IPS and 12 TPS Grade-II officers in different wings of state police.",
                "imageName":"T151020222.jpg",
                "publishedAt":"Agartala, October 15, 2022",
                 "content":"<p>One after one successive operation, the capital city police has managed to curb growing incidents of stolen cases across the city and within the last 18 days, altogether 15 noted thieves were arrested only by West Agartala police station.</p><p>Giving details of their successive operations to control activities of thieves and other miscreants around the city, SDPO (Sadar) Ajoy Kumar Das on Saturday said that on Friday midnight, the police personnel from West Agartala police station arrested two noted thieves identified as Sukhen Hrishi Das of Durga Choumohani area and Sukhen Tanti of Ranir Bazar area.</p><p>He said that based on secret information, police have arrested the duo from their hideouts and stolen items including LED TV under their possession. Das added that both arrested thieves were also involved in a number of stolen incidents committed across the city and both arrested thieves will be produced before a local court with police remand appeals for further interrogation.</p><p>He hoped that soon , the city police would manage to arrest the remaining gang members of thieves, who had created panic across the city by committing stolen incidents one after one.</p>"
             
            },
            {
                "id":"T151020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"15 noted thieves arrested in last 18 days by city police",
                "description":" One after one successive operation, the capital city police has managed to curb growing incidents of stolen cases across the city and within the last 18 days, altogether 15 noted thieves were arrested only by West Agartala police station.",
                "imageName":"T151020223.jpg",
                "publishedAt":"Agartala, October 15, 2022",
                 "content":"<p>In another administrative reshuffle, altogether 13 police officers including one IPS and 12 TPS Grade-II officers in different wings of state police.</p><p>The General Administration (Personnel and Training) department through a notification issued on Saturday said that six Dy.SPs of the state police were transferred as new subdivisional police officers (SDPOs) for Teliamura, Longtharai Valley, Sabroom, Kamalpur, Santirbazar and for Udaipur subdivisions.</p><p>Among the transferred police officer one IPS officer Mourya Krishna Chandrasekar posted as assistant SP of North Tripura district has been transferred as new SDPO of Santirbazar and other TPS grade-II officers were transferred as SDPOs, Dy.SPs in Crime Branch, Traffic unit, PHQ, GRP, CIAT and in Home Guard organizations.</p>"
             
            },
            {
                "id":"T151020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"More leaders to join Tipra-Motha to strengthen Tipraland demand, Pradyot",
                "description":"Before the ensuing 2023 assembly elections in Tripura, the regional Tipra-Motha will not leave any stone unturned to win the elections to fulfill their main demand of ‘greater Tipraland’, said Tipra-Motha’s chairman Pradyot Kishore Debbarma.",
                "imageName":"T151020221.jpg",
                "publishedAt":"Agartala, October 15, 2022",
                 "content":"<p>Before the ensuing 2023 assembly elections in Tripura, the regional Tipra-Motha will not leave any stone unturned to win the elections to fulfill their main demand of ‘greater Tipraland’, said Tipra-Motha’s chairman Pradyot Kishore Debbarma.</p><p>Addressing a press meet here at Manikya Court on Saturday afternoon, where after resigning from Tripura assembly, former IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Saturday formally joined Tipra-Motha along with hundreds of supporters and leaders from Raima Valley.</p><p>Pradyot said that one malicious propaganda has been campaigning against their party by spreading false narrative that Motha is a communal party, but in reality the Motha only wants development of Autonomous District (ADC) areas and its people irrespective of caste and creed.</p><p> &quot;I am from the family, which has given patronage to Rabindranath Tagore and lakhs of refugees, &quot;, said Pradyot and added that nowadays the politics of regional parties has been changed and more and more people are strengthening the movements of Tipra-Motha.</p><p>He said more leaders from different political parties will soon join Tipra-Motha and strengthen their movements for ‘greater Tipraland’.</p><p>He once again reiterated that if the government of India wants for dialogue , they are ready for that and the government has to assure them in writing for greater Tipraland. He said that they are not against any political party, but will not repeat the politics, which had been formed before last 2018 assembly elections.</p><p>He also appealed to the government that they are elected representatives and the government should invite them for dialogue, especially the Union Home Ministry to fulfill their demands.</p><p>Pradyot again reiterated that Motha will contest the 2023 assembly elections of its own and will not take a single penny from political parties like the BJP, CPI(M) or from Congress.</p><p>Speaking in the press meet former IPFT MLA Dhananjoy Tripura alleged that ruling BJP did nothing for the development of 12 lakh tribal populations of the state and strengthen the movements led by Pradyot Kishore, he has decided for resignation.</p><p> &quot;We will work for 12 lakh Tiprasa under the leadership of Maharaja and will strengthen the ‘Dopha’ (society) to fulfill the dream of greater Tipraland, &quot; said elated Dhananjoy.</p><p>He also said that there are no politics remaining in ruling alliance IPFT as the guardian of the party is now battling for his life due to illness.</p><p>Tripura said that with the so-called package for ADC, the development for indigenous people will not come into reality else they are now empowered with separate state status. Former IPFT MLA has also asked why not a smart city project for Khumulwng, if the present BJP government wants to develop the socio-economic status of the tribal.</p>"
             
            },
            {
                "id":"T141020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Ruling ally IPFT MLA Dhananjay Tripura resigns from state assembly, will join Tipra-Motha",
                "description":" In another sudden political development and  yet another big blow to the regional Indigenous Peoples Front of Tripura (IPFT) , ruling alliance of BJP-IPFT Tripura government, IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Friday submitted  his resignation as MLA from the state assembly and joined the ‘Tipra Motha’ party.",
                "imageName":"T141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                 "content":"<p>In another sudden political development and  yet another big blow to the regional Indigenous Peoples Front of Tripura (IPFT) , ruling alliance of BJP-IPFT Tripura government, IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Friday submitted  his resignation as MLA from the state assembly and joined the ‘Tipra Motha’ party.</p><p>Dhananjay Tripura along with Tipra-Motha’s supremo and royal scion Pradyot Kishore Debbarma appeared in the chamber of assembly speaker Ratan Chakraborty  and formally tendered his resignation personally as required.</p><p>Later, speaking with media persons, Assembly speaker Ratan Chakraborty said that his resignation has been accepted and soon a gazette notification will be issued by the state’s assembly.</p><p>After submitting his resignation, Pradyot Kishore speaking with media persons said that Dhananjoy Tripura and a few other leaders of different political parties, would join Tipra-Motha on Saturday.</p><p>Dhananjoy Tripura (32), who was elected from the Raima Valley Assembly constituency in Dhalai district in the 2018 assembly  polls, is the second IPFT MLA to quit the Assembly since last year.</p><p>IPFT MLA Brishaketu Debbarma also resigned from the Assembly in June last year and joined the TIPRA, reducing the party's (IPFT) strength to seven.</p><p>Dhananjoy Tripura is the sixth MLA of the BJP-IPFT ruling alliance who stepped down from the assembly. Earlier BJP MLAs Burba Mohan Tripura, Ashish Das, Sudip Roy Barman, and Ashish Kumar Saha also quit the party and the Assembly membership after open differences with then Chief Minister Biplab Kumar Deb, who resigned on May 14 following the instructions of the party's central leadership.</p><p>Ashish Das, later joined the Trinamool Congress (TMC) last year and May this year Sudip Roy Barman, also a former BJP Minister and Ashish Kumar Saha joined the Congress in February this year after submitting their resignation as MLAs.</p><p>Sudip Roy Barman was re-elected to the state assembly for the sixth time in the by-elections held  in June as a Congress candidate. Burba Mohan Tripura after his submission of resignation letter as MLA, joined Tipra-Motha.</p>"
             
            },
            {
                "id":"T141020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Prime accused of Aparna Karmakar rape and murder arrested",
                "description":"The murder mystery of a woman identified as Aparna Karmakar Ghosh (43), in which police recovered her body from a drain at tri-junction area of Kalyani and Water Supply road under East Agartala police station on October 12 afternoon, the Agartala city police has arrested prime accused and two other persons on suspicious ground.",
                "imageName":"T141020222.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                   "content":"<p>The murder mystery of a woman identified as Aparna Karmakar Ghosh (43), in which police recovered her body from a drain at tri-junction area of Kalyani and Water Supply road under East Agartala police station on October 12 afternoon, the Agartala city police has arrested prime accused and two other persons on suspicious ground.</p><p>Giving details of the latest improvement of police investigation, SDPO(Sadar) Ajoy Kumar Das during a press briefing at East Agartala police station on Friday evening said that soon after the identity establishment of the deceased woman body as Aparna Karmakar Ghosh (43), wife of Dipak Kumar Ghosh of Chittaranjan area under same police station, her daughter Dwapanita Ghosh filed an FIR at East Agartala women police station with complaint that her mother might be raped and murder.</p><p>He said that police registering the case , started massive investigation and based on the circumstantial and scientific evidences, initially police detained two persons including the paramour of the deceased woman, who was a group-D government employee posted at MBB College library and another suspected accused persons. During interrogation of both detained persons, the police team getting no satisfactory answer from them, were arrested and police before a local court with police remand appeals. Later, the court sent them in police custody.</p><p>While analyzing the CCTV footage of the crime spot, police identified that a person was seen , who was moving with that deceased woman in Scotty. Analyzing the information, police identified that person as Satya Ranjan Ghosh of Devendra Chandra Nagar village of Lembucherra area of West Tripura district and in association with police personnel of Mohanpur subdivision, police on Friday morning managed to arrest him from his house.</p><p>SDPO Das said during interrogation suspected prime accused Satya Ranjan Ghosh revealed that when he returned to his house through Kalyani area from his friend's house on October 11 night, he spotted the deceased woman. After primary discussion, the woman wanted to drink wine and accused Satya Ranjan moved through his Scotty with that woman in city areas and returned back to the same spot.</p><p>Later, accused raped and dumped the woman in the drain water to ascertain her death, said SDPO Das.</p><p>He said that based on confessional statement made by prime accused police will produced him in a court citing police remand to unearth the entire murder scene.</p><p>It may be recalled here that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of the woman in the drain. Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of one e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she did not return.</p>"
              
            },
            {
                "id":"T131020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Body recovered from drain identified, one detain for suspected murder",
                "description":"The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.",
                "imageName":"T131020221.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of on e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she could not return.</p><p>On Wednesday amidst tight security across the Agartala city due to the maiden visit of President Droupadi Murmu, at about 2 PM some pedestrians noticed the floating body of Aparna Karmakar Ghosh in a drain in mysterious condition.</p><p>Soon after the recovery of body, the police led by SDPO (Sadar) started massive investigation to unearth the mystery of the death and within 24-hours, they established the identity of the victim woman and has also detained her paramour over suspicion of her murder.</p><p>While, police sources said that main accused of the murder is another man and police investigation and hunt to trace the main accused has been expedite and soon they will able to resolve the murder mystery, probably for a triangle love affairs.</p>"
            },
            {
                "id":"T131020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "description":"TJust few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government",
                "imageName":"T131020222.jpg",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>Just few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government.</p><p>Addressing a press conference here at CPI(M) headquarters on Thursday evening, CPI(M) state secretary Jitendra Chowdhury said that CPI(M) general secretary Sitaram Yechury along with opposition leader and party’s polit bureau member Manik Sarkar will address the mass gathering, where party workers and their supporters from different parts of the state will gather.</p><p>Chowdhury said that the proposed rally on October 21st is not the party’s election rally, but the rally will be organized to show their protest against four and half years 'misrule' of the present state government and a protest against the prevailing lawlessness situation of the state.</p><p>Castigating the functioning of the state government, Chowdhury alleged that since the formation of BJP government, the rights of common people and the opposition party are being suppressed by the ruling party through their continuous violence.</p><p>He said that from August 16 to September 30 last, the party has organized about 175 to 180 meetings, rallies and demonstrations across the state against the misrule of the state government and in support of basic demand of the state’s people, which received massive support from the cross section of the society.</p><p>He said that day by day the law and order situation of the state is deteriorating and appealed to the state’s people to strengthen their agitation against the government to restore democracy in the state.</p><p>Mentioning the high unemployment rate and political violence in terms of National Crime Record Bureau (NCRB) data, which make Tripura top among all Northeastern states, Chowdhury said that now Chief Minister of the state in recently held Northeast Council (NEC) meeting has admitted Tripura now turns into safe corridor of drug smuggling, which are destroying the young generation of the state.</p><p>He also alleged that during the past four and half years of rule, the BJP government failed to introduce any new project for the benefit of the state's people and claimed that the state government defamed President Droupadi Murmu by inaugurating old projects.</p>"
            },
            
            {
                "id":"T121020221",                          
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "description":"The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.",
                "imageName":"T121020221.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.</p><p>The President Droupadi Murmu in her maiden visit to Agartala arrived at the airport through a special flight and  was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After attending a series of programmes including inauguration of the National Law University (NLU) at Narsingarh and visiting the Durgabari tea estate in the West Tripura district's Mohanpur subdivision, and interacted with tea garden workers.</p><p>The President in another programme held at Rabindra Satabarshiki Bhavan inaugurates, lays foundation stones for various projects for strengthening the connectivity, education sector, Judicial Academy and Law University among the projects.</p><p>While, addressing the gathering the President said that development of the North Eastern region in getting new impetus with various new projects of Highway, Railway, Airway and Waterway after virtually inaugurated an MLA Hostel at Capital Complex, Agartala and laid foundation stones for Maharaja Birendra Kishore Manikya Museum and Cultural Centre; IIIT-Agartala; and various projects of government of Tripura related to roads, schools and hostels for students from Rabindra Satabarshiki Bhavan.</p><p>She said that projects inaugurated today will not only strengthen the connectivity, education, judiciary and legislature in Tripura, but also boost the rich culture of the state.</p><p>The President said that the youth of India have made a unique identity in the field of Information Technology, all over the world. She was confident that the permanent campus of Indian Institute of Information Technology, Agartala will set new benchmarks in the field of Information Technology.</p><p> The President said that a holistic education system is essential for the development of the nation and progress of the youth. ‘Along with higher education, we should give more emphasis on primary education,’ said President and added that she was happy to note that the Ministry of Development of North Eastern Region, in association with Tripura  government, has launched 'Vidya-Jyoti Mission 100' under which 100 existing higher secondary schools will be converted into quality education institutions with state-of-the-art facilities.</p><p>The President said that there is immense potential for development in the North-Eastern Region. Today, development of the Region is getting a new impetus with various new projects of highways, railways, airways and waterways.</p><p>The President said that India has become the 5th largest economy in the world. The North Eastern Region, including Tripura, will play an important role in making India a five trillion dollar economy by 2025. She expressed confidence that the aspirations, innovation and entrepreneurship of the talented and hardworking people, especially the youth of Tripura, will play an important role in achieving this goal.</p><p>While, attending Civic reception hosted by Agartala Municipal Corporation (AMC) here at Agartala Town Hall on Wednesday evening in presence of Chief Minister, Deputy Chief Minister, Urban Development Minister and Mayor of AMC, the President recalling great sacrifice and bravery of Elbert Ekka said that Tripura among the prosperous and proud state of the country, which has been known for producing least plastic waste.</p><p>The President thanked the people of Tripura for their warm welcome. She said that the composite culture of Tripura is the pride of India. The tribal community of Tripura has maintained a beautiful amalgamation of democracy and tradition.</p><p>The President said that living in harmony with nature is the specialty of tribal society. Most of the area of Tripura is rich in forest resources. In preserving this invaluable forest wealth, the natural lifestyle of the tribal society has played an important role.</p><p>Tripura was on the top place in achieving the target of ‘Responsible Consumption and Production’, included in the Sustainable Development Goal –12 during the year 2020-21, said Murmu and added that Tripura is one of the two states that generate the least plastic waste.</p><p>Tripura is a power-surplus state and it exports electricity to Bangladesh and the connectivity between Bangladesh and India has increased with the construction of ‘Maitri Setu’ over Feni River, said President and added that at the same time, it has become convenient for the entrepreneurs of Tripura to use the ports of Chittagong and Ashuganj.</p><p>From the very beginning, Tripura has played a major role in deepening India's friendship with Bangladesh, said Murmu and expressing happiness added that Tripura is making steady progress as an educational hub. She said that many institutions of higher and professional education are established in the state, where students from not only the North Eastern region but also from other parts of India and abroad come for education. She was also happy to note that Tripura has achieved the target of 100 percent enrollment at the level of elementary education.</p><p>Appreciating the artistic craft made by bamboo by thousands of bamboo artisans of the state, the President said that the government is taking holistic steps to improve the socio-economic  status of tribes including tea-garden workers.</p><p>Earlier, the President visited Albert Ekka War Memorial in Agartala and paid homage to brave soldiers who made the supreme sacrifice in the line of duty during the 1971 Bangladesh Liberation war.</p>"
            },           
            {
                "id":"T121020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Unidentified woman body recovered from drain in Agartala city",
                "description":"Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.",
                "imageName":"T121020222.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.</p><p>Soon after recovery of the body, panic triggered in that locality and police with a forensic team rushed to the spot to recover the body.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>While giving details SDPO(Sadar) Ajoy Kumar Das said that apparently there were no injury marks in the body and police cannot say anything in details till the finding of autopsy and forensic report.</p><p>He said that till night the identity of the deceased woman was yet to be established and even the local people were not able to identify the woman. Das added that police registering an unnatural death (UD) case started investigation to identify the woman and reason of her death and who the body has been found in the drain water.</p>"
            },
            {
                "id":"T121020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Tripura ready to welcome President Droupadi Murmu",
                "description":"All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.",
                "imageName":"T121020223.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.</p><p>President Droupadi Murmu, will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state. On Wednesday morning at about 11.15 AM through a special flight President will arrive at Agartala airport and Tripura Police will welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Giving details of the tour programmes of the President, DM and SP of the West Tripura district Debapriya Burdhan and Sankar Debnath addressing a press conference on Tuesday afternoon said that after guard-of-honour and reception of the President in the Airport, she will move for Narsingarh to inaugurate the new building of Judicial Academy and will lay the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present.</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>While giving details of the security measures SP(West) Sankar Debnath said that tight security measures had been and a large number of security forces were deployed in Agartala and Udaipur, where the President is scheduled to visit on both days.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Debnath added  that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit. He said that during movement of the President's convoy, the road traffic system will be restricted and appealed to the people to cooperate with the security personnel during the proposed visit of the President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"T121020224",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"64 voters from PCC to cast votes for AICC president’s election",
                "description":"A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.",
                "imageName":"T121020224.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.</p><p>AICC set up 67 polling booths  across the country  'Kharge vs Tharoor' fight on Oct 17, where the last electoral contest for the top post of the party took place in the year 2000 when Jitendra Prasada had suffered a crushing defeat at the hands of Sonia Gandhi.</p><p>For the Congress president election, Shashi Tharoor and Mallikarjun Kharge are the party's two contestants and the counting of ballots will be taken up on October 19 and results will be declared as to who between the two candidates, octogenarian Mallikarjun Kharge or shashi Tharoor, will win the election.</p><p>PCC president Birajit Sinha said that a ten member delegation of Tripura Congress led by PCC working president Sushanta Chakraborty, Niranjan Das and Abhijit Sarkar had gone to Guwahati and attended a meeting addressed by Kharge on Monday. He said that the PCC does not receive any communication from AICC, whether candidates Mallikarjun Kharge or shashi Tharoor will come into Tripura for the poll campaign.</p><p>Sinha said that senior Congress leader Abdul Hannan has been appointed as presiding officer for elections in Tripura which will come off at the Congress Bhavan on October 17 next and the Tripura Pradesh Congress’s working president Sushanta Chakraborty and Pancham Misra have been appointed as election agents.</p><p>He added that said that all the voters of TPCC have been informed of the election schedule and they will duly turn up on the scheduled day for casting their ballots in favour of their candidate  7. Elections will take place on October 17 in every state capital from 10 AM to 4 PM, Sinha said, adding that the vote will be by secret ballot. All the state’s ballot boxes will be brought to Delhi and counting will take place on October 19 and results will be declared the same day, he said.</p><p>Ballot papers will also be sent to the Bharat Jodo Yatra campsite in Karnataka and a booth will be set up there for the yatris, he said. More than 9,000 Pradesh Congress Committee (PCC) delegates will vote in the poll</p>"
            },
            {
                "id":"T121020225",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Opposition will boycott President’s programmes",
                "description":"Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC)",
                "imageName":"T121020225.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC).</p><p>CPI(M) state secretary Jitendra Chowdhury through a press statement said that the during the visit of President, the state government will organize civic reception and another government programme and the state government has sent invitations to the CPI(M) state secretary, party MLAs and former MPs, but the state secretariat members of the party welcome the visit of President and decided to be absent from both programmes in protest of four and half years long violence against opposition.</p><p>Chowdhury said that there are no rules of law and everyday there are attacks on personal liberty and citizen’s rights and now the present situation goes that even the rights to pay tribute to martyrs of the party have been snatched by the ruling party.</p><p>CPI(M) hoped that the President will realize the suffocation environment prevailed in the past four and half years and from her position will take steps to restore the rights of people in the state.</p>"
            },
            {
                "id":"T121020226",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"NF Railways to upscale its services and infrastructure in Tripura",
                "description":"In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.",
                "imageName":"T121020226.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.</p><p>Towards this direction it has again decided to extend the services of train number 02518/02517 to Agartala. This train was so far running between Kolkata and Guwahati. Now the passengers could board this train at Guwahati in the evening and will reach Agartala the next morning. Further, the recently introduced Jan Shatabdi Express train’s service between Agartala to Jiribam in Manipur will be extended up to Khongsang in Manipur. With this the train will run over an additional 55 km. distance and it will be able to cover a distance of 300 km in six hours. This train will also have a new LHB rake with latest amenities and a Vistadome coach to promote tourism in this section, informed the Divisional Railway Manager J.S. Lakra today at a press meet at the Agartala rail station.</p><p>The DRM of NF Railways further informed that a survey for a second line between Lumding – Badarpur via Lanka- Chandranathpur has been sanctioned by the Railway Board and will be completed by March 2023. The work of electrification of the Lumding-Agartala line is expected to be completed by December, 2023. Survey for new line between Dharmanagar-Pecharthal up to Belonia via Kamalpur-Khowai[1]Agartala measuring 178.72 km has been completed. The Railways has also started a survey for upgrading the Agartala rail station with modern state of the art facilities.</p><p>Two escalators are being constructed here and these are expected to be completed next month. Two more escalators are coming up at Dharmanagar rail station. Expanding commercial opportunities the NF Railway has opened two modular stalls at Agartala rail station and very soon such modular stalls will be opened at Udaipur, Belonia, Sabroom, Ambassa, Kumarghat and Dharmanagar station. This is being done under the ‘One Station One Product’ scheme to showcase the indigenous products of Tripura. Local artisans have been requested to make maximum use of this opportunity. At the same time NF Railway has introduced e-auction schemes to delegate parking, pay and use toilet, advertisement space at the rail stations in Tripura for commercial use. In an effort to improve freight transport and logistics, works for additional goods terminals at Sekerkote and Agartala have been shortlisted and one additional goods line at Agartala is being processed. The NF Railways has also been coordinating with local traders for boosting trade by providing parcel train facilities for the transport of rubber, timber, pineapple, jackfruit and other indigenous products of the region. In the international connectivity sector the Agartala-Akhaura rail line is expected to be completed in the next four-five months.</p>"
            },
            {
                "id":"T121020227",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"President Murmu on two-day visit to Tripura arrived",
                "description":"Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.",
                "imageName":"T121020227.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.</p><p>Soon after landing of her special flight in Agartala airport, President was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After rousing welcome, Tripura police welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Then, President leaves the airport towards the venue for inauguration of Tripura Judicial Academy in Narsingarh and inaugurated the new building of Judicial Academy and has also laid the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT. </p>"
            },
            {
                "id":"T101020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Govt committed for zero tolerance against drug trafficking, border security to be strengthen,  CM",
                "description":"The central government has stressed for concrete efforts by all agencies with better coordination among themselves along with neighbouring Bangladesh to control the drug trafficking in the region, said Chief Minister Dr Manik Saha.",
                "imageName":"T101020221.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>The central government has stressed for concrete efforts by all agencies with better coordination among themselves along with neighbouring Bangladesh to control the drug trafficking in the region, said Chief Minister Dr Manik Saha.</p><p>After attending the two days plenary meeting of North East Council (NEC) held at Guwahati, Chief Minister Dr Manik Saha on Monday afternoon soon after his return , addressing a press conference here at Civil Secretariat on Monday afternoon accompanied by Chief Secretary J K Sinha and DGP Amitabh Ranjan said that Tripura being used a corridor for drug smuggling to its ultimate destination in Bangladesh and drugs are being smuggle through state’s border from Myanmar.</p><p>He said that Union Home Minister Shri Amit Shah chaired the meeting with Chief Ministers, Chief Secretaries and Director Generals of Police of all North Eastern States on ' Drug Trafficking and National Security ' in Guwahati  and it has elaborate discussion  over  drug abuse scenario in the NorthEast region and ways to reduce it. The meeting was also attended by the Union Home Secretary, Director General of Narcotics Control Bureau (NCB) and other senior officials.</p><p>He said that as the spread of drugs in the society ruins generations, the union government has given its maximum efforts to stop the menace from the region and the Union Home Minister takes it very seriously to make the region drug free. The policy and other agencies have adopted zero tolerance to thwart every attempt by organized mafia to harm the country's economy and national security, said Dr Saha.</p><p>While, giving details of over the achievement of the state to reduce the drug menace and steps being taken by the state government, Dr Saha highlighting his speech in the NEC meeting</p><p>On October 8th , the meeting held for regional cooperation and drug trafficking and held detailed discussion, Tripura highlighted that Tripura is a corridor for drug smuggling and its market  and drugs are being smuggled from Myanmar and via Tripura it reaches Bangladesh including different tablets, Heroin, Brown Sugar and other codeine based drugs. “We highlighted the issues that drugs are coming into our state from Mizoram and Assam state after being transported from Myanmar,” said Dr Saha.</p><p>The government of Tripura launched its ‘Nesha Mukta Tripura” drive and now Tripura police are getting largest seizure in the region and around 700 vehicles, till date has also been seized by the state police from 2018, said Saha and added that government has formed Special Investigation Team (SIT) and 19 cases were registered till September, 2022 and government is maintaining its close monitoring and coordination, resulting in conviction has received in seven cases.</p><p>Mentioning the drive and operations against drug trafficking, the state government also registered 39 cases against financial transaction and seized properties, freezes accounts and cash amount of Rs. 6.5 crore has also seized, said Dr Saha and through team work with central agencies, Narcotic Control Bureau (NCB), ED, Directorate of Revenue Intelligence (DRI), the state’s police are getting success to control the menace.</p><p>He also said that the government has also stressed on massive awareness and a group of guards has been formed in every school to protect the school students from drug abuse.</p><p>“There are challenges due to geographical location and for porous international border, smugglers are taking the advantages of unfenced border,”, said Dr Saha and added that they have urged the union government to complete the border fencing in remaining stress and install Naka point in bordering areas with Assam and Mizoram.</p><p>Tripura has also urged for setting up a NCB branch in the state and also stressed for better coordination with Bangladesh to abolish the menace from its root and its ultimate destination, said the Chief Minister.</p><p>The Chief Minister also said that this is for the first time, the Union Home minister held a meeting on drug trafficking with CMs and DGPs of the NE states and HM made it clear that the country will not allow its soil to be used for narcotics smuggling.</p><p>During the meeting Chief Minister also made some special proposals to curb drug smuggling and has also urged the Home Minister to strengthen vigil in bordering areas by strengthening the BSF.</p><p>Dr Saha sought financial support from the centre to improve the technological support against the drug menace and to boost surveillance measures across the border.</p>"
            },
            {
                "id":"T101020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Massive security arrangements made for President visit",
                "description":"Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "imageName":"T101020222.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Tight security measures also took place in Agartala and Udaipur, where the President is scheduled to visit the temple town on October 13 next.</p><p>On Monday morning DGP Amitabh Ranjan accompanied by the officials of President’s security guard and other officials visited all venues including Agartala airport, railway station and Rabindra Satabarshiki Bhavan and reviewed the security measures.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Police sources said that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit.</p><p>Official sources said that President Droupadi Murmu will inaugurate several development projects in the state during her two-day visit from Wednesday.</p><p>The President is scheduled to land at Maharaja Bir Bikram Airport here on Wednesday at 11.15 am. It will be Murmu's first visit to the state after becoming the President. During the visit, Murmu will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>The President is scheduled to lay the foundation stone of Pushbanta Palace Museum, will inaugurate the Tripura Judicial Academy at Narsingarh in West Tripura district and will also participate in the 75th anniversary celebration of MBB College.</p><p>The state government plans to develop Pushbanta Palace which was built by Maharaja Birendra Kishore Mankya Bahadur in 1917 into a digital museum. The Pushbanta palace was the official residence of the Governor till April 2018.</p><p>The President  will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>The president is scheduled to visit Udaipur to offer prayer to Tripura Sundari temple on October 13 and will leave the state for Guwahati at 1.10 pm.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"T101020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"City police arrested 13 bike lifters, 5 stolen bikes recovered in past 15 days",
                "description":"In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.",
                "imageName":"T101020223.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.</p><p>In their continuous investigations and operations, the city police has so far burst the inter-state motor bike lifter gang and based on the interrogation statements of previous arrested bike lifters, the West Agartala police station on Sunday midnight have also managed to detain two motor bike lifters.</p><p>While, giving details, SDPO(Sadar) Ajoy Kumar Das speaking with media persons on Monday afternoon here at West Agartala police station said that after thorough interrogation of two detained bike lifters identified as Sujjan Hussain of Madhupur and Kishore Paul of bordering Rajnagar area of Agartala, police recovered two stolen motor bikes under their possession.</p><p>He said that with the arrest of two new bike lifters, many gang members of inter-state bike lifters have been arrested so far and among them 11 are in jail custody. Das said that police arrested both Sujjan Hussain and Kishore Paul and they will be produced before a local court on Tuesday with police remand appeals for further interrogation.</p><p>He said that a gang of property thefts and snatchers from North Tripura are staying in the capital city for months in rented houses and they were involved with many stolen incidents. After snatching a number of motor bikes, they smuggled these stolen bikes to neighbouring Bangladesh through their international theft network.</p><p>He also said that police have identified all the gang members and soon they will be able to arrest more lifters.</p><p>During the past one month, the capital city police have arrested a number of thieves and motor bike lifters involved in a series of stolen incidents and after the arrest of these criminals, the growing number of stolen incidents  across Agartala has also started decreasing.</p>"
            },
            {
                "id":"T091020221",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Security agencies must destroy all routes of drug trafficking:  Amit Shah",
                "description":"The Union Home Minister Amit Shah on Saturday stressed that seizing narcotics alone cannot make the country drug-free and enforcement agencies must target for  destroying all channels between traffickers and consumers.",
                "imageName":"T091020221.jpg",
                "publishedAt":"Guwahati, October 9, 2022",
                "content":"<p>The Union Home Minister Amit Shah on Saturday stressed that seizing narcotics alone cannot make the country drug-free and enforcement agencies must target for  destroying all channels between traffickers and consumers.</p><p>Addressing the regional meeting on 'Drug Trafficking and National Security' at Guwahati, the Home Minister said under 'Azadi Ka Amrit Mahotsav', a target to destroy 75,000 kg narcotics was set but under the leadership of Prime Minister Narendra Modi, the country so far destroyed over 1.5 lakh kg narcotics , which is more than double the target set.</p><p>During the regional meeting, Tripura Chief Minister Dr Manik Saha along with Chief Secretary J K Sinha and DGP  Amitabh Ranjan were also present with other NE states CMs, CSs, DGPs and heads of other security agencies.</p><p>While chairing a meeting with Chief Ministers of Northeastern states and top police officials in Guwahati, Union Home Minister Amit Shah said that stern actions would be taken to check the drug menace in the region.</p><p>After destroying 1.5 lakh narcotics,  the war against drugs is not yet finished.  The country is now  dreaming for a drugs-free India and for that, all stakeholders should work together, said Shah.</p><p>Shah further said that the Union Government has formulated a two-fold approach to deal with the drug menace which has spread all over the country.</p><p>Strong actions will be taken against those involved in drug peddling, while those who are the victim and fell into this vicious cycle, government machinery will work to bring them into the mainstream of the society, said Shah.</p><p>The Union Home Minister also said that narcotic substances were primarily smuggled into the country from Myanmar and Afghanistan. In the meeting with NCB officials and security personnel he directed to increase the vigil along all  international borders.</p><p>The security of the nation can only be ensured if drug trafficking and all related channels are destroyed as insurgency, arms smuggling, and other anti-national activities are linked to trafficking, he said. Shah also said insurgency along with arms trade and drug trafficking are two sides of a coin.</p><p>He also urged the law-enforcing, health, revenue, and social revenue departments to adopt a   strategy  for ensuring that drug trafficking is stopped.</p><p>He urged the chief ministers, chief secretaries, and director generals of police of the Northeastern states to adopt strategies to eradicate drug menace from the region.</p><p>Apart from the NCB Guwahati zonal unit, three new zones at Manipur, Arunachal Pradesh and Tripura have been approved while a new regional office will come up at Guwahati, said Shah.</p>"
            },
            {
                "id":"T091020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"AIKS demands immediate roll back of hiked CNG prices",
                "description":"The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.",
                "imageName":"T091020222.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.</p><p>Speaking with media persons, AIKS, state secretary and veteran CPI(M) leader Pabitra Kar condemning the price hike decision of the government said that it’s a secret attempt of the government to increase the burden of high inflation among the general people.</p><p>The abrupt hike of Compressed Natural Gas (CNG) prices will directly impact on the daily earning of about 20,000 auto-rickshaws and other light motor vehicles, which are solely depend on CNG to run their passenger services, said Kar and added that government has also abnormally hiked prices of pipeline gas (PNG) at about 50 % during last four and half years.</p><p>Giving statistics on hiked CNG and PNG prices, Kar said that on April 1st, 2018 the price per kilogram of CNG was Rs. 41 and now it stands at Rs. 77.30 per kilogram.</p><p>It may be recalled here that amidst festivities of Durga Puja on October 1st , Tripura Natural Gas Company Limited (TNGCL) increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>The abnormal hike of prices of CNG across the state has affected the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.</p><p>TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 1st, the CNG price of TNGCL have also been increased, which in accordance with the order of Union Ministry of Petroleum and Natural Gas has once again abruptly hiked the price of Compressed Natural Gas (CNG).</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p><p>Kar also said that if any customer purchases CNG of Rs. 100, then he has to pay 4 % for VAT and 19.5% for Tripura Road Development Cess, that means Rs. 23.50  taxes only for purchase of Rs. 100.</p><p>Kar said that if the government cannot rollback their decision, then AIKS will organize statewide movements.</p>"
            },
            {
                "id":"T091020223",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"President Murmu to visit Tripura on Oct 12",
                "description":"The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "imageName":"T091020223.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Official sources said that the tour schedules of the President have been finalized and  during the visit the President will inaugurate the Tripura Judicial Academy at Narsingarh and will also participate in the 75th anniversary celebration of MBB College. On October 13 next, she will visit Tripura Sundari temple in Udaipur to offer prayers.</p><p>Sources added that Agartala Municipal Corporation (AMC) will give her civic reception at Agartala Town Hall in presence of Chief Minister Dr Manik Saha along with his cabinet colleagues.</p><p>During a programme at the hall number-1 of Rabindra Satabarshiki Bhavan, the President will virtually inaugurate and lay the foundation of various projects. On October 13, the President will flag off trains from Agartala railway station.</p><p>Sources added that the DGP Amitabh Ranjan held a high-level meeting on security arrangements for the President's proposed visit and top administrative officials had also attended a preparatory meeting for the President's visit and to finalize the receiving details of the tour programme as per the protocol.</p><p>Sources also said that the tour programme has been finalized and security measures are being taken as per the tour schedule of the President. After being elected as President, this will be her first visit to Tripura as President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"T091020224",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Police destroyed huge quantities of seized drugs",
                "description":"As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.",
                "imageName":"T091020224.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.</p><p>Giving details, police said that on the first day of drug disposal, the state police had destroyed drugs worth Rs. 2.33 crore including 3990 kilograms, cannabis ( Ganja), 9416 bottles of contraband cough syrup and 33,525 Yaba tablets.</p><p>On the second day of disposal on Saturday, the DDC destroyed more items of seized drugs including huge quantities of cannabis, banned cough syrup Phensedyl, different kinds of tablets and Heroin.</p><p>Police added that the officials of Union Ministry of Home Affairs (MHA) Amit Shah from Guwahati through video conferencing monitored the entire drug disposal process along with other states of the country during the past two days.</p><p>The Narcotics Control Bureau (NCB) has monitored the disposal process along with state’s agencies, which have  confiscated different anti-drug operations by state police and other security forces.</p><p>Among all Northeast states, the highest quantity of 12,000 kg of drugs was destroyed in Tripura while 4,000 kg of narcotics was burnt in Arunachal Pradesh, 1,600 kg in Meghalaya, 1,900 kg in Manipur 1,900 kg, 1,500 kg in Mizoram and 398 kg in Nagaland and including Assam, a total of  40,000 kg of seized drugs were destroyed during past two days.</p><p>Official sources said that the Union Home Minister Amit Shah, who is currently on a three-day visit to Assam, will hold a meeting on narcotics control with the chief ministers, chief secretaries and directors general of police of the Northeastern states.</p>"
            },
            {
                "id":"T071020221",               
               "category":"NEH",
                "author":"Our Correspondent",
                "title":"President Murmu to visit Tripura for two days from Oct 13",
                "description":"The President Droupadi Murmu will visit Tripura for two days from October 13  and will  inaugurate a number of  developmental projects in the state.",
                "imageName":"T071020221.jpg",
                "publishedAt":"Agartala, October 7, 2022",
                "content":"<p>The President Droupadi Murmu will visit Tripura for two days from October 13  and will  inaugurate a number of  developmental projects in the state.</p><p>Official sources said that during the visit the President will inaugurate the Tripura Judicial Academy at Narsingarh and will also participate in the 75th anniversary celebration of MBB  College. On October 14 next, she will visit Tripura Sundari temple in Udaipur to offer prayers.</p><p>Sources added that the DGP Amitabh Ranjan held a high-level meeting on security arrangements for the President's proposed visit and top administrative officials had also attended a preparatory meeting for the President's visit and to finalize the receiving details of the tour programme as per the protocol.</p><p>After being elected as President, this will be her first visit to Tripura as President and Agartala Municipal Corporation (AMC) will give her civic reception at Agartala Town Hall in presence of Chief Minister Dr Manik Saha along with his cabinet colleagues.</p>"
            },
            {
                "id":"T071020222",               
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"City police burst motorbike lifter gang, one arrested",
                "description":" In a successful attempt, the Agartala city police have burst a gang of motorcycle lifters and arrested a kingpin and seized two stolen motorcycles",
                "imageName":"T071020222.JPG",
                "publishedAt":"Agartala, October 7, 2022",
                "content":"<p>In a successful attempt, the Agartala city police have burst a gang of motorcycle lifters and arrested a kingpin and seized two stolen motorcycles.</p><p>Giving details of the police operation during a media interaction here at East Agartala police station on Friday afternoon,  SDPO (Sadar) Ajoy Kumar Das said that on Thursday midnight  OC of East Agartala police station Rana Chatterjee over suspicious ground detained a suspected bike rider and after interrogation, suspected bike lifter spill the bean.</p><p>Based on the interrogation statement, police team has also recovered a stolen scooty under his possession, said SDPO Das and added that police have arrested a bike lifter identified as Jalauddin from Churaibari area under North Tripura district.</p><p>He said that a gang of property thefts and snatchers from North Tripura are staying in the capital city for months in rented houses and they were involved with many stolen incidents.</p><p>Das added that this active bike lifter gang never stayed in a rented house for two months and they were frequently changing their locations. He also said that police have identified all the gang members and soon they will be arrested. While arrested bike lifter Jalauddin has been produced before a local court with police remand appeals for further interrogation.</p><p>During the past one month, the capital city police have arrested a number of thieves and motor bike lifters involved in a series of stolen incidents and after the arrest of these criminals, the growing number of stolen incidents across Agartala has also started decreasing</p>"
            },
            {
                "id":"T061020221",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Durga puja passed off peacefully barring some stray incidents",
                "description":"The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala",
                "imageName":"T061020221.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala and many other parts of the state on the day of ‘Maha Saptami’ and ‘Maha Nabami’ and  barring some stray incidents of suspected murder and road mishaps  in separate places of the state during last four days.</p<p>The incessant rain on the night of ‘Maha Saptami’ across Agartala and other parts of Tripura, dampens the festival spirit . Resulting in, the majority of low-lying areas of the city getting inundated and road traffic was also badly affected.</p<p>While, irrespective of castes and creeds, a huge number of people thronged puja pandals during the festival days and immersion of Goddess is still going on Thursday also in different places of the state including capital city Agartala.</p<p>No untoward incident was reported from the capital town that alone hosts over 500 puja, said police on Thursday.</p<p>Meanwhile, the great immersion carnival festival “Mayer Goman”, which will be held on October 7 by participation of all major community Durga Puja organizers , the Information and Cultural Affairs (ICA) department is not leaving any stone unturned to make it a historic event for the state’s people.</p<p>Official sources said that all major clubs of the city will participate in the  immersion carnival “Mayer Goman” on October 7th and the government is now making big structures in front of Agartala City Centre for the event.</p<p>Though, four days of Durga Puja passes off peacefully, reports said that few person sustained injuries in several road mishaps due to reckless driving and a minor inmate of a drug rehabilitation centre in Madhupur area under Sepahijala district alleged beaten to death by the authorities of drug rehab centre and victim family has also filed a specific FIR against accused person.</p<p>Despite many apprehensions for bad weather conditions  , people in large numbers were seen visiting pandals in groups braving incessant rains.</p>"
            },
            {
                "id":"T061020222",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "description":"During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event.",
                "imageName":"T061020222.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event. The event which was being held at ONGC premises after three years due to the pandemic-induced disruption made a rousing return as it witnessed massive public participation in thousands and was also widely covered by local media, as people thronged the ONGC KV Ground on the final day of Durga Puja Bijoya Dashami and the Navaratri festival.</p><p>Deputy Chief Minister Dev Varma was welcomed at the KV Ground by Asset Manager Tarun Malik and other senior officers of the Tripura Asset.</p><p>Speaking on the occasion, Jishnu Dev Varma said that the day marks not just the “victory of truth over untruth and ‘Dharma’ over ‘Adharma’ but is also a celebration of motherland and nationalism.” To have the epic tale of Ramayana staged symbolically at such a massive scale and with such huge public participation is also a reflection of how hope always triumphs eventually, he said in reference to the extreme uncertainty and difficulties posed by the pandemic to the people at large. He congratulated ONGC for making this event an important part of Tripura’s local life during this time of the year, and said, ‘none other than ONGC can pull of something like this at such a grand scale, not merely because it has the resources but also for the love that exists between ONGC and the people of Tripura’.</p><p>He also acknowledged the critical role the Maharatna major has played over the years in providing employment to Tripura’s youth as well as generating many business and livelihood opportunities for the local entrepreneurs and individuals. ONGC has transformed countless lives all over the country by providing the energy that obliterates darkness, celebrates light and ushers in prosperity and it rightfully deserves the dignity and honour that is accorded to it today, he said.</p><p>Asset Manager Tarun Malik while welcoming the Deputy CM was admired not only for his deft and expert handling of many important portfolios in the state but also for his scholarly knowledge on various subjects and issues of critical importance. “At a time when many of us today don’t have the patience to sit through even a few pages of reading, he is a true scholar and thinker in our midst and continues to inspire us with his meaningful words and advice”, he said. He also thanked the Dy CM for taking time out of his busy schedule in a festive period such as Durga Puja and said that would motivate ONGCians of Tripura immensely in their pursuit of energy security for this beautiful state and the country at large.</p><p>To mark the special occasion, a short yet entertaining and engaging Ram-Leela play-drama was also enacted by the young children of ONGC Tripura Asset, for the very first time.</p>"
            },
            {
                "id":"T061020223",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "description":"The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.",
                "imageName":"T061020223.JPG",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.</p><p>On July 2nd night, two youths were murdered in a drug rehabilitation centre located at Nandan Nagar area under Budhjungnagar police station and the prime accused in the double murder case was the owner of drug rehab centre, who had committed the crime  in association of other inmates of the center. Day after the incident, police recovered two bodies from a jungle at Durga Chowdhury Para under the same police with multiple injuries and with hands tied behind their bodies.</p><p>While, on the day of “Bijoya Dashami”, one more drug rehab centre located at Madhupur area under Sepahijala district has been accused for their direct involvement for a brutal murder of an inmate of the rehab centre.</p><p>Police sources said that on September 25th last one Gafur Miah of Naljala village under Bishramganj police station handed over his addicted son Ismail Miah (18) to a drug rehabilitation centre named as “Hamkrai Naikol Bodol” in Madhupur area of the same district.</p><p>But, on the ‘Dashami’ day, Gafur Miah was called off by a authority of rehab centre that his son had suffered injuries as he slipped on the floor. Immediately, Gafur Miah along with his few relatives rushed to the spot and found his son dead with multiple injuries. They immediately shifted his Madhupur Primary health centre and informed the matter to police. They alleged that persons running the rehab center lynched their son and brutally killed him.</p><p>Police also rushed to the spot and conducted autopsy of the body in presence of a magistrate and has also registered the FIR against drug rehab authorities.</p><p>Police sources added that the primary autopsy report reveals that the victim boy had several injuries in his entire body and leg was severely broken and his penis was compressed probably for thrashing him.</p><p>Police also said that based on the complaint of the victim's family, they started an investigation and will take all legal steps against the accused persons</p>"
            },
            {
                "id":"T061020224",
                "name":"CM kicked off grand ‘Mayer Goman’ festival",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"CM kicked off grand ‘Mayer Goman’ festival",
                "description":"The great and colourful immersion carnival festival “Mayer Goman” has been kicked off by the Chief Minister Dr Manik Saha in presence of a host of dignitaries from Agartala city centre on Friday evening.",
                "imageName":"T061020224.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The great and colourful immersion carnival festival “Mayer Goman” has been kicked off by the Chief Minister Dr Manik Saha in presence of a host of dignitaries from Agartala city centre on Friday evening.</p><p>The inauguration of the great carnival festival begins with spectacular cultural programmes performed by different groups of artists and after formal inauguration of the event, the immersion ceremony by different clubs and community Durga Puja organizers of the state capital started in the long HGB Road of Agartala city towards their destination to Dashamighat at the bank of river Howrah.</p><p>While, in his inaugural address in the gathering, Chief Minister Dr Manik Saha said that due to Covid pandemic, the carnival festival was not organized in the city, but after a two years gap, the Information and Cultural Affairs (ICA) department organized the great and spectacular festival.</p><p>Amidst thousands of gatherings on both sides of the main road, Dr Saha said that the government is always promoting the cultural heritage of the state's people and has also appealed to people to cooperate with the government for developing the cultural traditions of the state.</p><p>Speaking on the occasion, Deputy Chief Minister Jishnu Dev Varma said that irrespective of caste, creed and religion, the people of Tripura unitedly observed the festival of Durga Puja and sought blessings for prosperous society.</p><p>ICA Minister Sushanta Chowdhury said that to strengthen the festivities of the state's people, the great immersion carnival ‘Mayer Goman’ has been organized by the state government.</p><p>In order to commemorate the festival of immersion, the ‘Mayer Goman’ ceremony is being organized with health competition among the organizers and in coming days such a kind of cultural festival will also be organized in district and subdivision levels.</p><p>Giving details on the preparation for the great immersion carnival festival of Goddess Durga, Chowdhury said that the department has also taken measures that people from outside Agartala can witness the festival and the department will give prizes to clubs, who are participating in the “Mayer Goman” carnival. Among the participating clubs, first prize will be awarded with Rs. 50,000, second prize with Rs. 30,000 and third prize winner club will get Rs. 20,000.</p><p>Meanwhile, during the carnival ceremony,  irrespective of castes and creeds, a huge number of people thronged the entire stretch of HGB Road during immersion of the Goddess, which  is still going on till last report.</p><p>In the carnival festival, Agriculture Minister Pranajit Sigha Roy, Mayor of Agartala Municipal Corporation (AMC) Dipak Majumder, DGP Amitabh Ranjan, ADGP Sourav Tripathi, ONGC’s Tripura asset manager Tarn Malik,  Justice Arindam Lodh of High Court of Tripura, secretary of ICA department P K Chakraborty, director Ratan Biswas, eminent social worker Rajib Bhattacharjee  were also present along with other dignitaries</p>"
            },          
            {
                "id":"T041020221",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"ECI gears up for 2023 assembly polls in Tripura, dispatches new EVMs",
                "description":"The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.",
                "imageName":"T041020221.jpg",
                "publishedAt":"Agartala, October 4, 2022",
                "content":"<p>The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.</p><p>The elections to Tripura, Meghalaya, and Nagaland are expected to be held in February next year after the Assembly polls in Gujarat and Himachal Pradesh.</p><pAn official of the State Election department said that  on Monday the ECI had sent 4800 Electronic Voting Machines (EVMs), manufactured by the Hyderabad-based Electronic Corporation of India Ltd, in 15 big containers.</p><p>In presence of the representatives of the different political parties, the Election department has stored these EVMs here at the strong rooms of Umakanta Academy  with adequate security measures and these EVMs would be shifted to all the subdivisions of the state.</p><p>The official said that the National level Master Trainers (NLMT) appointed by the Election Commission last week have given training to all the eight District Magistrates and Additional District Magistrates on every important matter for the proper management of the election.</p>"
            },
            {
                "id":"T021020221",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "description":"Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.",
                "imageName":"T021020221.JPG",
                "publishedAt":"Agartala, October 2, 2022",
                "content":"<p>Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>Hundreds of auto rickshaw workers and activists under the banner of CITU on Sunday morning staged their protest in front on CNG stations demanding roll back of the decision. The workers also blocked roads.The abnormal hike of prices of CNG across the state has affect the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.<p></p>On Saturday, TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 2nd.</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p>"
            },
            {
                "id":"T011020221",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "description":"The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers",
                "imageName":"T011020221.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers.</p><p>Those who are not coming under the bracket of government also don’t have to reason to dishearten as another 30,000 people are coming under the social pension scheme. The cabinet decided all these in a meeting held on Thursday night.</p><p>The Information and Cultural Affairs (ICA) Minister on Friday afternoon  informed in a press conference, while Education Minister Ratan Lal Nath said that the government kept its commitment and urged people to enjoy the Durga Puja with a smiling face.</p><p>Chowdhury said that a total of 3, 18,415 social pensioners will get new wages of Rs.2000 per month from October 1 and they will receive the same amount in their respective bank accounts. The cabinet has also decided to give social pension to more than 30,000 beneficiaries and for that the government will spend Rs. 6 crore per month in addition.</p><p>He said that Thursday’s cabinet has also decided to appoint 6,067 Special Executive under Home Department on contract basis and they will be appointed in the service through SPs of the districts. He said that interested people from the age group of 21 to 45 years can apply for the post in their respective police stations and the recruitment process will be completed in the next one month.</p><p>The cabinet has also decided to hike the salaries of 9,931 Anganwadi workers and helpers at the rate of 15% , similarly the honorarium of ASHA workers will also get a hike of 15%, said Chowdhury. The cabinet has decided that 17 Professors will also be appointed on contract basis for Veterinary college and has also created 374 new posts under the Rural Development department, said the Minister.</p><p>Meanwhile, Education Minister Ratan Lal Nath addressing another press conference said that on September 27 and September 30, offer letters for 514 TET qualified teachers had been released by the Education department.</p><p>He said that the cabinet has decided to release offer letters for 3,108 Teacher Eligibility Test (TET) qualified candidates will be released and in addition of 514 offer letters, altogether 3,622 TET qualified candidates are getting their appointment as government teachers.</p>"
            },
            {
                "id":"T011020222",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"85 TPS Gr-I, II officers transferred",
                "description":"In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police",
                "imageName":"T011020222.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>Agartala, October 1, 2022: In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police.</p><p>The General Administration (Personnel and Training) department of the state government through notification issued on Thursday said that among the transferred officer only TPS Grade-I officer Nila Kumar Jamatia has been transferred as deputy commandant of 6th TSR battalion and rest 84 TPS Grade-II officers are mostly new promote officers, who are promoted from police inspectors to Dy.SP rank officers and were posted in different wings of state police including in TSR battalions.</p>"
            },
            {
                "id":"T011020223",
                "category":"NEH",
                "author":"Our Correspondent",
                "title":"CM inaugurates 5 smart city projects",
                "description":"In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday",
                "imageName":"T011020223.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday.</p><p>During an inauguration programme held at Old Motor Stand area of the city  on Friday under Agartala Smart City Mission and Agartala Municipal Corporation (AMC) , Dr Said said that based on the requirement and demands of people, the present state government is taking projects for the welfare of people  and these are now reflecting.</p><p>He said that welfare schemes of the government are now reaching every corner of the state.</p><p>Highlighting the launching of state level special campaign “Prati Ghore Susashan” (good governance at every household)   to ensure benefits  of various state and central schemes for the people of the state during the celebration of 72th birthday of Prime Minister Narendra Modi on September 17 last, the Chief Minister said that two-and-a-half-month long campaign on good governance will reach every household.</p><p>He also said that as per the decision taken by the state cabinet, above 6000 government jobs will be given in coming days and the government has also hiked the salaries of Anganwadi and ASHA workers at the rate of 15 %.</p><p>During the programme, AMC mayor Dipak Majumder and AMC commissioner Dr Shailesh Yadav, deputy mayor Manika Das Datta and MLA Dr Dilip Das were also present.</p>"
            },
            {
             "id":"T290920221",
             "category":"NEH",
             "author":"Our Correspondent",
             "title":"Snatcher gang busted in city, five arrested",
             "description":"Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.",
            "imageName":"T290920221.jpg",
             "publishedAt":"Agartala, September 29, 2022",
             "content":"<p>Agartala, September 29, 2022: Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.</p><p>The city police have arrested three snatchers involved with looting of cash among from a senior citizen after his withdrawal the amount from Punjab National Bank (PNB) branch located at Kaman Choumohani and escaped from the spot.</p><p>Giving details SDPO (Sadar) Ajay Kumar Das accompanied by OC of East Agartala police station Rana Chatterjee said that they have also arrested two thieves involved with many stolen incidents.</p><p>Das said that on Tuesday afternoon, when a senior citizen had withdraw an amount of Rs. 50, 000 from the Kaman Choumohani branch of PNB and when the man tried to purchase some medicines from a nearby medical store, three snatchers arrived at the spot and snatched the entire amount of Rs. 50,000.</p><p>Later, the victim old man registered a case at East Agartala police station under section 382 (B) of IPC and the police team started massive investigation to identify these snatchers and subsequently police team managed to arrest all three snatchers identified as Sukumar Das, Litan Bhuiya and Anjan Sarkar.</p><p>All these three snatchers were members of a active snatching gang working across the Agartala city and specially before the Durga Puja festival, they are very much active in the city, said Das and added that these miscreants had also committed many stolen incidents taking pre-puja rush in the city.</p><p>He claimed that police busted the snatcher gang involved in the city and the arrested trio has been produced before a local court with police remand appeals to interrogate them for arrest of other gang members.</p><p>Police has also arrested two thieves identified as Raju Chakma of Pecharthal and Bishal Dey, who are habitual drug addicts and involved with many stolen incidents held in Agartala city in recent past, specially they were involved with theft of LPG cylinders and copper wires.</p>"
         },
         {
             "id":"T290920222",
             "category":"NEH",
             "author":"Our Correspondent",
             "title":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
             "description":"As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them",
             "imageName":"T290920222.jpg",
             "publishedAt":"Agartala, September 29, 2022",
             "content":"<p>As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them.</p><p>As promised in the state assembly the Chief Minister Dr Manik Saha had invited the representatives of the retrenched teachers for a discussion in his official chamber here at Civil Secretariat on Wednesday morning over the claims of retrenched teachers in presence Advocate General Siddhartha Sankar Dey and Law Secretary Biswajit Palit.</p><p>Sources said that after getting appointment and invitation from Chief Minister Office (CMO), a delegation of six members of retrenched teachers led by Bijay Krishna Saha explained how according to the High Court judgment of 2014 (Para-127) only teachers whose jobs had been challenged on the ground of recruitment rules-not more than 58-had been terminated and the same order has also been uphold by the Supreme Court in its order dated March 29th, 2017 last.</p><p>But, recently in a reply to RTI queries the Supreme Court has clarified that no teacher except the 462 notified had been parties to the case and their claims to reinstatement is justified as they had been illegally terminated en masse without any individual notice by the previous government.</p><p>After hearing the claims made by retrenched teachers, The Chief Minister had collected all the documents substantially proving their claims and Dr Saha said that he was not fully aware of all such developments over the cases of teachers, said Bijay Krishna Saha.</p><p>Saha speaking with media persons after their meeting with the Chief Minister said that CM has compassionately heard their grievance and assured that he will meet them again after Durga Puja celebration. Chief Minister also asked the agitated teachers for all relevant documents in support of their claims and assured that government will take all possible steps to rehabilitate them as per law.</p><p>Chief Minister also said that the Law department will analyze and verify all the submitted documents and after consultation with the Advocate General and Law Secretary of the state government, he will meet them again.</p><p>Bijay Krishna Saha and other retrenched teachers also added that the Chief Minister repeatedly told them within the framework of law, the present government wanted to rehabilitate and will take all necessary steps if the law and orders of Courts permit the state government.</p><p>He also directed the concerned law officials to examine the claims of teachers and to give suggestions to the state government to protect their livelihood.</p><p>The leaders of retrenched teachers have also expressed their satisfaction after meeting with the Chief Minister and added that they are now seeing a ray of hope to protect their livelihood and their families.</p><p>It may be recalled here that leader of the Opposition Manik Sarkar and the lone Congress MLA Sudip Roy Barman condemned the police action held on September 26 during ‘assembly march’ by retrenched teachers and urged the Chief Minister to meet the agitating teachers. Accordingly, their representatives called on Dr Saha on Wednesday.</p>"
         },{
            "id":"T250920221",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Opposition stage walkout over adjournment motion",
            "description":"Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday",
            "imageName":"T250920221.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania.</p><p>Soon after the first day session began, veteran CPI(M) MLA Tapan Chakraborty asked the speaker about their adjournment motion, which had to be placed before the speaker. When, speaker Ratan Chakraborty in his reply said that there was no need for the motion in the House as opposition members will be allowed to raise the respective issues in an appropriate time during the two days session.\nAll CPI (M) members staged a protest after the denial from the speaker and all of them rushed to the well of the House demanding that their motion should be accepted by the speaker. After their walkout from the House during question hour, Opposition leader Manik Sarkar addressing a press conference at the official chamber of opposition leader in the assembly alleged that the speaker intentionally suppressed their motion on behalf of the treasury bench.</p><p>Sarkar narrating the incidents of police atrocities on student and youth activities on September 15 last during their deputation towards Chief Minister and attack on CPI(M) supporters in Hapania on September22 and subsequent attacks on the houses and shops of their supporters in the same night, said that the role of speaker is not impartial and he continuously giving more attention to treasury bench.\nCriticizing the functioning of BJP-IPFT coalition government, Sarkar said that BJP are continuing their violence politics to win the next assembly elections, but they should remember that united resistance of common people will not continue their violent politics. Sarkar also described Thursday's incident as the ‘beginning of the end’ of BJP in Tripura. Later, in the second session of the House, the opposition bench returned in the assembly proceedings and participated in the private members resolutions.</p>"
        },
        {
            "id":"T250920222",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Govt to recruit all TET qualified candidates at a time",
            "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
            "imageName":"T250920222.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
        },
        {
            "id":"T250920223",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
            "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
            "imageName":"T250920223.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
        },
        {
            "id":"T250920224",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Massive preparations for grand celebration of “Mayer Goman”",
            "description":"In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event",
            "imageName":"T250920224.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event, said ICA Minister Sushanta Chowdhury.</p><p>Speaking at the review meeting held with concern officials and club authorities of Agartala, Minister with his appeals to clubs to participate in the immersion carnival “Mayer Goman” on October 7th next said that this for the first time ICA department has been organizing such grand event and department will also give special prizes to Puja organizers.</p><p>Giving details on the preparation for the great immersion carnival festival of Goddess Durga, Chowdhury said that the department has also taken preparation that people from outside Agartala can witness the festival and the department will give prizes to clubs, who will participate in the “Mayer Goman” carnival. Among the participating clubs, first prize will be awarded with Rs. 50,000, second prize with Rs. 30,000 and third prize winner club will get Rs. 20,000.</p><p>He said that the “Mayer Goman” festival will be organized in front of Agartala city centre and a detailed road map will also be finalized to make the celebration a grand event.</p><p>Speaking in the review meeting, Mayor Dipak Majumder of Agartala Municipal Corporation (AMC) said that AMC has taken a massive cleaning drive before the ensuing festivities of Durga Puja and has taken different pro-people measures for smooth celebration of the festivities.</p><p>He said that AMC has also prepared a detailed plan for smooth celebration of festivities and hoped that this time people of the state as well as devotees from different areas will witness a hassle puja celebration across Agartala.</p><p>He said that several teams will be formed under the leadership of AMC councilors and government authorities to finalize all pre-puja preparation works across the city and special measures would be taken for immersion processions and immersion of Goddess at ‘Dashamighat’ and other seven immersion spots of the city and AMC would repair and will made necessary constructions if needed, said Mayor. Mayor also said that AMC will give awards to community puja organizers based on their celebration of puja by maintaining the environment and its protection.</p><p>Director of ICA department Ratan Biswas said that the department will award the community puja organizers of Agartala and its adjoining areas based on six themes.</p><p>During the review meeting, secretary of ICA Dr P K Chakraborty, TTDC’s chairman Santosh Saha, editor of North East Colors Sanjib Deb, president of Agartala club forum Pranab Sarkar, SP (Security) Bijoy Debbarma and other dignitaries were also present. (OVER)</p>"
        },
        {
            "id":"T250920225",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Kingpins of dacoity incident arrested",
            "description":"After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last",
            "imageName":"T250920225.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last, the investigation  team through scientific investigation and using technical aid, arrested prime accused person of the incident identified as Safar Ali (41), son of Bahar Miah of Loknath Para, Aralia under East Agartala police station.</p><p>Based on the interrogation statements of arrest dacoit Safar Ali,  police have also managed to arrest another kingpin of the dreaded dacoity incident of Baldakhal robbery case namely Ashim Das from Bagbari under Lefunga police station last night. He was forwarded before a local court and police got 5 days remand. He was also arrested earlier in two more property offence cases under East Agartala and R K Pur police stations.</p><p>Police added that a massive scientific investigation is going on to arrest other culprits involved in two dacoity incidents held at Champamura area of East Aralia and Baldakhal area on August 21 and 23rd night respectively. They added that the investigations are continuous raids in different locations to arrest associates of the two arrested dacoits involved in many stolen cases.</p><p>It may be recalled here that though city police claimed that during last fortnight the incidents stolen has been reduced across the city, but on Saturday evening two major robbery incidents were held at East Aralia and Chandrapur areas under East Agartala police station. Despite police assurance of increases in night patrolling and police surveillance, just a few days before the festivities of Durga Puja, still major parts of Agartala city remain unguarded in night time. (OVER)</p>"
        },
        {
            "id":"T250920226",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Three missing minor girls rescued",
            "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
            "imageName":"T250920226.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
        },
        {
            "id":"T250920227",
            "category":"NEH",
            "author":"Our Correspondent",
            "title":"Pharmacists plays important role in health services, CM",
            "description":"The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha",
            "imageName":"T250920227.jpg",
            "publishedAt":"Agartala, September 25, 2022",
            "content":"<p>The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha.</p><p>Chief Minister Dr Manik Saha delivering his speech during the celebration of the 12th World Pharmacist Day at the Regional Institute of Pharmaceutical Science and Technology (RIPSAT) campus in Abhoynagar area of Agartala on Sunday said that the World Pharmacist Day 2022 theme is 'Pharmacy united in action for a healthier world.' The theme aims to emphasize the united effort of global pharmacists to improve the healthcare sector.</p><p>He said that it is a moment for pride for the people of the state that hundreds of students from other states of the country are now pursuing the education in the RIPSAT, but earlier the students of Tripura had to study in other states for their pharmacy education.</p><p>He assured the RIPSAT authorities all the vacant posts for the faculty members of the institute will be filled up.</p><p>During the celebration of day, Chief Minister has also inaugurated a voluntary blood donation camp and during the programme, the secretary of Health and Family Welfare Dr Debasish Basu, director of medical education Dr Chinmoy Biswas and director of Health department Dr Subhasish Debbarma along with authorities of Pharmacy college were also present. (OVER)</p>"
        }
        ], 
        "national":[
		{
                "id":"N191020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Congress presidential poll results today",
				"description":"Congress, the country's oldest and primary opposition party, will get its first non-Gandhi president after 24 years as the counting of the presidential polls will be held Wednesday.",
                "imageName":"N191020221.jpg",
                "publishedAt":"New Delhi, October 19, 2022",
                "content":"<p>Congress, the country's oldest and primary opposition party, will get its first non-Gandhi president after 24 years as the counting of the presidential polls will be held Wednesday.</p><p>Congress top leader Mallikarjun Kharge, who is known for his closeness to the Gandhi family, and Thiruvananthapuram MP Shashi Tharoor have contested the polls.</p><p>While Kharge is said to be the choice of the Gandhi family, both interim president Sonia Gandhi and top leader Rahul Gandhi have said that they are not backing any candidate.</p><p>Sonia, who will be succeeded by either Kharge or Tharoor, assumed the post after Rahul stepped down in 2019 post Lok Sabha poll debacle.</p><p>The Congress will get its new president weeks or months ahead of crucial assembly elections in Gujarat and Himachal Pradesh.</p>"

             },
			 {
                "id":"N191020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Narendra Modi to visit Kedarnath , Badrinath on Oct 21",
				"description":"In Kedarnath, at around 8:30 AM, he will perform darshan and pooja at Shri Kedarnath Temple.",
                "imageName":"N191020222.jpg",
                "publishedAt":"New Delhi, October 19, 2022",
                "content":"<p>In Kedarnath, at around 8:30 AM, he will perform darshan and pooja at Shri Kedarnath Temple.</p><p>At around 9 AM, the Prime Minister will lay the foundation stone of the Kedarnath Ropeway Project. After that, he will visit the Adi Guru Shankaracharya Samadhi Sthal.</p><p>At around 9:25 AM, the Prime Minister will review the progress of development works along Mandakini Asthapath and Saraswati Asthapath.</p><p>Thereafter, the Prime Minister will reach Badrinath where, at around 11:30 AM, the Prime Minister will perform darshan and pooja at Shri Badrinath Temple.</p><p>At 12 noon, he will review the progress of development work of riverfront, followed by laying the foundation stone of road and ropeway projects at Mana village at 12:30 PM.</p><p>Thereafter, at around 2 PM, he will review the progress of development work of arrival plaza and lakes.</p><p>The ropeway in Kedarnath will be around 9.7 Km long and will connect Gaurikund to Kedarnath, reducing the travel time between the two places from 6-7 hours at present, to only about 30 mins.</p><p>The Hemkund ropeway will connect  Govindghat to Hemkund Sahib. It will be around 12.4 Km long and will reduce the travel time from more than a day to only about 45 mins.</p><p>This ropeway will also connect Ghangaria, which is the gateway to Valley of Flowers National Park.</p><p>The ropeways, which will be developed at a cumulative cost of around Rs 2430 crore, are an environmental friendly mode of transport that will provide safe, secure and stable mode of transport. This major infrastructure development will give a boost to religious tourism, which will give a fillip to the economic development in the region and lead to creation of multiple employment opportunities as well.</p><p>Foundation stone of road widening projects worth around Rs 1000 crore will also be laid during the visit.</p><p>The two road widening projects - from Mana to Mana Pass (NH07) and from Joshimath to Malari (NH107B) - shall be another step towards providing last mile all weather road connectivity to our border areas. Apart from boosting connectivity, these projects will also prove beneficial from a strategic point of view as well.</p><p>Kedarnath and Badrinath are one of the most important Hindu shrines. The area is also known for one of the revered Sikh Pilgrim site - Hemkund Sahib. The connectivity projects being undertaken shows the Prime Minister’s commitment to ease access and improve basic infrastructure in places of religious significance.</p>"
             },
			 {
                "id":"N191020223",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Jammu and Kashmir: CS launches online Human Resource Management System for govt employees",
				"description":"Jammu and Kashmir Chief Secretary Arun Kumar Mehta has launched Jammu and Kashmir Human Resource Management System (JK-HRMS), a move which might help government employees in the region.",
                "imageName":"N191020223.webp",
                "publishedAt":"Jammu and Kashmir:, October 19, 2022",
                "content":"<p>Jammu and Kashmir Chief Secretary Arun Kumar Mehta has launched Jammu and Kashmir Human Resource Management System <b>(JK-HRMS)</b>, a move which might help government employees in the region.</p><p>On the occasion, the Chief Secretary maintained that the system would be beneficial in giving equal treatment to all the employees in terms of their career progression, timely filing of monthly performance reports, Property Returns and Annual Performance Reports, reports Daily Excelsior.</p><p>Mehta directed for monitoring of all these performance standards and take appropriate action against the willful defaulters.</p><p>He observed that the long staying employees and employees deserving promotions should also be regulated through this management system.</p><p>He complimented GAD and NIC for coming up with holistic HR management system in a very short span of time.</p><p>Speaking on the occasion, Chief Secretary said that in sync with the vision of <b>‘APKA MOBILE HAMARA DAFTAR’</b>, the Government of J&K is committed to providing citizen centric services through the mobile mode.</p><p>&quotThis will enhance the accessibility of services and add to the convenience of citizens availing services,&quot he added.</p>"
				},
            {
                "id":"N171020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Will cooperate fully: Manish Sisodia after CBI summons him tomorrow over excise police case",
				"description":"The Central Bureau of Investigation (CBI) has summoned Delhi Deputy Chief Minister and Aam Aadmi Party leader Manish Sisodia on Monday in connection with the controversial Delhi excise policy case.",
                "imageName":"N171020221.jpg",
                "publishedAt":"New Delhi, October 17, 2022",
                "content":" <p>The Central Bureau of Investigation (CBI) has summoned Delhi Deputy Chief Minister and Aam Aadmi Party leader Manish Sisodia on Monday in connection with the controversial Delhi excise policy case.</p><p>In his response to the latest summons, Sisodia said the CBI found nothing during their raids earlier but asserted that he will offer full cooperation to the investigative agency.</p><p>&quotCBI raided my house for 14 hours, nothing came out of it. They searched my bank locker, and found nothing. They did not find anything in my village.,&quot tweeted Sisodia.</p><p>&quotNow they have called me to CBI Headquarters at 11 am tomorrow. I will go and give my full cooperation. Satyameva Jayate,&quot he wrote in Hindi.</p><p><blockquote class=&quottwitter-tweet&quot><p lang=&quothi&quot dir=&quotltr&quot>मेरे घर पर 14 घंटे CBI रेड कराई, कुछ नहीं निकला. मेरा बैंक लॉकर तलाशा, उसमें कुछ नहीं निकला. मेरे गाँव में इन्हें कुछ नहीं मिला. <br><br>अब ने कल 11 बजे मुझे CBI मुख्यालय बुलाया है मैं जाऊँगा और पूरा सहयोग करूँगा.<br><br>सत्यमेव जयते.</p><p>&mdash; Manish Sisodia (@msisodia)</p>p><p><b>The AAP has maintained that there is no scam and Sisodia has been dragged into the case for political vendetta.</b></p><p>Earlier, Sisodia was raided by the CBI over the allegations of corruption in the Delhi liquor policy.</p>"


             },
			 {
                "id":"N171020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Entire country experiencing power of Jan Dhan bank accounts: PM Modi launches 75 Digital Banking Units across India",
				"description":"Prime Minister Narendra Modi dedicated 75 Digital Banking Units (DBU) across 75 districts to the nation via video conferencing.Addressing the gathering, the Prime Minister started by stressing that the 75 Digital Banking Units (DBU) will further financial inclusion and enhance the banking experience for citizens.“DBU is a big step in the direction of Ease of Living for the common citizens, he said",
                "imageName":"N171020222.jpg",
                "publishedAt":"New Delhi, October 17, 2022",
                 "content":"<p>Prime Minister Narendra Modi dedicated 75 Digital Banking Units (DBU) across 75 districts to the nation via video conferencing.</p><p>Addressing the gathering, the Prime Minister started by stressing that the 75 Digital Banking Units (DBU) will further financial inclusion and enhance the banking experience for citizens.</P><p>“DBU is a big step in the direction of Ease of Living for the common citizens,&quot he said.</p> <p>The Prime Minister informed that in such a banking setup, the government aims to provide maximum services with minimum infrastructure, and all of this will happen digitally without involving any paperwork. It will also simplify the banking procedure while also providing a robust and secure banking system.</p><p><b>&quotPeople living in small towns and villages will find benefits like transferring money to availing loans. Digital Banking Units are another big step in that direction which is going on in the country to make the life of common man of India easier,&quot he added.</b></p><p>PM Modi said that the aim of the government is to empower the common citizen and make them powerful, and as a result, policies were made keeping in mind the last person and the entire government moving in the direction of their welfare.</p><p>He pointed out the two areas in which the government worked simultaneously. First, reforming, strengthening, and making the banking system transparent, and secondly financial inclusion.</p><p><b>Recalling the traditional ways of the past where people had to go to the bank, the Prime Minister said that this government transformed the approach by bringing the bank to the people.</p></b><p>“We have given top priority to ensure that banking services reach the last mile.  This a huge change from the days when it was expected that poor will go to the bank to a scenario when the banks were going on the doorstep of the poor. This involved reduction of distance between the poor and the banks. “We not only removed the physical distance but, most importantly, we removed the psychological distance.&quot </p><p>The highest priority was given to covering far-flung areas with banking.</p> <p>The Prime Minister informed that today more than 99 per cent of villages in India have a bank branch, banking outlet or a &quot banking mitra &quot within a 5 km radius.</p> <p>&quotExtensive Post Office network too was harnessed via India Post Banks for providing the banking needs to the common citizens&quot, he said.</p> <p>&quotToday the number of branches per one lakh adult citizens in India is more than countries like Germany, China and South Africa,&quot he added.</p><p><blockquote class=&quottwitter-tweet&quot><p lang=&quoten&quot dir=&quotltr&quot>Today, 75 Digital Banking Units are being launched across India. This is a step in the direction of significantly improving the banking experience for each and every citizen of the country.<br><br>- Prime Minister <a href=&quothttps://twitter.com/narendramodi?ref_src=twsrc%5Etfw&quot>@narendramodi</a> <a href=&quothttps://t.co/yhObpzjIOE&quot>pic.twitter.com/yhObpzjIOE</a></p>&mdash; PIB India (@PIB_India) <a href=&quothttps://twitter.com/PIB_India/status/1581531009937383424?ref_src=twsrc%5Etfw&quot>October 16, 2022</a></blockquote> <script async src=&quothttps://pl</p>atform.twitter.com/widgets.js&quot charset=&quotutf-8&quot></script></p><p>Despite initial misgivings in certain sections, the Prime Minister said, &quotToday the entire country is experiencing the power of Jan Dhan Bank accounts.&quot</P><p>He informed that these accounts enabled the government to provide insurance to the vulnerable at a very low premium.</p><p>&quotThis opened the way for loans for the poor without collateral and provided Direct Benefit Transfer to the accounts of the target beneficiaries. These accounts were the key modality for providing homes, toilets, gas subsidy, and benefits of schemes for farmers could be ensured seamlessly,&quot he said.</p><p>The Prime Minister acknowledged the global recognition for India’s digital banking infrastructure.</p><p>&quotThe IMF has praised India's digital banking infrastructure. The credit for this goes to the poor, farmers and labourers of India, who have adopted new technologies, made it a part of their lives,&quot he emphasised.</p><p>&quotUPI has opened up new possibilities for India,&quot the Prime Minister continued, &quotWhen financial partnerships are combined with digital partnerships, a whole new world of possibilities opens up. A huge example of UPI is before us. India is proud of this as it is the first technology of its kind in the world.&quot,</p><p>He informed that today 70 crore indigenous Rupay cards are in operation, a vast change from the days of foreign players and the elite nature of such products.</p><p>&quotThis combination of technology and economy is enhancing the dignity and affordability for the poor and empowering the middle class, while at the same time it is also eliminating the digital divide of the country,&quot he said.</p><p>PM Modi also praised the role of DBT in eliminating corruption and said that more than 25 lakh crore rupees have been transferred in various schemes via DBT. He informed me that he will transfer the next instalment to the farmers tomorrow.</p><p>&quotToday the whole world is appreciating this DBT and the digital power of India. Today it is being seen as a global model. The World Bank has even gone so far as to say that India has become a leader in ensuring social security through digitization,&quot said the Prime Minister.</p><p>The Prime Minister informed that fintech is at the heart of India's policies and efforts, and it is playing a key role in shaping the future. Digital banking units will further expand this capability of fintech.</p><p>&quotIf Jan Dhan accounts had laid the foundation of financial inclusion in the country, then Fintech would form the basis of a financial revolution,&quot he said.</p><p>Referring to the government’s announcement of the launch of a digital currency based on blockchain technology, the Prime Minister pointed out that: &quotBe it digital currency in the coming times, or digital transactions in today's time, apart from the economy, many important aspects are associated with them.&quot </p><p>He listed the savings, elimination of the hassle of physical currency and environmental benefits as key advantages.</p><p>The Prime Minister pointed out that paper and ink for currency printing are imported, and by adopting a digital economy we are contributing to a self-reliant India while also benefiting the environment by reducing the consumption of paper.</p>"

             },
            {
                "id":"N151020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Kashmiri Pandit shot dead in Shopian, Kashmir Freedom Fighter group claims responsibility",
                "description":" In yet another episode of targeted attack, a non-migrant Kashmiri Pandit was shot dead in Shopian district of Jammu and Kashmir on Saturday, police said.",
                "imageName":"N151020221.jpg",
                "publishedAt":"Srinagar, October 15, 2022",
                "content":"<p>In yet another episode of targeted attack, a non-migrant Kashmiri Pandit was shot dead in Shopian district of Jammu and Kashmir on Saturday, police said.</p><p>They said militants fired at Puran Krishan Bhat of Chouwdary Gund Shopian near his residence.</p><p>&quot;He was shot while he was in orchard which is more than half a km from his house,&quot; a security official said.</p><p>He was immediately shifted to hospital where he succumbed to his injuries.</p><p>Soon after the incident, security forces cordoned the area and launched a manhunt to trace the attackers.</p><p>&quot;Terrorists fired upon a civilian (minority) Puran Krishan Bhat while he was on his way to an orchard in Chowdari Gund, Shopian. He was immediately shifted to a hospital for treatment where he succumbed. Area cordoned off. Search in progress,&quot; a Police tweet said.</p><p>Sujit Kumar, Deputy Inspector General of Police Central Kashmir, who is also the in charge of South Kashmir Range said the Kashmir Freedom Fighter (KFF) group, the proxy name of a militant outfit, has claimed responsibility for the attack.</p><p>He said initial investigation has suggested that one militant was behind the attack.</p><p>&quot;There was security, our guard, for this cluster. If any security lapse is found on part of the security guards and any official in charge of the area, definitely action will be taken,&quot; he said.</p><p>Deputy commissioner Shopian, Sachin Kumar said the body of the deceased will be sent to Jammu for last rites.</p><p>The latest killing has been widely condemned.</p><p>Jammu and Kashmir Lieutenant Governor Manoj Sinha said the perpetrators and those aiding and abetting terrorists will be severely punished.</p><p>&quot;Attack on Puran Krishan Bhat by terrorists in Shopian is a dastardly act of cowardice. My heartfelt condolences to the bereaved family. I assure the people that the perpetrators and those aiding and abetting terrorists will be severely punished,&quot; Sinha tweeted.</p><p>The National Conference condemned the &quot;brazen and cowardly attack.&quot;</p><p>&quot;I unequivocally condemn this attack in which Pooran Krishan Bhat has lost his life. I send my heartfelt condolences to his family. May Pooran Ji's soul rests in peace,&quot; NC vice president Omar Abdullah said.</p><p>The PDP alleged that the LG has turned a blind eye to the plight of Kashmiri Pandits.</p><p>&quot;While KP's have been protesting for last five months demanding relocation after Rahul Bhat's killing,LG admin kept turning a blind eye to their plight. Today yet another KP, Puran Krishan was shot dead in Shopian. Thoughts,prayers are with the bereaved family,&quot; the party said in a tweet.</p><p>BJP General Secretary Ashok Koul said: &quot;These anti-national elements by killing civilians will never be successful.&quot;</p><p>&quot;These things will not be tolerated anymore as these attacks are aimed to disturb the peace in the region,&quot; he said.</p><p>CPI(M), Apni Party and Peoples Conference too condemned the killing.</P>"
            },
            {
                "id":"N151020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"3rd IVI International Optometry Conference opens in Chennai with call for action on Uncorrected Refractive Error, myopia",
                "description":"The 3rd IVI International Optometry - Eye Health in a Changing World Conference opened in Chennai on Friday with the call to address eye health problems, including Uncorrected Refractive Error and myopia",
                "imageName":"N151020222.jpg",
                "publishedAt":"Chennai, October 15, 2022",
                "content":"<p><p>The 3rd IVI International Optometry - Eye Health in a Changing World Conference opened in Chennai on Friday with the call to address eye health problems, including Uncorrected Refractive Error and myopia.</p><p>The two-day conference – 14-15 October – was opened in the presence of Lise Talbot Barre, French Consul General for Pondicherry and Chennai,  Sarah Kirlew, Australia’s Consul General in Chennai, Narasimhan Narayanan, Country Head, EssilorLuxottica Group, South Asia, and Raghavan NS, Country Manager, Essilor South Asia.</p><p>The conference, also available online to audiences worldwide, has brought global and national experts to focus on eye health and vision impairment.</p><p>A focus at the conference is on the management of myopia, among other themes such as big data and artificial intelligence, legislative frameworks, as well as human resources challenges.</p><p> Research has predicted that the rise in myopia worldwide, including in India and other countries, will continue in the coming decades.</p><p>Speakers said since 2020, there has been an increase in the incidence of myopia. If not controlled effectively, it may even go up by 50 percent by 2050.</p><p>IVI’s CEO Vinod Daniel said “The conference follows two earlier Eye Health in a Changing World Conferences, since 2020. The international conference, being held this year in the hybrid mode, has become a major event in the annual eye health calendar across the world.”</p><p>“Some 1,200 delegates are expected to join offline and online at the conference that will include 45 speakers from India and overseas. It will have 57 paper and 75 poster presentations,” he noted.</p><p>Special Tag: International Optometry</p><p>Keywords: IVI, International Optometry</p><p>Photo caption: Australia's Consul-General Sarah Kirlew, French Consul-General Lise Talbot Barre, and IVI's CEO Vinod  Daniel, among others at the opening of the 3rd IVI International Optometry Conference - Eye Health in a Changing World in Chennai today.</p>"
            },
            {
                "id":"N151020223",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Police seize 218 kg of Ganja in Assam's Sonitpur",
                "description":"Police on Saturday seized 218 kg of Ganja from a four wheeler vehicle in Assam's Sontipur area.",
                "imageName":"N151020223.jpg",
                "publishedAt":"Guwahati, October 15, 2022",
                "content":"<p>Police on Saturday seized 218 kg of Ganja from a four wheeler vehicle in Assam's Sontipur area.</p><p>Police said based on secret information, police set up a Naka checking at National Highway 15 near Khanamukh under Chariduar police station.</p><p>A senior police official of Sonitpur district told IBNS: &quot;Today morning, at around 7-30 am, a white colour I20 vehicle bearing registration number AS-01BJ-0061, was intercepted coming from Tezpur side towards Lakhimpur side and the driver after seeing the police party drove away the vehicle towards Tezpur via Rangajan.&quot;</p><p>In order to stopped the vehicle, the police party chased the vehicle from behind.</p><p>Even after chased the same for about 15 km the vehicle did not stop, police said.</p><p>&quot;Having no other way to stopped the vehicle police party control fired 2 rounds ammunition aiming to the wheel and subsequently front tyre was punctured and the vehicle was stopped at Boithabhanga area,&quot; the police official said.</p><p>However the driver of the vehicle fled away from the spot taking advantage of dense jungle.</p><p>During search the vehicle Police found 42 numbers of plastic packets having suspected Ganja weighing 218.136 kg and one Walkie Talkie set and seized the same on the spot as per NDPS procedure.</p><p>He also said that, the market value of the seized Ganja is estimated at around Rs 1.50 crore.</p><p>A case has been registered in this regard.</p>"
            },
            {
                "id":"N141020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Seat belts mandatory for all 4-wheeler passengers from Nov 1 in Mumbai",
                "description":"Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.",
                "imageName":"N141020221.jpg",
                "publishedAt":"Mumbai, October 14, 2022",
                "content":"<p>Mumbai Police on Friday issued a notice making seat belts mandatory for all passengers, both in front and rear seats, travelling in four-wheelers from November 1.</p><p><b>“All motor vehicle drivers and all commuters in vehicles, whoever travels on the roads of Mumbai City are hereby informed that it will be mandatory for drivers and all passengers to wear seat belts while travelling from November 1,” the Mumbai Police said in a statement.</b></p><p>Violators of the new rule will be liable for punishment under the relevant sections of the Motor Vehicles (Amendment) Act, 2019.</p><p><b>In the notice, the Mumbai Police directed that four-wheelers that do not have seat belts for all passengers should get them installed by November 1.</b></p><p>Last month, Union Minister of Road Transport and Highways Nitin Gadkari announced that seatbelts will be mandatory for all passengers sitting in a vehicle.</p><p>'It will now be mandatory for all the people sitting in the car to wear a seat belt,' the Union Minister said.</p><p>Gadkari's announcement came after the fatal accident of former Tata Group chairman Cyrus Mistry, which had sparked criticism over the flaws in the transport and traffic control system, including laws governing seat belts for car passengers</p>"
            }
        ],
        "politics":[
            {
                "id":"P171020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Mallikarjun Kharge sir is my leader too, we are not enemies': Shashi Tharoor ahead of Congress election",
                "description":"Congress leader Shashi Tharoor, who is running for the party's presidential post, has clarified his recent comments that some people in the party were assuming that there's an official candidate.",
				"imageName":"P171020221.jpg",
                "publishedAt":"Guwahati, October 17, 2022",
                "content":"<p>Congress leader Shashi Tharoor, who is running for the party's presidential post, has clarified his recent comments that some people in the party were assuming that there's an official candidate.</p><p>The comment was seen as alluding to Mallikarjun Kharge, the other candidate in the Congress presidential election.</p><p><b>&quot Kharge sir is my leader too. We are not enemies. I am the candidate of change in Congress,&quot Tharoor said in Assam's Guwahati, where he came to the campaign.</b></p><p>He said one of his first tasks if he is elected Congress chief, is to stop party leaders from quitting to join the Bharatiya Janata Party (BJP).</p><p>&quotPeople who supported me are not rebels or against the Gandhis...This is a wrong notion. The Gandhis are always with the Congress, and so are we. We are contesting the election with the spirit that whoever wins this election, it will be a victory of the Congress,&quot Tharoor said.</p><p>&quotUnder a new [party] President, the Congress will again work for the people of India as for decades it has done under every [party] President. One of the main tasks of the new President is to reach out to other parties for 2024 [national election]. Our first test will be on creating a new national alliance,&quot Tharoor said.</p>"
            },
            {
                "id":"P151020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"PM Narendra Modi to inaugurate PM Kisan Samman Sammelan on Oct 17",
                "description":"PM Narendra Modi will inaugurate the two-day event “PM Kisan Samman Sammelan 2022” on Oct 17 at around 11:30 AM at Indian Agricultural Research Institute, New Delhi.",
                "imageName":"P151020221.jpg",
                "publishedAt":"New delhi, October 15, 2022",
                "content":"<p>PM Narendra Modi will inaugurate the two-day event “PM Kisan Samman Sammelan 2022” on Oct 17 at around 11:30 AM at Indian Agricultural Research Institute, New Delhi.</p><p>The event brings together more than 13,500 farmers from across the country and around 1500 Agri Startups.</p><p>More than 1 crore farmers, from various  institutions are expected to attend the event virtually.</p><p>The Sammelan will also witness participation of researchers, policy makers and other stakeholders.</p><p>The Prime Minister will inaugurate 600 Pradan Mantri Kisan Samruddhi Kendras (PMKSK) under the Ministry of Chemicals & Fertilizers. Under the scheme, the fertilizer retail shops in the country will be converted into PMKSK in a phased manner. PMKSK will cater to a wide variety of needs of the farmers and provide agri-inputs (fertilizers, seeds, implements); testing facilities for soil, seeds, fertilizers; generate awareness among farmers; provide information regarding various government schemes and ensure regular capacity building of retailers at block/ district level outlets. More than 3.3 lakh retail fertilizer shops are planned to be converted into PMKSK.</p><p>During the event, the Prime Minister will launch Bhartiya Jan Urvarak Pariyojana - One Nation One Fertilizer. Under the scheme, the Prime Minister will launch Bharat Urea Bags, which will help companies market fertilizers under the single brand name &quot;Bharat&quot;.</p><p>In a reflection of the continued commitment of the Prime Minister towards welfare of the farmers, during the event, the Prime Minister will release the 12th installment amount of Rs. 16,000 crores under the Pradhan Mantri Kisan Samman Nidhi (PM-KISAN) through Direct Benefit Transfer.</p><p>Under the scheme, eligible farmer families are provided a benefit of Rs. 6000 per year in three equal instalments of Rs. 2000 each. So far, eligible farmer families have received benefits of more than Rs. 2 lakh crore under PM-KISAN.</p><p>The Prime Minister will also inaugurate the Agri Startup Conclave and Exhibition. About 300 startups will showcase their innovation related to Precision Farming, Post-Harvest & Value Add Solutions, Allied Agriculture, Waste to Wealth, Mechanisation for Small Farmers, Supply Chain Management, Argi-Logistic, among others.</p><p>The platform would facilitate startups to interact with farmers, FPOs, agri-experts, corporates etc. Startups will also share their experience and interact with other stakeholders in technical sessions.</p><p>During the event, the Prime Minister will also launch ‘Indian Edge’, an e-magazine on fertilizer. It will provide information on domestic and international fertilizer scenarios, including recent developments, price trends analysis, availability and consumption, success stories of farmers, among others.</p>"
            },
            {
                "id":"P151020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"India now ranks 107 in Global Hunger Index, Chidambaram slams Centre",
                "description":" India has slipped to the 107th position in the Global Hunger Index 2022, even behind immediate neighbours like Pakistan, Bangladesh, Sri Lanka and Nepal, as per the website of Global Hunger Index which released the ranking on Saturday.",
                "imageName":"P151020222.jpg",
                "publishedAt":"New delhi, October 15, 2022",
                "content":"<p>India has slipped to the 107th position in the Global Hunger Index 2022, even behind immediate neighbours like Pakistan, Bangladesh, Sri Lanka and Nepal, as per the website of Global Hunger Index which released the ranking on Saturday.</p><p>India stood in the 101st position last year.</p><p>The list includes 121 countries.</p><p>Seventeen countries, including China, Turkey, and Kuwait, shared the top position in the ranking list.</p><p>Former Indian Finance Minister P Chidambaram slammed the Centre over the report and tweeted: &quot; When will the Hon'ble PM address real issues like malnutrition, hunger, and stunting and wasting among children? 22.4 crore people in India are considered undernourished. India's rank in the Global Hunger Index is near the bottom -- 107 out of 121 countries.&quot;</p><p>He said: &quot; Our score has worsened since 2014 in the 8 years of the Modi government. 16.3 per cent of all Indians are undernourished, meaning they do not get enough food.&quot;</p><p>Chidambaram said: &quot; 19.3 per cent of children are wasted, 35.5 per cent of children are stunted. Hindutva, imposing HIndi and spreading Hate are not the antidote to Hunger.&quot;</p>"
            },
            {
                "id":"P141020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Election Commission likely to announce assembly poll dates for Gujarat, Himachal Pradesh today",
                "description":"The Election Commission of India (ECI) is likely to announce the dates for upcoming assembly elections in Gujarat and Himachal Pradesh Friday.",
                "imageName":"P141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>The Election Commission of India (ECI) is likely to announce the dates for upcoming assembly elections in Gujarat and Himachal Pradesh Friday. </p><p>The EC is likely to announce the dates at a press conference scheduled for 3 pm.</p><p>Gujarat, the backyard of Prime Minister Narendra Modi, is witnessing Delhi Chief Minister Arvind Kejriwal's Aam Aadmi Party (AAP) spirited campaign to keep its footprint in the western state, where the BJP is aiming for a straight seventh term. </p><p>The Congress, which had offered Modi's BJP a close contest back in 2017 polls, is facing the challenge to keep its relevance after being wiped out of the majority of Indian states including its stronghold Punjab earlier this year.</p><p>The elections in Gujarat are closely followed to track whether the AAP, which swept Punjab in 2022, emerges as a new alternative to the BJP in the state with national repercussions.</p><p>In Himachal, the BJP had won 43 out of 68 seats, comfortably ahead of Congress' 22, in the 2017 state polls.</p>"
            }
        ],
        "sports":[
             {
                "id":"S191020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Pakistan may not send team for World Cup if India pulls out from Asia Cup: Reports",
                "description":"Prime Minister Narendra Modi has congratulated the Indian women's team on their Asia Cup triumph.",
                "imageName":"S191020221.jpg",
                "publishedAt":"Islamabad, October 19, 2022",
                "content":"<p>Pakistan Cricket Board (PCB) is deliberating not to participate in the 2023 World Cup set to take place in India next year, amid reports that the Board of Control for Cricket in India's (BCCI) might not send its team to the neighbouring nation to compete in Asia Cup.</p><p>PCB started contemplating several options and not participating in the mega cricket tournament next year is also under consideration, reports Geo News.</p><p>Sources told Geo News that a meeting of the board's think tank is undergoing in Lahore in which matters including Asia Cup participation and India's denial are being discussed.</p><p>The PCB, as per sources, would be declaring the ACC President and BCCI Secretary Jay Shah's decision on the tour unnecessary and hasty, further noting that Shah cannot take a unilateral decision by himself.</p><p>India is slated to host the World Cup next year.</p><p>India and Pakistan have only played against each other in global tournaments like Asia Cup and World Cup for the past several years.</p><p>The Board of Control for Cricket in India (BCCI) said that India will not travel to Pakistan for next year's Asia Cup.</p><p>The decision was taken at the BCCI Annual General Meeting (AGM) held here on Tuesday.</p><p>India will demand to move next year's continental tournament to a neutral venue.</p><p>&quotNeutral venue for Asia Cup is not unprecedented and we have decided that we will not travel to Pakistan,&quot Cricbuzz quoted Jay Shah, the secretary of the BCCI and president of the Asian Cricket Council (ACC).</p><p>The 2023 Asia Cup in Pakistan will mark the return of a major cricketing tournament to the Asian nation after over two decades.</p>"
            },
			{
                "id":"S151020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"PM Modi congratulates Indian women's cricket on Asia Cup Win; lauds 'outstanding' teamwork",
                "description":"Pakistan Cricket Board (PCB) is deliberating not to participate in the 2023 World Cup set to take place in India next year, amid reports that the Board of Control for Cricket in India's (BCCI) might not send its team to the neighbouring nation to compete in Asia Cup.",
                "imageName":"S151020221.jpg",
                "publishedAt":"IBNS, October 15, 2022",
                "content":"<p>PM Modi congratulates Indian women's cricket on Asia Cup Win; lauds 'outstanding' teamwork</p><p>Prime Minister Narendra Modi has congratulated the Indian women's team on their Asia Cup triumph.</p><p>Indian women's cricket team demolished Sri Lanka by eight wickets to romp to victory on Saturday to clinch their seventh Asia Cup title.</p><p>Modi took to social media to applaud the Indian team for their achievement, saying the team showed outstanding skill and teamwork.</p><p>&quot;Our women cricket team makes us proud with their grit and dexterity! Congratulations to the team for winning the Women's Asia Cup. They have shown outstanding skill and teamwork. Best wishes to the players for their upcoming endeavours,&quot; Modi posted on Twitter.</p><blockquote class='twitter-tweet'><p lang='en' dir='ltr'>Our women cricket team makes us proud with their grit and dexterity! Congratulations to the team for winning the Women’s Asia Cup. They have shown outstanding skill and teamwork. Best wishes to the players for their upcoming endeavours. <a href='https://t.co/6hq5V08Cy9'>https://t.co/6hq5V08Cy9</a></p>&mdash; Narendra Modi (@narendramodi) <a href='https://twitter.com/narendramodi/status/1581239738622566400?ref_src=twsrc%5Etfw'>October 15, 2022</a></blockquote> <script async src='https://platform.twitter.com/widgets.js' charset='utf-8'></script>"
				},
            {
                "id":"S151020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"After unceremonious BCCI exit, Sourav Ganguly set to contest CAB presidential polls",
                "description":"Days after he was denied a second term in the Indian cricket board (BCCI), former skipper Sourav Ganguly has announced his decision to contest the upcoming presidential elections in Bengal cricket's governing body CAB, media reports said",
                "imageName":"S151020222.JPG",
                "publishedAt":"Kolkata/IBNS: October 15, 2022",
                "content":"<p>Days after he was denied a second term in the Indian cricket board (BCCI), former skipper Sourav Ganguly has announced his decision to contest the upcoming presidential elections in Bengal cricket's governing body CAB, media reports said.</p><p><b>Ganguly Saturday confirmed that he will be contesting the upcoming presidential elections in the Cricket Association of Bengal (CAB), which was run by him for four years from 2015.</b></p><p>Ganguly Thursday broke his silence on the controversy over his unceremonious BCCI exit and said, &quot;You can’t play forever. You can’t be an administrator forever, but it’s been fun doing both and seeing both sides of the coin. I will go for bigger things in future.&quot;</p><p>&quot;I was a cricketers' administrator. Yes, you had to make decisions because there’s so much cricket happening, there’s so much money around. There’s women’s cricket, there’s domestic cricket. Yes, you had to take calls at times as an individual,&quot; he added.</p><p><b>Some reports claimed Ganguly was offered the chairman's position in the hugely popular, cash-rich domestic T20 tournament, Indian Premier League (IPL) but he &quot;politely declined&quot; the offer.</b></p><p>The cricket great, who shaped Team India as a captain, wanted to continue as the Board of Control for Cricket in India (BCCI) president, reports said.</p><p><b>Reports also said former BCCI president and IPL franchise Chennai Super Kings (CSK)'s owner N Srinivasan was one among those who slammed Ganguly as a board president accusing him of &quot;non-performance&quot; and alleged that he had represented brands that were the direct rivals of the board's sponsors.</b></p><p>Ganguly's decisions on former skipper Virat Kohli (his stepping down as T20 captain and each other's contradictory remarks on the issue) also earned him the wrath of many in cricketing circles and among Kohli fans.</p></script>"
            },
            {
                "id":"S151020223",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Australia, New Zealand T20 World Cup Super 12 Opener Sold Out",
                "description":" Hosts Australia will begin their title defence at the ICC Men’s T20 World Cup in front of a capacity crowd at the Sydney Cricket Ground, with the opening Super 12 clash officially declared a sell-out.",
                "imageName":"S151020223.jpg",
                "publishedAt":"Dubai: October 15, 2022",
                "content":"<p>Hosts Australia will begin their title defence at the ICC Men’s T20 World Cup in front of a capacity crowd at the Sydney Cricket Ground, with the opening Super 12 clash officially declared a sell-out.</p><p>In what will be a re-match of the ICC Men’s T20 World Cup 2021 Final, Aaron Finch’s team will face Kane Williamson's New Zealand in a 6pm AEDT fixture on Saturday 22 October.</p><p>Over 600,000 tickets have already been snapped up by fans to watch the first ever ICC Men’s T20 World Cup played in Australia.</p><p>The India v Pakistan fixture, to be played the following night at the MCG on October 23, will also be played in front of a full house after additional standing room tickets released two months ago were sold within 10 minutes.</p><p>An official T20 World Cup re-sale platform has been launched, providing a safe and secure way for fans to buy and sell tickets at face value and ensure as many tickets as possible are used.</p><p>Current ticket allocations are also all sold for the double-header at the SCG on 27 October featuring South Africa v Bangladesh and India v Group A runner-up. There are also a very limited number of tickets remaining to the opening match-day of the event, which begins with Sri Lanka taking on Namibia at Kardinia Park Stadium in Geelong this Sunday.</p><p>Tickets are still available for most matches, but fans are encouraged to act now to secure their seats at t20worldcup.com at family-friendly prices. Tickets are just $5 for children (2-16 years) for all First Round and Super 12 matches, and adult tickets start at $20.</p><p>ICC Men’s T20 World Cup CEO Michelle Enright said: “The T20 World Cup is one of the biggest sporting events in the world and we’re delighted that we’re set to see big crowds for both the opening match of the event in Geelong this Sunday and the first weekend of the Super 12 stage in a week’s time.”</p><p>“It’s going to be fantastic to see full stadiums for cricket in October and a great way for fans to celebrate the first ICC Men’s T20 World Cup in Australia.&quot;</p><p>“No matter if you support Australia, New Zealand, India, Pakistan, or any other team, there are still some great seats available at matches right across the seven host cities, so I’d encourage everyone who hasn’t secured their tickets to jump on board for what will be an unmissable event.”</p><p>AUSTRALIA’S T20 WORLD CUP FIXTURE</p><p>V New Zealand, SCG, Sat 22 Oct, 6pm AEDT (SOLD OUT)</p><p>V Group A winner, Perth Stadium, Tue 25 Oct, 7pm AWST</p><p>V England, MCG, Fri 28 Oct, 7pm AEDT</p><p>V Group B runner-up, Gabba, Mon 31 Oct, 6pm AEST</p><p>V Afghanistan, Adelaide Oval, Fri 4 Nov, 6:30pm ACST</p><p>NEW ZEALAND’S T20 WORLD CUP FIXTURE</p><p>V Australia, SCG, Sat 22 Oct, 6pm AEDT (SOLD OUT)</p><p>V Afghanistan, MCG, Wed 26 Oct, 7pm AEDT</p><p>V Group A winner, SCG, Sat 29 Oct, 7pm AEDT</p><p>V England, Gabba, Tue 1 Nov, 6pm AEST</p><p>V Group B runner-up, Adelaide Oval, Fri 4 Nov, 2:30pm ACST</p>"
            },
            {
                "id":"S141020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Sourav Ganguly's BCCI president stint: List of drives and misses",
                "description":"Former Indian skipper Sourav Ganguly's stint as the country's cricket board (BCCI) president is nearing an end as he has been controversially denied a second term in the governing body by the officials",
                "imageName":"S141020221.jpg",
                "publishedAt":"IBNS, October 14, 2022",
                "content":"<p>Former Indian skipper <b>Sourav Ganguly's </b>stint as the country's cricket board (BCCI) president is nearing an end as he has been controversially denied a second term in the governing body by the officials. </p><p>Ganguly's exit, which is also dubbed as an ‘unceremonious one’, has triggered controversies even leading to political ramifications involving the ruling parties of India and the ex-captain's homestate West Bengal - the Bharatiya Janata Party (BJP) and Trinamool Congress (TMC) respectively. </p><p>Cutting across the controversy, India Blooms presents some of the important decisions Ganguly took as the Board of Control for Cricket in India (BCCI) chief as well as the uncomfortable scenarios that popped up under his three-year tenure. </p><p><h1>Achievements and Highlight of Sourav's tenure </h1></p><p><h2>Day/Night Test</h2></p><p>Ganguly's BCCI was instrumental in hosting the first Day/Night Test (also called Pink Ball Test) in the country. </p><p>Then skipper Virat Kohli's Team India took on Bangladesh and headed for a massive win in the Day/Night Test which was held at the Eden Gardens in Kolkata in Nov 2019. </p><p><h2>IPL amid Covid scare</h2></p><p>When the world was unable to grasp the evolving and fast-changing scenarios after Covid-19 broke out in 2020, the BCCI managed to organise the delayed IPL for that year in Dubai, where the infection rates were far less. </p><p><h2>Domestic cricketers' pay hike</h2></p><p>After assuming the charge of the BCCI, Ganguly had clearly stated that his focus would be on first-class cricket. </p><p>In a significant decision, Ganguly introduced pay hikes for the cricketers who play in the domestic circuit. </p><p><h2>Appointing Rahul Dravid as coach</h2></p><p>Ganguly was instrumental in convincing his former colleague Rahul Dravid to become the men's team's head coach after his predecessor Ravi Shastri stepped down. </p><p>Also VVS Laxman was given the charge of the National Cricket Academy after Dravid quit to become the Team India head coach. Ganguly had played an active role in appointing Laxman to the NCA post as well. </p><p><h2>Record IPL media rights </h2></p><p>The IPL media rights for the period of 2023-2027 were sold at a huge amount of Rs. 48,390 crore, which is the second highest for any sporting event after the United States' National Football League. </p><p>Also, the monopoly of a company in acquiring media rights across platforms was broken with two separate biddings for television and digital media. </p><p>While Star won the television rights for Rs. 23,575 crore, Viacom 18 bagged the digital rights at a bigger amount of Rs. 23,758 crore. </p><p><h2>Women's IPL</h2></p><p>Barely a few weeks ago, the outgoing BCCI president had announced the commencement of the women's IPL, which is likely to begin next year. </p><p>In a letter to the state associations, Ganguly wrote as quoted by various media, 'The BCCI is currently working on the much-awaited Women’s IPL. We are expecting to start the first season early next year.' </p><p><h2>Controversies</h2></p><p>Captaincy issues involving Virat Kohli </p><p>Ganguly's decisions on former skipper Virat Kohli (his stepping down as T20 captain and each other's contradictory remarks on the issue) also earned him the wrath of many in cricketing circles and among Kohli fans. </p><p>Ganguly claimed he had personally requested Kohli not to step down as the T20 skipper, something which the latter contradicted. </p><p><h2>Wriddhiman Saha's allegation</h2></p><p>After getting dropped from the senior men's team, wicketkeeper-batsman Wriddhiman Saha made an explosive claim that Ganguly had assured him of a berth in Team India as long as he remains the BCCI boss. </p><p>The claim had raised questions on whether Ganguly interferes into the team selection, which primarily remains the job of the selection committee. </p><p><h2>Endorsements</h2></p><p>Reports said former BCCI president and Chennai Super Kings (CSK) owner N Srinivasan was one among those who slammed Sourav Ganguly as a board president accusing him of 'nonperformance' and alleging that he had represented brands that were the direct rivals of sponsors of BCCI. </p><p>Ganguly, a common face for multiple brands catering to diverse products, was also slammed by his ex-colleague and Delhi BJP MP Gautam Gambhir for doing surrogate advertising. </p><p><b>’If the BCCI president (Ganguly) is doing it (endorsing fantasy league), you can't expect other players not to do it,’ said Gambhir, who made his international debut under Ganguly's captaincy.</b></p>"
            }
        ],
        "entertainment":[
            {
                "id":"E151020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Joy Sengupta, Saayoni Ghosh starrer Bengali film City of Jackals' poster and teaser unveiled",
                "description":"The poster and teaser of actor-politician Joy Sengupta and Saayoni Ghosh starrer upcoming Bengali film City of Jackals was unveiled last week in the city.",
                "imageName":"E151020221.jpg",
                "publishedAt":"Kolkata/IBNS, October 15, 2022",
                "content":"<p>The poster and teaser of actor-politician Joy Sengupta and Saayoni Ghosh starrer upcoming Bengali film City of Jackals was unveiled last week in the city.</p><p>The film deals with an early middle aged working class man who by chance discovers a bag full of money.</p><p>Money, what has been his basic concern till date for a better life now drives his life to some unexpected dark corners.</p><p><b>Joy, who was also present at the teaser launch event, said, &quot;This film is a completely independent, low-budget film with no resources... It is extremely difficult to make these kinds of films.&quot;</b></p><p><b>Speaking about the role, Saayoni said, &quot;I played a very de-glammed character who used to live in the slums but she has aspiration and ambition for a good life. Now the question is whether she will fall in the trap or not.&quot;</b></p><p>&quot;The challenge is always to work with a new director as we actors have to understand their psyche,&quot; she added.</p><p>The film, which also stars Shantilal Mukherjee, Kharaj Mukherjee in key roles, is produced by Prarthana Retail Projects & Muvi Tuvi Media Pvt Ltd.</p>"
            },
            {
                "id":"E151020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Sharmila Tagore steals hearts again as she recreates her iconic 'Mere Sapno Ki Rani' moments with Aditya Narayan",
                "description":"The Indian audience is set to fall in love all over again with the Bollywood beauty of the yesteryears, Sharmila Tagore, with her appearance in the singing reality show Indian Idol 13 where they will see her recreating one of her most iconic on-screen moments from the 1969 hit film Aradhana.",
                "imageName":"E151020222.png",
                "publishedAt":"Indian, October 15, 2022",
                "content":"<p><b>Sharmila Tagore steals hearts again as she recreates her iconic 'Mere Sapno Ki Rani' moments with Aditya Narayan</b></p><p>The Indian audience is set to fall in love all over again with the Bollywood beauty of the yesteryears, Sharmila Tagore, with her appearance in the singing reality show Indian Idol 13 where they will see her recreating one of her most iconic on-screen moments from the 1969 hit film Aradhana. </p><p>Sharmila Tagore will appear in the show with another veteran actor Tanuja in the reality show's ‘leading ladies special episode' as per a new promo.</p><p><b>The promo video shows Sharmila Tagore enacting the scene as contestant Rishi Singh sang the film's hit song 'Mere Sapno Ki Rani Mere Sapno Ki Rani'.</b></p><p>Mere Sapno Ki Rani is a famous song from Aradhana sung by Kishore Kumar, featuring Rajesh Khanna and Sujit Kumar apart from Sharmila.</p><p>The song was filmed on the famous toy train in Darjeeling.</p><p>In the song, Sharmila travels in the train while Rajesh and Sujit's characters follow it around in a jeep.</p><p>As the hero (Rajesh Khanna) sings 'Mere Sapno Ki Rani Mere Sapno Ki Rani', he catches the heroine's (Sharmila's) attention, who keeps stealing glances at him while pretending to read 'When Eight Bells Toll' by Alistair MacLean.</p><p>In the clip, the judges of Indian Idol, Neha Kakkar, Vishal Dadlani and Himesh Reshammiya welcomed Sharmila Tagore and Tanuja.</p><p><b>As contestant Rishi Singh sang 'Mere Sapno Ki Rani', Sharmila used the same book that she did in the film and acted in the same way as she did decades ago when the song was shot, with Rishi and show's host Aditya Narayan filled in for Rajesh Khanna and Sujit.</b></p><p>Sharmila,77, who is loved by her fans for her grace and charm apart, garnered a lot of praise from the netizens.</p><p>Reacting to the video, one fan wrote, “Two evergreen beauty from Bengal.”</p><p>Another fan commented, “Wow..so good” (heart emoji). Another fan wrote, “you rock Rishi.” Many fans commented that Sharmila still looked as beautiful as in the original song. “Over 50 years have passed since the film but she looks as pretty and graceful as ever,”</p><p>Indian Idol is in its 13th season and airs on Sony entertainment television every Saturday and Sunday at 8 pm.</p>"
            },
            {
                "id":"E141020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Sonam Kapoor gives us a sneak peek at her stunning look from Karwa Chauth. Check out",
                "description":"Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.",
                "imageName":"E141020221.jpg",
                "publishedAt":"Mumbai/IBNS, October 14, 2022",
                "content":"<p>Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.</p><p>Sharing a set of images from her parents' Anil and Sunita Kapoor's Mumbai house, Sonam, in her Instagram post revealed that she doesn't fast on Karwa Chauth but loves dressing up a bit to celebrate the day with family.</p><p>'My husband isn't a fan of Karwa Chauth as he thinks fasting should only be intermittent so I've never kept it! But both of us are big believers that festivals and traditions are a great reason for family and friends to come together,' she wrote.</p><p><b>Sonam Kapoor's mom Sunita Kapoor hosts Karwa Chauth festivities at home every year, which are attended by her friends from the industry. </b></p><p>'I love that my mom loves celebrating it and I love being a part of it and dressing up. Sunita Kapoor, you always throw the best dos! Your energy and generosity is legendary and I hope to follow the same path! Happy KC everyone,' wrote Sonam.</p><p>She also posted a video of herself getting ready for the festivities and wrote: 'It's so nice to get back to the real world with my team, get dressed up and meet people... Love being back in my home ground. Love you Mumbai with all your scars and cracks you're magic.'</p>"
            }
        ],
        "international":[
			{
                "id":"I191020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"‘Undeniable need for accountability’ in Ukraine as violations mount",
                "description":"The Independent Commission of Inquiry on Ukraine, presented its first detailed written report to the UN General Assembly on Tuesday, which concludes that there are reasonable grounds to believe “an array” of war crimes, violations of international human rights and humanitarian law have been committed.",
                "imageName":"I191020221.jpg",
                "publishedAt":"New York, October 19, 2022",
                "content":"<p>The Independent Commission of Inquiry on Ukraine, presented its first detailed written report to the UN General Assembly on Tuesday, which concludes that there are reasonable grounds to believe &quotan array&quot of war crimes, violations of international human rights and humanitarian law have been committed.</p><p>Set up by the Human Rights Council in March, it presented its initial findings in Geneva at the end of last month.</p><p>&quotGiven the gravity of the identified violations, there is an undeniable need for accountability&quot, the Commission told the General Assembly.</p></p>Devastation and loss</p><p>&quotThe impact of these violations on the civilian population in Ukraine is immense. The loss of lives is in the thousands. The destruction of infrastructure is devastating,&quot said Chair of the Commission, Erik Møse.</p><p>The Commission documented attacks where explosive weapons were used indiscriminately in populated areas that were under attack by Russian armed forces, and found that Russian troops had attacked civilians attempting to flee.</p><p>There are also examples of both parties, to different degrees, failing to protect civilians or civilian objects against the effects of attacks, by locating military objects and forces within or near densely populated areas.</p><p>Russian armed forces are responsible for the vast majority of the violations identified, including war crimes. Ukrainian forces have also committed international humanitarian law violations in some cases, including two incidents that qualify as war crimes.</p><p>The truth ‘as we have observed it’</p><p>In an interview with UN News on Tuesday, Mr. Møse said that this first phase of the Commission’s work, was chiefly concerned with gathering primary evidence, especially witness testimony.</p><p>Asked for his reaction to the fact that many Russians do not accept that their forces have carried out any human rights abuses during the war, he said simply that &quotwhat is in this report, is the truth as we have observed it.&quot</p><p>The Commission documented patterns of summary executions, unlawful confinement, torture, ill-treatment, rape and other sexual violence committed in areas occupied by Russian armed forces across the four regions on which it focused.</p><p>A stepfather whose son was killed in Bucha told the Commission: &quotI used to want to find those who were responsible and kill them. But now I want the guilty to be put on trial and I want the truth to come out.&quot</p><p>Food exports down, but grain initiative provides big boost</p><p>The UN Food and Agriculture Organization (FAO) on Tuesday requested $180.4 million to strengthen Ukraine’s capacity for food storage, testing and certifications, which are needed for exporting food across the border.</p><p>To date, FAO has mobilized $79.7 million, leaving a gap of $100.7 million, which is urgently needed to support households in rural areas during the winter.</p><p>According to the government, Ukraine exported 12.9 million tonnes of cereals, legumes and flour in the 2022-23 marketing year, compared to 20 million tonnes last year.</p><p>More than 7.8 million tonnes of this grain and foodstuffs were exported through the Black Sea Grain Initiative, established by the UN and partners, to allow food and fertilizer to reach overseas markets, especially where need is greatest in the developing world.</p><p>Image:UNOCHA/Saviano Abreu</p>"
		},
			{
                "id":"I191020222",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"Global health: Women and children pay heaviest price for ‘gaping inequities’",
                "description":"A new UN report shows that women’s and children’s health has suffered globally, as the impacts of conflict, the COVID-19 pandemic and climate change converge, with devastating effects on prospects for children, young people and women.",
                "imageName":"I191020222.jpg",
                "publishedAt":"New York, October 19, 2022",
                "content":"<p>A new UN report shows that women’s and children’s health has suffered globally, as the impacts of conflict, the COVID-19 pandemic and climate change converge, with devastating effects on prospects for children, young people and women.</p><p>Data presented in the report show a clear and critical regression across virtually every major measure of childhood wellbeing, and many key indicators of the Sustainable Development Goals (SDGs). Since the last Every Woman Every Child Progress Report published in 2020, food insecurity, hunger, child marriage, risks from intimate partner violence, and adolescent depression and anxiety have all increased.</p><p>‘Protect the promise’</p><p>The report, titled Protect the Promise, is published by global partners, including the World Health Organization (WHO), UN Children’s Fund UNICEF, the UN sexual and reproductive health agency, UNFPA, Partnership for Maternal, Newborn & Child Health (PMNCH) and Countdown to 2030, as a bi-annual summary of progress in response to the UN Secretary-General's Every Woman Every Child Global Strategy for Women, Children's and Adolescents' Health.</p><p>An estimated 25 million children were either under-vaccinated or not vaccinated at all in 2021 – 6 million more than in 2019 - increasing their risk of contracting deadly and debilitating diseases.</p><p>Millions of children missed out on school during the pandemic, many for more than a year, while approximately 80 per cent of children in 104 countries and territories experienced learning-loss because of school closures.</p><p>10.5 million lost parents, caregivers</p><p>Since the start of the global pandemic, 10.5 million children have lost a parent or caregiver to COVID-19.</p><p>&quotAt the core of our unkept promise is the failure to address the gaping inequities at the root of global crises, from the COVID-19 pandemic to conflicts and the climate emergency&quot, said UN chief António Guterres.</p><p>&quotThe report describes the impacts of these crises on women, children and adolescents, from maternal mortality to education losses to severe malnutrition&quot.</p><p>Sharp decline</p><p>WHO head Tedros Adhanom Ghebreyesus, said that the COVID pandemic’s &quotlong-term impact on the health and well-being of women, children and adolescents is becoming evident - their chances for healthy and productive lives have declined sharply&quot.</p> <p>&quotAs the world emerges from the pandemic, protecting and promoting the health of women, children and young people is essential for supporting and sustaining the global recovery.&quot</p><p>UNICEF chief Catherine Russell said the pandemic has raised the stakes for all vulnerable communities, and reversed hard-won progress for women, children, and adolescents, &quotbut we are not powerless to change this…By investing in resilient, inclusive primary health care systems, jumpstarting routine immunization programmes, and strengthening the health workforce, we can make sure that every woman and every child can access the care they need to survive and thrive.&quot</p><p>Rights rolled back</p><p>&quotIn the face of increasing political pushback against sexual and reproductive health and rights in many countries, women, children and adolescents today are left without many of the protections of just a decade ago, and many others still have not seen the progress they need,&quot said Dr. Natalia Kanem, UNFPA Executive Director.</p><p>The report provides wide-ranging evidence that children and adolescents face wildly divergent chances of leading a healthy life simply based on where they are born, their exposure to conflict, and the economic circumstances of their families.</p><p>Statistics tell the story</p><p>A child born in a low-income country has an average life expectancy at birth of around 63 years, compared to 80 in a high-income country. In 2020, five million children died before their fifth birthday, mostly from preventable or treatable causes.</p><p>Most maternal, child, and adolescent deaths and stillbirths are concentrated in just two regions – sub-Saharan Africa and South Asia.</p><p>More than 45 million children had acute malnutrition in 2020, a life-threatening condition which leaves them vulnerable to death, developmental delays and disease. Nearly three-quarters of these children live in lower-middle-income countries.</p><p>A staggering 149 million children were stunted in 2020. Africa is the only region where the numbers of children affected by stunting increased over the past 20 years, from 54.4 million in 2000 to 61.4 million in 2020.</p><p>The six countries with the highest numbers of internally displaced persons – Afghanistan, the Democratic Republic of the Congo, Ethiopia, Sudan, Syria and Yemen – are also among the top 10 food insecure countries.</p><p>A woman in sub-Saharan Africa has around a 130 times higher risk of dying from causes relating to pregnancy or childbirth than a woman in Europe or North America.</p><p>Millions of children and their families are experiencing poor physical and mental health from recent humanitarian disasters in Afghanistan, Ethiopia, Pakistan, Somalia, Ukraine and Yemen. In 2021, a record 89.3 million people worldwide were driven from their homes by war, violence, persecution, and human rights abuse.</p><p>The report calls on the global community to address this damaging trajectory and protect the promises made to women, children, and adolescents in the SDGs.</p><p>In particular, it advocates for countries to continue investing in health services, to address all crises and food insecurity, and empower women and young people around the world.</p><p>World Health Summit pledge of $2.6 billion to end polio</p><p>Leaders meeting at the World Health Summit in Berlin on Tuesday, pledged an extra $2.6 billion in funding toward the Global Polio Eradication Initiative’s (GPEI) 2022-2026 Strategy to end polio.</p><p>The historic boost came at an event co-hosted by Germany’s Federal Ministry for Economic Cooperation and Development (BMZ), and the funds will support global efforts to overcome the final hurdles to polio eradication.</p><p>The extra cash will help fund vaccination for some 370 million children annually over the next five years, and continue disease surveillance across 50 countries, said WHO in a news release.</p><p>&quotNo place is safe until polio has been eradicated everywhere. As long as the virus still exists somewhere in the world, it can spread – including in our own country. We now have a realistic chance to eradicate polio completely, and we want to jointly seize that chance,&quot said Svenja Schulze, Germany’s Minister for Economic Cooperation and Development.</p><p>Wild poliovirus is endemic in just two countries – Pakistan and Afghanistan. However, after just six cases were recorded in 2021, 29 cases have been recorded so far this year, including a small number of new detections in southeast Africa linked to a strain originating in Pakistan.</p><p>Additionally, outbreaks of polio variants that can emerge in places where not enough people have been immunized - continue to spread across parts of Africa, Asia and Europe, with new outbreaks detected in the United States, Israel and the United Kingdom in recent months.</p><p>&quotThe new detections of polio this year in previously polio-free countries are a stark reminder that if we do not deliver our goal of ending polio everywhere, it may resurge globally,&quot said WHO chief Tedros.</p><p>Image: © UNICEF/ Zahara Abdul</p>"
				},
		{
                "id":"I161020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"'China Communist Party Congress:': Xi defends 'Zero-Covid' policy;condemns 'interference' in Taiwan",
                "description":"TChinese President Xi Jinping heaped praises on the Communist Party's rule as he opened the five-yearly Congress attended by selected delegates who are likely to affirm his third term as the party's chief, media reports said",
                "imageName":"I161020221.png",
                "publishedAt":"China, October 16, 2022",
                "content":"<p>'Chinese President Xi Jinping heaped praises on the Communist Party's rule as he opened the five-yearly Congress attended by selected delegates who are likely to affirm his third term as the party's chief, media reports said.':</p><p><b> He said China has established control over Hong Kong, turning it from chaos to governance, and condemned the external support to Taiwan, calling it interference.</b></p><p>China had imposed sweeping national security law to muzzle pro-democracy demonstrations in 2019.Beijing claims control over self-governed Taiwan, which considers itself separate from the mainland.</p><p><b>Beijing had 'demonstrated resolve and ability to safeguard China's sovereignty…and to oppose Taiwan independence', he said addressing the Communist Party delegates at Beijing's Great Hall of the People, according to BBC.</b></p><p>As the delegates broke into applause, he vowed a 'major struggle against separatism and interference' in the self-ruled island of Taiwan</p><p><b>Xi also defended the lingering Covid lockdowns, saying that the Zero-Covid policy was an 'all-out people's war to stop the spread of the virus', he said.</b></p><p>He asserted that the policies had 'protected people's safety and health to the highest degree and achieved significant positive results'.</p><p>The intermittent lockdowns and travel restrictions have evoked anger and taken a heavy toll on the Chinese people and the economy.</p><p>He maintained that Covid policies, which are still imposing heavy curbs on people's lives, were for their safety.</p><p></b>Xi also made references to disturbances within the party and said his rule had 'removed serious hidden dangers in the party'.</b></p><p>'We have waged a battle against corruption on a scale unprecedented in history, punishing corrupt officials of all types,' he said.</p><p>Since reaching the top position, Xi has ensured a crackdown on wide-reaching corruption going up to the highest party offices.</p><p>However, critics have called it political cleansing, an exercise to eliminate Xi's rivals and increase the power of his faction within the party.</p><p></b>Xi's way to becoming the most powerful leader since Mao Zedong will be open once he gets a third term as leader of the Chinese Communist Party (CCP).</b></p><p>About 2,300 delegates are meeting to elect party leaders and debate key policies.</p><p><b>Observers have said that there appears to be only one faction in the 20th Party Congress that of Xi, said the BBC report.</b></p><p>In a clear sign of this consolidation of power, top Chinese Communist Party (CCP) leaders released a communiqué days earlier endorsing him as 'the core' of the party and leadership, according to the BBC report, which added that the leaders also called for the party to unite even more closely behind him.</p>"
				
		},	{
                "id":"I151020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"'Erroneous measure of hunger': India rejects Global Hunger Index ranking",
                "description":"The world is at risk of yet another year of record hunger as the global food crisis continues to drive more people into worsening levels of acute food insecurity, The World Food Programme (WFP) warned on Thursday",
                "imageName":"I151020221.jpg",
                "publishedAt":"New York, October 15, 2022",
                "content":"<p><b>'Erroneous measure of hunger': India rejects Global Hunger Index ranking</b></p><p> India has termed the latest Global Hunger Index report as an &quot;erroneous measure of hunger&quot; rejecting the methodology used to calculate the rankings after the country slipped to the 107th position out of 121 countries in 2022.</p><p>A Press note issued by the Union Ministry of Women and Child Development said: &quot;Three out of the four indicators used for calculation of the index are related to health of children and cannot be representative of the entire population.&quot;</p><p><b>It further stated: &quot;The fourth and most important indicator estimate of Proportion of Undernourished (PoU) population is based on an opinion poll conducted on a very small sample size of 3,000. The report is not only disconnected from ground reality but also chooses to deliberately ignore efforts made by the government to ensure food security for the population, especially during the Covid pandemic.&quot;</b></p><p>In 2021, India was ranked 101. The 2022 rankings put the country behind Bangladesh, Pakistan, and Nepal.</p><p>The ministry's statement further said: &quot;Taking a one-dimensional view, the report lowers India's rank based on the estimate of Proportion of Undernourished (PoU) population for India at 16.3%.&quot;</p><p><b>The statement said: &quot;The matter was taken up with FAO not to use such estimates based on FIES survey module data in July 2022, as the statistical output of the same will not be based on merit. Though an assurance was forthcoming that there will be further engagement on this issue, the publication of the Global Hunger Index report irrespective of such factual considerations is regrettable.&quot;</b></p><p>The note from the Ministry of Women and Child Development raised serious doubts about some of the survey questions.</p><p><b>It said: &quot;Some of the questions asked to the respondents are: 'During the last 12 months, was there a time when, because of lack of money or other resources, you were worried you would not have enough food to eat? You ate less than you thought you should?'&quot;</b></p><p><b>The ministry said: &quot;It is evident such questions do not search for facts based on relevant information about the delivery of nutritional support and assurance of food security.&quot;</b></p><p>The ministry further pointed out that deducing hunger based on indicators mainly relating to health indicators of children is &quot;neither scientific nor rational&quot;. </p>"
            },
            {
                "id":"I141020221",               
                "category":"IBNS",
                "author":"Our Correspondent",
                "title":"World Food Day: Another year of global record hunger looms amid food and climate crisis",
                "description":"The world is at risk of yet another year of record hunger as the global food crisis continues to drive more people into worsening levels of acute food insecurity, The World Food Programme (WFP) warned on Thursday",
                "imageName":"I141020221.jpg",
                "publishedAt":"New York, October 14, 2022",
                "content":"<p>The world is at risk of yet another year of record hunger as the global food crisis continues to drive more people into worsening levels of acute food insecurity, The World Food Programme (WFP) warned on Thursday.</p><p>In a call for urgent action to address the root causes of rising hunger, ahead of World Food Day, the agency said the current crisis was down to a “confluence of competing crises”, caused by climate shocks, conflict and economic instability.</p><p>The number of hungry people around the world has shot up from 282 million to around 345 million since the beginning of 2022, and by mid-year, WFP had reached just over 111 million in need, aiming to reach a record 153 million by year’s end.</p><p>“We are facing an unprecedented global food crisis and all signs suggest we have not yet seen the worst”, said WFP Executive Director David Beasley.</p><p>“For the last three years hunger numbers have repeatedly hit new peaks. Let me be clear: things can and will get worse unless there is a large scale and coordinated effort to address the root causes of this crisis. We cannot have another year of record hunger”.</p><p>Holding back famine</p><p>The emergency food relief agency underscored that it is currently “holding back famine” in five countries: Afghanistan, Ethiopia, Somalia, South Sudan and Yemen.</p><p>Conflict continues to drive the most vulnerable into catastrophic hunger, with communications disrupted, humanitarian access restricted and communities displaced.</p><p>The current war in Ukraine, for example, has disrupted global trade, pushing up transport costs and lead times while leaving farmers lacking access to enough fertilizers and other agricultural supplies they need, to produce enough food.</p><p>Economy and climate</p><p>Meanwhile, climate shocks are increasing in frequency and intensity, leaving those affected, no time to recover between disasters.</p><p>An unprecedented drought in the Horn of Africa is pushing more people into alarming levels of food insecurity, with famine now projected in Somalia, while floods have devastated homes and farmland in several countries, most strikingly in Pakistan.</p><p>WFP explained that the ability of governments to respond is constrained by their own national economic woes – currency depreciation, inflation, debt distress – as the threat of global recession also mounts.</p><p>“This will see an increasing number of people unable to afford food and needing humanitarian support to meet their basic needs”, the agency warned.</p>"
            }

        ],
        "region":[],
        "tourism":[],
        "imagegallery":[
            {

                "url":"/G20102022/3day",
                "path":"images/gallery/G20102022/3day",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"A 3-day workshop was held at Pragya Bhavan on monitoring and evaluation of development activities on Oct 19",
                "status":"active"
            },  
            {

                "url":"/G20102022/cm",
                "path":"images/gallery/G20102022/cm",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Chief minister manik saha inaugurates Tripura startup week program at Agartala on Oct 19",
                "status":""
            },   
            {

                "url":"/G20102022/cricket",
                "path":"images/gallery/G20102022/cricket",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Tripura masters cricketers held a pressmeet in Agartala press club on Oct 19",
                "status":""
            },  
            {

                "url":"/G20102022/messi",
                "path":"images/gallery/G20102022/messi",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Messi fifth time lucky as Argentina lift Copa America title",
                "status":""
            },     
            {

                "url":"/G20102022/sfi",
                "path":"images/gallery/G20102022/sfi",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Sfi held a pressmeet in Agartala on Oct 19",
                "status":""
            },  
            {

                "url":"/G20102022/stgt",
                "path":"images/gallery/G20102022/stgt",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"STGT examinees met Finance Minister Jishnu Devavarma at his residence demanding recruitment on Oct 19",
                "status":""
            },     
            {

                "url":"/G18122022",
                "path":"images/gallery/G18122022",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Clay artisan making earthen lamps ahead of the festival of lights Deepavali at Nandan Nagar on October 18",
                "status":""
            },     
            {

                "url":"/G17122022",
                "path":"images/gallery/G17122022",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Chief Minister Dr Manik Saha attends a blood donation camp organized by Chemist and Drugist association of Tripura at Agartala on October 17",
                "status":""
            },          
            {

                "url":"/unemployed",
                "path":"images/gallery/unemployed",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"unemployed pharmacist of Tripura held a pressmeet in Agartala on Oct 16",
                "status":""
            },
            {

                "url":"/swarnakamal",
                "path":"images/gallery/swarnakamal",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Swarna Kamal jewellers held a pressmeet in Agartala on Oct 16",
                "status":""
            },
            {

                "url":"/maniksarka",
                "path":"images/gallery/maniksarka",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Opposition leader Manik Sarkar was the speaker at the meeting of Tripura Sabha Sunder Development Association in Agartala on Oct 16",
                "status":""
            },
            {

                "url":"/chowdhury",
                "path":"images/gallery/chowdhury",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Minister Sushant Chowdhury was present on Sunday to inaugurate two state digital banks along with All India on Oct 16 ",
                "status":""
            },
            {

                "url":"/chibardanfestival",
                "path":"images/gallery/chibardanfestival",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Bhutanese in Agartala with winter clothes on Oct 16",
                "status":""
            },
            {

                "url":"/bhutanese",
                "path":"images/gallery/bhutanese",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Bhutanese in Agartala with winter clothes on Oct 16",
                "status":""
            },
            {

                "url":"/diwali",
                "path":"images/gallery/diwali",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Candles are being made on the occasion of Diwali in Agartala on Oct 16",
                "status":""
            },
            {

                "url":"/cm",
                "path":"images/gallery/cm",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Chief Minister Prof Dr Manik Saha  attend State Level Programme for 4 years completion of Ayushman Bharat at Agartala on OCT 15",
                "status":""
            },
            {
                "url":"/amarabengali",
                "path":"images/gallery/amarabengali",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Amara bengali held a pressmeet in Agartala on Oct 15",
                "status":""
            },
            {
                "url":"/officesports",
                "path":"images/gallery/officesports",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Inter office sports and cultural association held a pressmeet in Agartala on Oct 15",
                "status":""
            },
            {
                "url":"/stgt",
                "path":"images/gallery/stgt",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"STGT candidates meet Minister Sushanta Chowdhury at his official residence on October 15",
                "status":""
            },
            {
                "url":"/president",
                "path":"images/gallery/president",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"The President of India her Excellency Droupadi Murmu launches a slew of government projects including the new MLA hostel close to the Civil secretariat on October 12.",
                "status":""
            },
            {
                "url":"/winterclothsales",
                "path":"images/gallery/winterclothsales",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Winter clothes sellers Bhuti community people installing stalls at Battala TRTC area on October 10",
                "status":""
            },
            {
                "url":"/alks",
                "path":"images/gallery/alks",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"AIKS commemorates martyrs of farmers' movement of Golaghati at AIKS headquarters on October 10",
                "status":""
            },
            {
                "url":"/durgapuja",
                "path":"images/gallery/durgapuja",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Idols of Devi Laxmi are being taken to homes ahead of the Laxmi Puja tomorrow at Agartala markets on October 08",
                "status":""
            },
            {
                "url":"/market",
                "path":"images/gallery/market",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Huge crowd in Agartala markets to buy fruits for Laxmi Puja celebrations on October 08",
                "status":""
            },
            {
                "url":"/mayer",
                "path":"images/gallery/mayer",
                "imageName":"Image1.JPG",
                "title":"",
                "caption":"Mayer Gomon Agartala gears up for the mega carnival on Oct 07",
                "status":""
            }
           
           
        ]

    }
}