{
    "totalResults":"8",
    "news":
    {
        "global":[
            {
                "id":"16",
                "shortTitle":"Today Headline",
                "name":"Durga puja passed off peacefully barring some stray incidents",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Durga puja passed off peacefully barring some stray incidents",
                "description":"The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala",
                "url":"/news?id=16",
                "urlToImage":"news16.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala and many other parts of the state on the day of ‘Maha Saptami’ and ‘Maha Nabami’ and  barring some stray incidents of suspected murder and road mishaps  in separate places of the state during last four days.</p<p>The incessant rain on the night of ‘Maha Saptami’ across Agartala and other parts of Tripura, dampens the festival spirit . Resulting in, the majority of low-lying areas of the city getting inundated and road traffic was also badly affected.</p<p>While, irrespective of castes and creeds, a huge number of people thronged puja pandals during the festival days and immersion of Goddess is still going on Thursday also in different places of the state including capital city Agartala.</p<p>No untoward incident was reported from the capital town that alone hosts over 500 puja, said police on Thursday.</p<p>Meanwhile, the great immersion carnival festival “Mayer Goman”, which will be held on October 7 by participation of all major community Durga Puja organizers , the Information and Cultural Affairs (ICA) department is not leaving any stone unturned to make it a historic event for the state’s people.</p<p>Official sources said that all major clubs of the city will participate in the  immersion carnival “Mayer Goman” on October 7th and the government is now making big structures in front of Agartala City Centre for the event.</p<p>Though, four days of Durga Puja passes off peacefully, reports said that few person sustained injuries in several road mishaps due to reckless driving and a minor inmate of a drug rehabilitation centre in Madhupur area under Sepahijala district alleged beaten to death by the authorities of drug rehab centre and victim family has also filed a specific FIR against accused person.</p<p>Despite many apprehensions for bad weather conditions  , people in large numbers were seen visiting pandals in groups braving incessant rains.</p>"
            }
        
        ],    
        "local":[
         
          ],
        "flash":[
            {
                "id":"17",
                "name":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "description":"During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event.",
                "url":"/news?id=16",
                "urlToImage":"N1.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event. The event which was being held at ONGC premises after three years due to the pandemic-induced disruption made a rousing return as it witnessed massive public participation in thousands and was also widely covered by local media, as people thronged the ONGC KV Ground on the final day of Durga Puja Bijoya Dashami and the Navaratri festival.</p><p>Deputy Chief Minister Dev Varma was welcomed at the KV Ground by Asset Manager Tarun Malik and other senior officers of the Tripura Asset.</p><p>Speaking on the occasion, Jishnu Dev Varma said that the day marks not just the “victory of truth over untruth and ‘Dharma’ over ‘Adharma’ but is also a celebration of motherland and nationalism.” To have the epic tale of Ramayana staged symbolically at such a massive scale and with such huge public participation is also a reflection of how hope always triumphs eventually, he said in reference to the extreme uncertainty and difficulties posed by the pandemic to the people at large. He congratulated ONGC for making this event an important part of Tripura’s local life during this time of the year, and said, ‘none other than ONGC can pull of something like this at such a grand scale, not merely because it has the resources but also for the love that exists between ONGC and the people of Tripura’.</p><p>He also acknowledged the critical role the Maharatna major has played over the years in providing employment to Tripura’s youth as well as generating many business and livelihood opportunities for the local entrepreneurs and individuals. ONGC has transformed countless lives all over the country by providing the energy that obliterates darkness, celebrates light and ushers in prosperity and it rightfully deserves the dignity and honour that is accorded to it today, he said.</p><p>Asset Manager Tarun Malik while welcoming the Deputy CM was admired not only for his deft and expert handling of many important portfolios in the state but also for his scholarly knowledge on various subjects and issues of critical importance. “At a time when many of us today don’t have the patience to sit through even a few pages of reading, he is a true scholar and thinker in our midst and continues to inspire us with his meaningful words and advice”, he said. He also thanked the Dy CM for taking time out of his busy schedule in a festive period such as Durga Puja and said that would motivate ONGCians of Tripura immensely in their pursuit of energy security for this beautiful state and the country at large.</p><p>To mark the special occasion, a short yet entertaining and engaging Ram-Leela play-drama was also enacted by the young children of ONGC Tripura Asset, for the very first time.</p>"
            },
            {
                "id":"18",
                "name":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "description":"The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.",
                "url":"/news?id=17",
                "urlToImage":"N2.JPG",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.</p><p>On July 2nd night, two youths were murdered in a drug rehabilitation centre located at Nandan Nagar area under Budhjungnagar police station and the prime accused in the double murder case was the owner of drug rehab centre, who had committed the crime  in association of other inmates of the center. Day after the incident, police recovered two bodies from a jungle at Durga Chowdhury Para under the same police with multiple injuries and with hands tied behind their bodies.</p><p>While, on the day of “Bijoya Dashami”, one more drug rehab centre located at Madhupur area under Sepahijala district has been accused for their direct involvement for a brutal murder of an inmate of the rehab centre.</p><p>Police sources said that on September 25th last one Gafur Miah of Naljala village under Bishramganj police station handed over his addicted son Ismail Miah (18) to a drug rehabilitation centre named as “Hamkrai Naikol Bodol” in Madhupur area of the same district.</p><p>But, on the ‘Dashami’ day, Gafur Miah was called off by a authority of rehab centre that his son had suffered injuries as he slipped on the floor. Immediately, Gafur Miah along with his few relatives rushed to the spot and found his son dead with multiple injuries. They immediately shifted his Madhupur Primary health centre and informed the matter to police. They alleged that persons running the rehab center lynched their son and brutally killed him.</p><p>Police also rushed to the spot and conducted autopsy of the body in presence of a magistrate and has also registered the FIR against drug rehab authorities.</p><p>Police sources added that the primary autopsy report reveals that the victim boy had several injuries in his entire body and leg was severely broken and his penis was compressed probably for thrashing him.</p><p>Police also said that based on the complaint of the victim's family, they started an investigation and will take all legal steps against the accused persons</p>"
            },
            {
                "id":"14",
                "name":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "description":"Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.",
                "url":"/news?id=14",
                "urlToImage":"News14.jpg",
                "publishedAt":"Agartala, October 2, 2022",
                "content":"<p>Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>Hundreds of auto rickshaw workers and activists under the banner of CITU on Sunday morning staged their protest in front on CNG stations demanding roll back of the decision. The workers also blocked roads.The abnormal hike of prices of CNG across the state has affect the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.<p></p>On Saturday, TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 2nd.</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p>"
            },
            {
                "id":"10",
                "name":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "description":"The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers",
                "url":"/news?id=10",
                "urlToImage":"News10.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers.</p><p>Those who are not coming under the bracket of government also don’t have to reason to dishearten as another 30,000 people are coming under the social pension scheme. The cabinet decided all these in a meeting held on Thursday night.</p><p>The Information and Cultural Affairs (ICA) Minister on Friday afternoon  informed in a press conference, while Education Minister Ratan Lal Nath said that the government kept its commitment and urged people to enjoy the Durga Puja with a smiling face.</p><p>Chowdhury said that a total of 3, 18,415 social pensioners will get new wages of Rs.2000 per month from October 1 and they will receive the same amount in their respective bank accounts. The cabinet has also decided to give social pension to more than 30,000 beneficiaries and for that the government will spend Rs. 6 crore per month in addition.</p><p>He said that Thursday’s cabinet has also decided to appoint 6,067 Special Executive under Home Department on contract basis and they will be appointed in the service through SPs of the districts. He said that interested people from the age group of 21 to 45 years can apply for the post in their respective police stations and the recruitment process will be completed in the next one month.</p><p>The cabinet has also decided to hike the salaries of 9,931 Anganwadi workers and helpers at the rate of 15% , similarly the honorarium of ASHA workers will also get a hike of 15%, said Chowdhury. The cabinet has decided that 17 Professors will also be appointed on contract basis for Veterinary college and has also created 374 new posts under the Rural Development department, said the Minister.</p><p>Meanwhile, Education Minister Ratan Lal Nath addressing another press conference said that on September 27 and September 30, offer letters for 514 TET qualified teachers had been released by the Education department.</p><p>He said that the cabinet has decided to release offer letters for 3,108 Teacher Eligibility Test (TET) qualified candidates will be released and in addition of 514 offer letters, altogether 3,622 TET qualified candidates are getting their appointment as government teachers.</p>"
            },
            {
                "id":"11",
                "name":"85 TPS Gr-I, II officers transferred",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"85 TPS Gr-I, II officers transferred",
                "description":"In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police",
                "url":"/news?id=11",
                "urlToImage":"News11.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>Agartala, October 1, 2022: In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police.</p><p>The General Administration (Personnel and Training) department of the state government through notification issued on Thursday said that among the transferred officer only TPS Grade-I officer Nila Kumar Jamatia has been transferred as deputy commandant of 6th TSR battalion and rest 84 TPS Grade-II officers are mostly new promote officers, who are promoted from police inspectors to Dy.SP rank officers and were posted in different wings of state police including in TSR battalions.</p>"
            },
            {
                "id":"12",
                "name":"CM inaugurates 5 smart city projects",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM inaugurates 5 smart city projects",
                "description":"In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday",
                "url":"/news?id=12",
                "urlToImage":"News12.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday.</p><p>During an inauguration programme held at Old Motor Stand area of the city  on Friday under Agartala Smart City Mission and Agartala Municipal Corporation (AMC) , Dr Said said that based on the requirement and demands of people, the present state government is taking projects for the welfare of people  and these are now reflecting.</p><p>He said that welfare schemes of the government are now reaching every corner of the state.</p><p>Highlighting the launching of state level special campaign “Prati Ghore Susashan” (good governance at every household)   to ensure benefits  of various state and central schemes for the people of the state during the celebration of 72th birthday of Prime Minister Narendra Modi on September 17 last, the Chief Minister said that two-and-a-half-month long campaign on good governance will reach every household.</p><p>He also said that as per the decision taken by the state cabinet, above 6000 government jobs will be given in coming days and the government has also hiked the salaries of Anganwadi and ASHA workers at the rate of 15 %.</p><p>During the programme, AMC mayor Dipak Majumder and AMC commissioner Dr Shailesh Yadav, deputy mayor Manika Das Datta and MLA Dr Dilip Das were also present.</p>"
            },
            {
                "id":"9",
                "name":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "description":"As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them",
                "url":"/news?id=9",
                "urlToImage":"news9.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them.</p><p>As promised in the state assembly the Chief Minister Dr Manik Saha had invited the representatives of the retrenched teachers for a discussion in his official chamber here at Civil Secretariat on Wednesday morning over the claims of retrenched teachers in presence Advocate General Siddhartha Sankar Dey and Law Secretary Biswajit Palit.</p><p>Sources said that after getting appointment and invitation from Chief Minister Office (CMO), a delegation of six members of retrenched teachers led by Bijay Krishna Saha explained how according to the High Court judgment of 2014 (Para-127) only teachers whose jobs had been challenged on the ground of recruitment rules-not more than 58-had been terminated and the same order has also been uphold by the Supreme Court in its order dated March 29th, 2017 last.</p><p>But, recently in a reply to RTI queries the Supreme Court has clarified that no teacher except the 462 notified had been parties to the case and their claims to reinstatement is justified as they had been illegally terminated en masse without any individual notice by the previous government.</p><p>After hearing the claims made by retrenched teachers, The Chief Minister had collected all the documents substantially proving their claims and Dr Saha said that he was not fully aware of all such developments over the cases of teachers, said Bijay Krishna Saha.</p><p>Saha speaking with media persons after their meeting with the Chief Minister said that CM has compassionately heard their grievance and assured that he will meet them again after Durga Puja celebration. Chief Minister also asked the agitated teachers for all relevant documents in support of their claims and assured that government will take all possible steps to rehabilitate them as per law.</p><p>Chief Minister also said that the Law department will analyze and verify all the submitted documents and after consultation with the Advocate General and Law Secretary of the state government, he will meet them again.</p><p>Bijay Krishna Saha and other retrenched teachers also added that the Chief Minister repeatedly told them within the framework of law, the present government wanted to rehabilitate and will take all necessary steps if the law and orders of Courts permit the state government.</p><p>He also directed the concerned law officials to examine the claims of teachers and to give suggestions to the state government to protect their livelihood.</p><p>The leaders of retrenched teachers have also expressed their satisfaction after meeting with the Chief Minister and added that they are now seeing a ray of hope to protect their livelihood and their families.</p><p>It may be recalled here that leader of the Opposition Manik Sarkar and the lone Congress MLA Sudip Roy Barman condemned the police action held on September 26 during ‘assembly march’ by retrenched teachers and urged the Chief Minister to meet the agitating teachers. Accordingly, their representatives called on Dr Saha on Wednesday.</p>"
            },
            {
                "id":"0",
                "name":"Opposition stage walkout over adjournment motion",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Opposition stage walkout over adjournment motion",
                "description":"Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania",
                "url":"/news?id=1",
                "urlToImage":"News1.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania.</p><p>Soon after the first day session began, veteran CPI(M) MLA Tapan Chakraborty asked the speaker about their adjournment motion, which had to be placed before the speaker. When, speaker Ratan Chakraborty in his reply said that there was no need for the motion in the House as opposition members will be allowed to raise the respective issues in an appropriate time during the two days session.\nAll CPI (M) members staged a protest after the denial from the speaker and all of them rushed to the well of the House demanding that their motion should be accepted by the speaker. After their walkout from the House during question hour, Opposition leader Manik Sarkar addressing a press conference at the official chamber of opposition leader in the assembly alleged that the speaker intentionally suppressed their motion on behalf of the treasury bench.</p><p>Sarkar narrating the incidents of police atrocities on student and youth activities on September 15 last during their deputation towards Chief Minister and attack on CPI(M) supporters in Hapania on September22 and subsequent attacks on the houses and shops of their supporters in the same night, said that the role of speaker is not impartial and he continuously giving more attention to treasury bench.\nCriticizing the functioning of BJP-IPFT coalition government, Sarkar said that BJP are continuing their violence politics to win the next assembly elections, but they should remember that united resistance of common people will not continue their violent politics. Sarkar also described Thursday's incident as the ‘beginning of the end’ of BJP in Tripura. Later, in the second session of the House, the opposition bench returned in the assembly proceedings and participated in the private members resolutions.</p>"
            },
            {
                "id":"2",
                "name":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed",
                "url":"/news?id=2",
                "urlToImage":"News3.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
            },
            {
                "id":"5",
                "name":"Three missing minor girls rescued",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Three missing minor girls rescued",
                "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
                "url":"/news?id=6",
                "urlToImage":"News6.JPG",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
            },
            {
                "id":"8",
                "name":"Snatcher gang busted in city, five arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Snatcher gang busted in city, five arrested",
                "description":"Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.",
                "url":"/news?id=8",
                "urlToImage":"news8.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>Agartala, September 29, 2022: Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.</p><p>The city police have arrested three snatchers involved with looting of cash among from a senior citizen after his withdrawal the amount from Punjab National Bank (PNB) branch located at Kaman Choumohani and escaped from the spot.</p><p>Giving details SDPO (Sadar) Ajay Kumar Das accompanied by OC of East Agartala police station Rana Chatterjee said that they have also arrested two thieves involved with many stolen incidents.</p><p>Das said that on Tuesday afternoon, when a senior citizen had withdraw an amount of Rs. 50, 000 from the Kaman Choumohani branch of PNB and when the man tried to purchase some medicines from a nearby medical store, three snatchers arrived at the spot and snatched the entire amount of Rs. 50,000.</p><p>Later, the victim old man registered a case at East Agartala police station under section 382 (B) of IPC and the police team started massive investigation to identify these snatchers and subsequently police team managed to arrest all three snatchers identified as Sukumar Das, Litan Bhuiya and Anjan Sarkar.</p><p>All these three snatchers were members of a active snatching gang working across the Agartala city and specially before the Durga Puja festival, they are very much active in the city, said Das and added that these miscreants had also committed many stolen incidents taking pre-puja rush in the city.</p><p>He claimed that police busted the snatcher gang involved in the city and the arrested trio has been produced before a local court with police remand appeals to interrogate them for arrest of other gang members.</p><p>Police has also arrested two thieves identified as Raju Chakma of Pecharthal and Bishal Dey, who are habitual drug addicts and involved with many stolen incidents held in Agartala city in recent past, specially they were involved with theft of LPG cylinders and copper wires.</p>"
            }
          
        ],
        "trending":[
            {
        
                "id":"4",
                "name":"Kingpins of dacoity incident arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Kingpins of dacoity incident arrested",
                "description":"After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night",
                "url":"/news?id=5",
                "urlToImage":"News5.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last, the investigation  team through scientific investigation and using technical aid, arrested prime accused person of the incident identified as Safar Ali (41), son of Bahar Miah of Loknath Para, Aralia under East Agartala police station.</p><p>Based on the interrogation statements of arrest dacoit Safar Ali,  police have also managed to arrest another kingpin of the dreaded dacoity incident of Baldakhal robbery case namely Ashim Das from Bagbari under Lefunga police station last night. He was forwarded before a local court and police got 5 days remand. He was also arrested earlier in two more property offence cases under East Agartala and R K Pur police stations.</p><p>Police added that a massive scientific investigation is going on to arrest other culprits involved in two dacoity incidents held at Champamura area of East Aralia and Baldakhal area on August 21 and 23rd night respectively. They added that the investigations are continuous raids in different locations to arrest associates of the two arrested dacoits involved in many stolen cases.</p><p>It may be recalled here that though city police claimed that during last fortnight the incidents stolen has been reduced across the city, but on Saturday evening two major robbery incidents were held at East Aralia and Chandrapur areas under East Agartala police station. Despite police assurance of increases in night patrolling and police surveillance, just a few days before the festivities of Durga Puja, still major parts of Agartala city remain unguarded in night time.</p>"
            },
            {
                "id":"5",
                "name":"Three missing minor girls rescued",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Three missing minor girls rescued",
                "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
                "url":"/news?id=6",
                "urlToImage":"News6.JPG",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
            },
            {
                "id":"6",
                "name":"Pharmacists plays important role in health services, CM",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Pharmacists plays important role in health services, CM",
                "description":"The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha",
                "url":"/news?id=7",
                "urlToImage":"News7.JPG",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha.</p><p>Chief Minister Dr Manik Saha delivering his speech during the celebration of the 12th World Pharmacist Day at the Regional Institute of Pharmaceutical Science and Technology (RIPSAT) campus in Abhoynagar area of Agartala on Sunday said that the World Pharmacist Day 2022 theme is 'Pharmacy united in action for a healthier world.' The theme aims to emphasize the united effort of global pharmacists to improve the healthcare sector.</p><p>He said that it is a moment for pride for the people of the state that hundreds of students from other states of the country are now pursuing the education in the RIPSAT, but earlier the students of Tripura had to study in other states for their pharmacy education.</p><p>He assured the RIPSAT authorities all the vacant posts for the faculty members of the institute will be filled up.</p><p>During the celebration of day, Chief Minister has also inaugurated a voluntary blood donation camp and during the programme, the secretary of Health and Family Welfare Dr Debasish Basu, director of medical education Dr Chinmoy Biswas and director of Health department Dr Subhasish Debbarma along with authorities of Pharmacy college were also present. (OVER)</p>"
            }
        ],
        "latest":[
            {
            
                "id":"0",
                "name":"Opposition stage walkout over adjournment motion",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Opposition stage walkout over adjournment motion",
                "description":"Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday",
                "url":"/news?id=1",
                "urlToImage":"News1.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania.</p><p>Soon after the first day session began, veteran CPI(M) MLA Tapan Chakraborty asked the speaker about their adjournment motion, which had to be placed before the speaker. When, speaker Ratan Chakraborty in his reply said that there was no need for the motion in the House as opposition members will be allowed to raise the respective issues in an appropriate time during the two days session.\nAll CPI (M) members staged a protest after the denial from the speaker and all of them rushed to the well of the House demanding that their motion should be accepted by the speaker. After their walkout from the House during question hour, Opposition leader Manik Sarkar addressing a press conference at the official chamber of opposition leader in the assembly alleged that the speaker intentionally suppressed their motion on behalf of the treasury bench.</p><p>Sarkar narrating the incidents of police atrocities on student and youth activities on September 15 last during their deputation towards Chief Minister and attack on CPI(M) supporters in Hapania on September22 and subsequent attacks on the houses and shops of their supporters in the same night, said that the role of speaker is not impartial and he continuously giving more attention to treasury bench.\nCriticizing the functioning of BJP-IPFT coalition government, Sarkar said that BJP are continuing their violence politics to win the next assembly elections, but they should remember that united resistance of common people will not continue their violent politics. Sarkar also described Thursday's incident as the ‘beginning of the end’ of BJP in Tripura. Later, in the second session of the House, the opposition bench returned in the assembly proceedings and participated in the private members resolutions.</p>"
            },
            {
                "id":"1",
                "name":"Govt to recruit all TET qualified candidates at a time",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Govt to recruit all TET qualified candidates at a time",
                "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                "url":"/news?id=2",
                "urlToImage":"News2.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
            },
            {
                "id":"2",
                "name":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                "url":"/news?id=2",
                "urlToImage":"News3.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
            }
        ],    
        "all":[
                {
                    "id":"0",
                    "name":"Opposition stage walkout over adjournment motion",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Opposition stage walkout over adjournment motion",
                    "description":"Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday",
                    "url":"/news?id=1",
                    "urlToImage":"News1.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania.</p><p>Soon after the first day session began, veteran CPI(M) MLA Tapan Chakraborty asked the speaker about their adjournment motion, which had to be placed before the speaker. When, speaker Ratan Chakraborty in his reply said that there was no need for the motion in the House as opposition members will be allowed to raise the respective issues in an appropriate time during the two days session.\nAll CPI (M) members staged a protest after the denial from the speaker and all of them rushed to the well of the House demanding that their motion should be accepted by the speaker. After their walkout from the House during question hour, Opposition leader Manik Sarkar addressing a press conference at the official chamber of opposition leader in the assembly alleged that the speaker intentionally suppressed their motion on behalf of the treasury bench.</p><p>Sarkar narrating the incidents of police atrocities on student and youth activities on September 15 last during their deputation towards Chief Minister and attack on CPI(M) supporters in Hapania on September22 and subsequent attacks on the houses and shops of their supporters in the same night, said that the role of speaker is not impartial and he continuously giving more attention to treasury bench.\nCriticizing the functioning of BJP-IPFT coalition government, Sarkar said that BJP are continuing their violence politics to win the next assembly elections, but they should remember that united resistance of common people will not continue their violent politics. Sarkar also described Thursday's incident as the ‘beginning of the end’ of BJP in Tripura. Later, in the second session of the House, the opposition bench returned in the assembly proceedings and participated in the private members resolutions.</p>"
                },
                {
                    "id":"1",
                    "name":"Govt to recruit all TET qualified candidates at a time",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Govt to recruit all TET qualified candidates at a time",
                    "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                    "url":"/news?id=2",
                    "urlToImage":"News2.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
                },
                {
                    "id":"2",
                    "name":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                    "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                    "url":"/news?id=2",
                    "urlToImage":"News3.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
                },
                {
                    "id":"13",
                    "name":"Massive preparations for grand celebration of “Mayer Goman”",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Massive preparations for grand celebration of “Mayer Goman”",
                    "description":"In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event",
                    "url":"/news?id=4",
                    "urlToImage":"News4.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event, said ICA Minister Sushanta Chowdhury.</p><p>Speaking at the review meeting held with concern officials and club authorities of Agartala, Minister with his appeals to clubs to participate in the immersion carnival “Mayer Goman” on October 7th next said that this for the first time ICA department has been organizing such grand event and department will also give special prizes to Puja organizers.</p><p>Giving details on the preparation for the great immersion carnival festival of Goddess Durga, Chowdhury said that the department has also taken preparation that people from outside Agartala can witness the festival and the department will give prizes to clubs, who will participate in the “Mayer Goman” carnival. Among the participating clubs, first prize will be awarded with Rs. 50,000, second prize with Rs. 30,000 and third prize winner club will get Rs. 20,000.</p><p>He said that the “Mayer Goman” festival will be organized in front of Agartala city centre and a detailed road map will also be finalized to make the celebration a grand event.</p><p>Speaking in the review meeting, Mayor Dipak Majumder of Agartala Municipal Corporation (AMC) said that AMC has taken a massive cleaning drive before the ensuing festivities of Durga Puja and has taken different pro-people measures for smooth celebration of the festivities.</p><p>He said that AMC has also prepared a detailed plan for smooth celebration of festivities and hoped that this time people of the state as well as devotees from different areas will witness a hassle puja celebration across Agartala.</p><p>He said that several teams will be formed under the leadership of AMC councilors and government authorities to finalize all pre-puja preparation works across the city and special measures would be taken for immersion processions and immersion of Goddess at ‘Dashamighat’ and other seven immersion spots of the city and AMC would repair and will made necessary constructions if needed, said Mayor. Mayor also said that AMC will give awards to community puja organizers based on their celebration of puja by maintaining the environment and its protection.</p><p>Director of ICA department Ratan Biswas said that the department will award the community puja organizers of Agartala and its adjoining areas based on six themes.</p><p>During the review meeting, secretary of ICA Dr P K Chakraborty, TTDC’s chairman Santosh Saha, editor of North East Colors Sanjib Deb, president of Agartala club forum Pranab Sarkar, SP (Security) Bijoy Debbarma and other dignitaries were also present. (OVER)</p>"
                },
                {
                    "id":"4",
                    "name":"Kingpins of dacoity incident arrested",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Kingpins of dacoity incident arrested",
                    "description":"After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last",
                    "url":"/news?id=5",
                    "urlToImage":"News5.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last, the investigation  team through scientific investigation and using technical aid, arrested prime accused person of the incident identified as Safar Ali (41), son of Bahar Miah of Loknath Para, Aralia under East Agartala police station.</p><p>Based on the interrogation statements of arrest dacoit Safar Ali,  police have also managed to arrest another kingpin of the dreaded dacoity incident of Baldakhal robbery case namely Ashim Das from Bagbari under Lefunga police station last night. He was forwarded before a local court and police got 5 days remand. He was also arrested earlier in two more property offence cases under East Agartala and R K Pur police stations.</p><p>Police added that a massive scientific investigation is going on to arrest other culprits involved in two dacoity incidents held at Champamura area of East Aralia and Baldakhal area on August 21 and 23rd night respectively. They added that the investigations are continuous raids in different locations to arrest associates of the two arrested dacoits involved in many stolen cases.</p><p>It may be recalled here that though city police claimed that during last fortnight the incidents stolen has been reduced across the city, but on Saturday evening two major robbery incidents were held at East Aralia and Chandrapur areas under East Agartala police station. Despite police assurance of increases in night patrolling and police surveillance, just a few days before the festivities of Durga Puja, still major parts of Agartala city remain unguarded in night time. (OVER)</p>"
                },
                {
                    "id":"5",
                    "name":"Three missing minor girls rescued",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Three missing minor girls rescued",
                    "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
                    "url":"/news?id=6",
                    "urlToImage":"News6.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
                },
                {
                    "id":"6",
                    "name":"Pharmacists plays important role in health services, CM",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Pharmacists plays important role in health services, CM",
                    "description":"The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha",
                    "url":"/news?id=7",
                    "urlToImage":"News7.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha.</p><p>Chief Minister Dr Manik Saha delivering his speech during the celebration of the 12th World Pharmacist Day at the Regional Institute of Pharmaceutical Science and Technology (RIPSAT) campus in Abhoynagar area of Agartala on Sunday said that the World Pharmacist Day 2022 theme is 'Pharmacy united in action for a healthier world.' The theme aims to emphasize the united effort of global pharmacists to improve the healthcare sector.</p><p>He said that it is a moment for pride for the people of the state that hundreds of students from other states of the country are now pursuing the education in the RIPSAT, but earlier the students of Tripura had to study in other states for their pharmacy education.</p><p>He assured the RIPSAT authorities all the vacant posts for the faculty members of the institute will be filled up.</p><p>During the celebration of day, Chief Minister has also inaugurated a voluntary blood donation camp and during the programme, the secretary of Health and Family Welfare Dr Debasish Basu, director of medical education Dr Chinmoy Biswas and director of Health department Dr Subhasish Debbarma along with authorities of Pharmacy college were also present. (OVER)</p>"
                },
               {
                "id":"8",
                "name":"Snatcher gang busted in city, five arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Snatcher gang busted in city, five arrested",
                "description":"Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.",
                "url":"/news?id=8",
                "urlToImage":"news8.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>Agartala, September 29, 2022: Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.</p><p>The city police have arrested three snatchers involved with looting of cash among from a senior citizen after his withdrawal the amount from Punjab National Bank (PNB) branch located at Kaman Choumohani and escaped from the spot.</p><p>Giving details SDPO (Sadar) Ajay Kumar Das accompanied by OC of East Agartala police station Rana Chatterjee said that they have also arrested two thieves involved with many stolen incidents.</p><p>Das said that on Tuesday afternoon, when a senior citizen had withdraw an amount of Rs. 50, 000 from the Kaman Choumohani branch of PNB and when the man tried to purchase some medicines from a nearby medical store, three snatchers arrived at the spot and snatched the entire amount of Rs. 50,000.</p><p>Later, the victim old man registered a case at East Agartala police station under section 382 (B) of IPC and the police team started massive investigation to identify these snatchers and subsequently police team managed to arrest all three snatchers identified as Sukumar Das, Litan Bhuiya and Anjan Sarkar.</p><p>All these three snatchers were members of a active snatching gang working across the Agartala city and specially before the Durga Puja festival, they are very much active in the city, said Das and added that these miscreants had also committed many stolen incidents taking pre-puja rush in the city.</p><p>He claimed that police busted the snatcher gang involved in the city and the arrested trio has been produced before a local court with police remand appeals to interrogate them for arrest of other gang members.</p><p>Police has also arrested two thieves identified as Raju Chakma of Pecharthal and Bishal Dey, who are habitual drug addicts and involved with many stolen incidents held in Agartala city in recent past, specially they were involved with theft of LPG cylinders and copper wires.</p>"
            },
            {
                "id":"9",
                "name":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "description":"As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them",
                "url":"/news?id=9",
                "urlToImage":"news9.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them.</p><p>As promised in the state assembly the Chief Minister Dr Manik Saha had invited the representatives of the retrenched teachers for a discussion in his official chamber here at Civil Secretariat on Wednesday morning over the claims of retrenched teachers in presence Advocate General Siddhartha Sankar Dey and Law Secretary Biswajit Palit.</p><p>Sources said that after getting appointment and invitation from Chief Minister Office (CMO), a delegation of six members of retrenched teachers led by Bijay Krishna Saha explained how according to the High Court judgment of 2014 (Para-127) only teachers whose jobs had been challenged on the ground of recruitment rules-not more than 58-had been terminated and the same order has also been uphold by the Supreme Court in its order dated March 29th, 2017 last.</p><p>But, recently in a reply to RTI queries the Supreme Court has clarified that no teacher except the 462 notified had been parties to the case and their claims to reinstatement is justified as they had been illegally terminated en masse without any individual notice by the previous government.</p><p>After hearing the claims made by retrenched teachers, The Chief Minister had collected all the documents substantially proving their claims and Dr Saha said that he was not fully aware of all such developments over the cases of teachers, said Bijay Krishna Saha.</p><p>Saha speaking with media persons after their meeting with the Chief Minister said that CM has compassionately heard their grievance and assured that he will meet them again after Durga Puja celebration. Chief Minister also asked the agitated teachers for all relevant documents in support of their claims and assured that government will take all possible steps to rehabilitate them as per law.</p><p>Chief Minister also said that the Law department will analyze and verify all the submitted documents and after consultation with the Advocate General and Law Secretary of the state government, he will meet them again.</p><p>Bijay Krishna Saha and other retrenched teachers also added that the Chief Minister repeatedly told them within the framework of law, the present government wanted to rehabilitate and will take all necessary steps if the law and orders of Courts permit the state government.</p><p>He also directed the concerned law officials to examine the claims of teachers and to give suggestions to the state government to protect their livelihood.</p><p>The leaders of retrenched teachers have also expressed their satisfaction after meeting with the Chief Minister and added that they are now seeing a ray of hope to protect their livelihood and their families.</p><p>It may be recalled here that leader of the Opposition Manik Sarkar and the lone Congress MLA Sudip Roy Barman condemned the police action held on September 26 during ‘assembly march’ by retrenched teachers and urged the Chief Minister to meet the agitating teachers. Accordingly, their representatives called on Dr Saha on Wednesday.</p>"
            },
            {
                "id":"10",
                "name":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "description":"The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers",
                "url":"/news?id=10",
                "urlToImage":"News10.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers.</p><p>Those who are not coming under the bracket of government also don’t have to reason to dishearten as another 30,000 people are coming under the social pension scheme. The cabinet decided all these in a meeting held on Thursday night.</p><p>The Information and Cultural Affairs (ICA) Minister on Friday afternoon  informed in a press conference, while Education Minister Ratan Lal Nath said that the government kept its commitment and urged people to enjoy the Durga Puja with a smiling face.</p><p>Chowdhury said that a total of 3, 18,415 social pensioners will get new wages of Rs.2000 per month from October 1 and they will receive the same amount in their respective bank accounts. The cabinet has also decided to give social pension to more than 30,000 beneficiaries and for that the government will spend Rs. 6 crore per month in addition.</p><p>He said that Thursday’s cabinet has also decided to appoint 6,067 Special Executive under Home Department on contract basis and they will be appointed in the service through SPs of the districts. He said that interested people from the age group of 21 to 45 years can apply for the post in their respective police stations and the recruitment process will be completed in the next one month.</p><p>The cabinet has also decided to hike the salaries of 9,931 Anganwadi workers and helpers at the rate of 15% , similarly the honorarium of ASHA workers will also get a hike of 15%, said Chowdhury. The cabinet has decided that 17 Professors will also be appointed on contract basis for Veterinary college and has also created 374 new posts under the Rural Development department, said the Minister.</p><p>Meanwhile, Education Minister Ratan Lal Nath addressing another press conference said that on September 27 and September 30, offer letters for 514 TET qualified teachers had been released by the Education department.</p><p>He said that the cabinet has decided to release offer letters for 3,108 Teacher Eligibility Test (TET) qualified candidates will be released and in addition of 514 offer letters, altogether 3,622 TET qualified candidates are getting their appointment as government teachers.</p>"
            },
            {
                "id":"11",
                "name":"85 TPS Gr-I, II officers transferred",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"85 TPS Gr-I, II officers transferred",
                "description":"In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police",
                "url":"/news?id=11",
                "urlToImage":"News11.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>Agartala, October 1, 2022: In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police.</p><p>The General Administration (Personnel and Training) department of the state government through notification issued on Thursday said that among the transferred officer only TPS Grade-I officer Nila Kumar Jamatia has been transferred as deputy commandant of 6th TSR battalion and rest 84 TPS Grade-II officers are mostly new promote officers, who are promoted from police inspectors to Dy.SP rank officers and were posted in different wings of state police including in TSR battalions.</p>"
            },
            {
                "id":"12",
                "name":"CM inaugurates 5 smart city projects",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM inaugurates 5 smart city projects",
                "description":"In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday",
                "url":"/news?id=12",
                "urlToImage":"News12.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday.</p><p>During an inauguration programme held at Old Motor Stand area of the city  on Friday under Agartala Smart City Mission and Agartala Municipal Corporation (AMC) , Dr Said said that based on the requirement and demands of people, the present state government is taking projects for the welfare of people  and these are now reflecting.</p><p>He said that welfare schemes of the government are now reaching every corner of the state.</p><p>Highlighting the launching of state level special campaign “Prati Ghore Susashan” (good governance at every household)   to ensure benefits  of various state and central schemes for the people of the state during the celebration of 72th birthday of Prime Minister Narendra Modi on September 17 last, the Chief Minister said that two-and-a-half-month long campaign on good governance will reach every household.</p><p>He also said that as per the decision taken by the state cabinet, above 6000 government jobs will be given in coming days and the government has also hiked the salaries of Anganwadi and ASHA workers at the rate of 15 %.</p><p>During the programme, AMC mayor Dipak Majumder and AMC commissioner Dr Shailesh Yadav, deputy mayor Manika Das Datta and MLA Dr Dilip Das were also present.</p>"
            },
            {
                "id":"14",
                "name":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "description":"Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.",
                "url":"/news?id=14",
                "urlToImage":"News14.JPG",
                "publishedAt":"Agartala, October 2, 2022",
                "content":"<p>Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>Hundreds of auto rickshaw workers and activists under the banner of CITU on Sunday morning staged their protest in front on CNG stations demanding roll back of the decision. The workers also blocked roads.The abnormal hike of prices of CNG across the state has affect the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.<p></p>On Saturday, TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 2nd.</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p>"
            },
            {
                "id":"15",
                "name":"ECI gears up for 2023 assembly polls in Tripura, dispatches new EVMs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"ECI gears up for 2023 assembly polls in Tripura, dispatches new EVMs",
                "description":"The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.",
                "url":"/news?id=15",
                "urlToImage":"ECI2.jpg",
                "publishedAt":"Agartala, October 4, 2022",
                "content":"<p>The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.</p><p>The elections to Tripura, Meghalaya, and Nagaland are expected to be held in February next year after the Assembly polls in Gujarat and Himachal Pradesh.</p><pAn official of the State Election department said that  on Monday the ECI had sent 4800 Electronic Voting Machines (EVMs), manufactured by the Hyderabad-based Electronic Corporation of India Ltd, in 15 big containers.</p><p>In presence of the representatives of the different political parties, the Election department has stored these EVMs here at the strong rooms of Umakanta Academy  with adequate security measures and these EVMs would be shifted to all the subdivisions of the state.</p><p>The official said that the National level Master Trainers (NLMT) appointed by the Election Commission last week have given training to all the eight District Magistrates and Additional District Magistrates on every important matter for the proper management of the election.</p>"
            },
            {
                "id":"16",
                "name":"Durga puja passed off peacefully barring some stray incidents",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Durga puja passed off peacefully barring some stray incidents",
                "description":"The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala",
                "url":"/news?id=16",
                "urlToImage":"News16.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala and many other parts of the state on the day of ‘Maha Saptami’ and ‘Maha Nabami’ and  barring some stray incidents of suspected murder and road mishaps  in separate places of the state during last four days.</p<p>The incessant rain on the night of ‘Maha Saptami’ across Agartala and other parts of Tripura, dampens the festival spirit . Resulting in, the majority of low-lying areas of the city getting inundated and road traffic was also badly affected.</p<p>While, irrespective of castes and creeds, a huge number of people thronged puja pandals during the festival days and immersion of Goddess is still going on Thursday also in different places of the state including capital city Agartala.</p<p>No untoward incident was reported from the capital town that alone hosts over 500 puja, said police on Thursday.</p<p>Meanwhile, the great immersion carnival festival “Mayer Goman”, which will be held on October 7 by participation of all major community Durga Puja organizers , the Information and Cultural Affairs (ICA) department is not leaving any stone unturned to make it a historic event for the state’s people.</p<p>Official sources said that all major clubs of the city will participate in the  immersion carnival “Mayer Goman” on October 7th and the government is now making big structures in front of Agartala City Centre for the event.</p<p>Though, four days of Durga Puja passes off peacefully, reports said that few person sustained injuries in several road mishaps due to reckless driving and a minor inmate of a drug rehabilitation centre in Madhupur area under Sepahijala district alleged beaten to death by the authorities of drug rehab centre and victim family has also filed a specific FIR against accused person.</p<p>Despite many apprehensions for bad weather conditions  , people in large numbers were seen visiting pandals in groups braving incessant rains.</p>"
            },
            {
                "id":"17",
                "name":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "description":"During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event.",
                "url":"/news?id=16",
                "urlToImage":"N1.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event. The event which was being held at ONGC premises after three years due to the pandemic-induced disruption made a rousing return as it witnessed massive public participation in thousands and was also widely covered by local media, as people thronged the ONGC KV Ground on the final day of Durga Puja Bijoya Dashami and the Navaratri festival.</p><p>Deputy Chief Minister Dev Varma was welcomed at the KV Ground by Asset Manager Tarun Malik and other senior officers of the Tripura Asset.</p><p>Speaking on the occasion, Jishnu Dev Varma said that the day marks not just the “victory of truth over untruth and ‘Dharma’ over ‘Adharma’ but is also a celebration of motherland and nationalism.” To have the epic tale of Ramayana staged symbolically at such a massive scale and with such huge public participation is also a reflection of how hope always triumphs eventually, he said in reference to the extreme uncertainty and difficulties posed by the pandemic to the people at large. He congratulated ONGC for making this event an important part of Tripura’s local life during this time of the year, and said, ‘none other than ONGC can pull of something like this at such a grand scale, not merely because it has the resources but also for the love that exists between ONGC and the people of Tripura’.</p><p>He also acknowledged the critical role the Maharatna major has played over the years in providing employment to Tripura’s youth as well as generating many business and livelihood opportunities for the local entrepreneurs and individuals. ONGC has transformed countless lives all over the country by providing the energy that obliterates darkness, celebrates light and ushers in prosperity and it rightfully deserves the dignity and honour that is accorded to it today, he said.</p><p>Asset Manager Tarun Malik while welcoming the Deputy CM was admired not only for his deft and expert handling of many important portfolios in the state but also for his scholarly knowledge on various subjects and issues of critical importance. “At a time when many of us today don’t have the patience to sit through even a few pages of reading, he is a true scholar and thinker in our midst and continues to inspire us with his meaningful words and advice”, he said. He also thanked the Dy CM for taking time out of his busy schedule in a festive period such as Durga Puja and said that would motivate ONGCians of Tripura immensely in their pursuit of energy security for this beautiful state and the country at large.</p><p>To mark the special occasion, a short yet entertaining and engaging Ram-Leela play-drama was also enacted by the young children of ONGC Tripura Asset, for the very first time.</p>"
            },
            {
                "id":"18",
                "name":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "description":"The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.",
                "url":"/news?id=17",
                "urlToImage":"N2.JPG",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.</p><p>On July 2nd night, two youths were murdered in a drug rehabilitation centre located at Nandan Nagar area under Budhjungnagar police station and the prime accused in the double murder case was the owner of drug rehab centre, who had committed the crime  in association of other inmates of the center. Day after the incident, police recovered two bodies from a jungle at Durga Chowdhury Para under the same police with multiple injuries and with hands tied behind their bodies.</p><p>While, on the day of “Bijoya Dashami”, one more drug rehab centre located at Madhupur area under Sepahijala district has been accused for their direct involvement for a brutal murder of an inmate of the rehab centre.</p><p>Police sources said that on September 25th last one Gafur Miah of Naljala village under Bishramganj police station handed over his addicted son Ismail Miah (18) to a drug rehabilitation centre named as “Hamkrai Naikol Bodol” in Madhupur area of the same district.</p><p>But, on the ‘Dashami’ day, Gafur Miah was called off by a authority of rehab centre that his son had suffered injuries as he slipped on the floor. Immediately, Gafur Miah along with his few relatives rushed to the spot and found his son dead with multiple injuries. They immediately shifted his Madhupur Primary health centre and informed the matter to police. They alleged that persons running the rehab center lynched their son and brutally killed him.</p><p>Police also rushed to the spot and conducted autopsy of the body in presence of a magistrate and has also registered the FIR against drug rehab authorities.</p><p>Police sources added that the primary autopsy report reveals that the victim boy had several injuries in his entire body and leg was severely broken and his penis was compressed probably for thrashing him.</p><p>Police also said that based on the complaint of the victim's family, they started an investigation and will take all legal steps against the accused persons</p>"
            }
        ]
    }
}