{
    "totalResults":"8",
    "news":
    {
        "global":[  
            {
                "id":"G141020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"CM inaugurates newly built Vigyan Bhawan of Ramkrishna College in Kailasahar",
                "description":" The state government is determined towards infrastructural development of each and every college in the state. 21 colleges among 22 colleges of the state have been recognized by NAAC recently. Online admission has been started to bring transparency in the admission process of students in colleges, enunciated Chief Minister",
                "imageName":"G141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>The state government is determined towards infrastructural development of each and every college in the state. 21 colleges among 22 colleges of the state have been recognized by NAAC recently. Online admission has been started to bring transparency in the admission process of students in colleges, enunciated Chief Minister</p><p>Dr Manik Saha after inaugurating the newly built Vigyan Bhawan of Ramkrishna College in Kailasahar today. The two-storied Vigyan Bhawan consisting of 25 rooms was built at the cost of 9 crore 17 lakh 70 thousand rupees.</p><p>The Chief Minister said the college was established in 1950. Tapas Chaitanya Maharaj was its founder. Dr. Sachidanand Dhar was the first professor of the college. The college was brought under the state government in 1982. Presently, there are 2,882 students studying in the college. 19 courses are being taught in the college at present. Students are getting the opportunity to do Honours on 16 courses.</p><p>The Chief Minister said, integrated courses in Chemistry and Commerce branch have been started in the state. Students are getting loans under Mukhyamantri B.Ed Anuprerna Yojana. 991 students have been provided with loans recently for their higher education. The state government is working so that the students would not have to shift to colleges outside the state for higher studies. The Chief Minister said, initiative has been taken to build a medical college at Ambassa. He said, sports have to be given equal importance as academic studies. Respect must be paid to the teachers. The Chief Minister called upon everyone to complete all tasks within bounded time for the sake of development of the state. As a part of Prati Ghare Sushason campaign, the Chief Minister handed over land pattas to five tea garden workers of Hichacherra tea garden and a cheque of 2 lakh rupees to the representatives of Nivedita Self-Help Group in the programme.</p><p>The programme was presided over by Sabhadhipati of Unakoti Zilla Parishad Amalendu Das. Welcome speech was delivered by Director of Higher Education department N. C Sharma. Social Welfare & Social Education Minister Santana Chakma, Labour Minister Bhagaban Chandra Das, MLA Sudhangshu Das, Sahakari Sabhadhipati of Unakoti Zilla Parishad Shyamal Das, Chairperson of Kailasahar Municipal Council Chapala Debroy, Vice Chairperson Nitish Dey, TIDC Chairman Tinku Roy, Unakoti DM & Collector Uttam Kumar Chakma, SDPO Kanta Jangir and Principal In-charge of Ramkrishna College Dr. Pinaki Pal were present in the programme.</p><p>The Chief Minister officially inaugurated the Vigyan Bhawan by unveiling the plank of the Vigyan Bhawan and cutting the ribbon. Then he looked around the Vigyan Bhawan and planted a tree sapling in the campus.</p>"
            },           
            {
                "id":"G131020221",               
                "category":"NEH Report",
                "shortTitle":"Headline Today",   
                "author":"Our Correspondent",
                "title":"President flags off two trains connecting Agartala with Guwahati, Manipur and Kolkata",
                "description":"President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.",
                "imageName":"G131020221.jpg",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.</p><p> On Thursday morning in a bid to further strengthen connectivity and boosting prosperity in the North Eastern region, the extended services of passenger train Agartala – Jiribam - Agartala Jan Shatabdi Express up to Khongsang in Manipur  and Guwahati – Kolkata - Guwahati Express up to Agartala has been flagged off by the President from Agartala station in presence of Chief Minister Dr Manik Saha, deputy chief minister Jishnu Dev Varma, union minister of state Pratima Bhowmik, Transport Minister Pranajit Singha Roy and Anshul Gupta, General Manager of Northeast Frontier Railway (NFR) along with other dignitaries was present.</p><p>The Agartala – Jiribam - Agartala Jan Shatabdi Express, which was the first direct train service connecting Tripura and Manipur has now been extended up to Khongsang in Manipur, which is a stretch of about 55 km. The train will run on Monday, Wednesday and Friday between Agartala and Khongsang. Khongsang station has been constructed as part of the ongoing Jiribam – Imphal new line project.</p><p>NFR said that this will be the first train service for this newly constructed station. People of a vast area of Manipur will be able to travel by train for the first time for their medical, educational and other needs. Train journey travel time will be less than half, as the journey time will be around 07 hrs covering a distance of 300 Km against about 15 hrs or so by road. The Jan Shatabdi Express will be having new Linke Hofmann Busch coaches with latest amenities for passengers. Moreover, a Vistadome coach has also been added in this train.  The entire route passes through very scenic hilly areas. This can be visualized by the passengers,tourists through the Vistadome coach. This train will connect people of three Northeast states Tripura, Manipur and Assam boosting economic activities.</p><p>The Guwahati – Kolkata - Guwahati Express which used to run between Kolkata and Guwahati, has now been extended up to Agartala once a week. The train will run on Wednesday between Agartala and Kolkata. This service will connect the capital of Tripura to Guwahati and other states. This train service will benefit people travelling between Agartala and Kolkata via Guwahati.</p><p>After flagging off both trains, President left the capital city through Air Force choppers towards Udaipur and visited Mata Tripura Sundari temple along with daughter, Chief Minister, Tourism Minister and local MLA Biplab Kumar Ghosh.</p><p>After arriving in the Agartala airport on Thursday afternoon through choppers, the  President Droupadi Murmu has left the state capital towards Guwahati after her two-day visit to the state . Governor Satyadeo Narain Arya and Chief Minister Prof. (Dr.) Manik Saha along with Chief Secretary J K Sinha,  DGP Amitabh Ranjan, West Tripura District Magistrate (DM) Debapriya Bardhan and Superintendent of Police of West Tripura district Shankar Debnath were also present in the airport.</p>"
            }          
        ], 
        "tripura":[
            {
                "id":"T141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Ruling ally IPFT MLA Dhananjay Tripura resigns from state assembly, will join Tipra-Motha",
                "description":"The murder mystery of a woman identified as Aparna Karmakar Ghosh (43), in which police recovered her body from a drain at tri-junction area of Kalyani and Water Supply road under East Agartala police station on October 12 afternoon, the Agartala city police has arrested prime accused and two other persons on suspicious ground.",
                "imageName":"T141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>The murder mystery of a woman identified as Aparna Karmakar Ghosh (43), in which police recovered her body from a drain at tri-junction area of Kalyani and Water Supply road under East Agartala police station on October 12 afternoon, the Agartala city police has arrested prime accused and two other persons on suspicious ground.</p><p>Giving details of the latest improvement of police investigation, SDPO(Sadar) Ajoy Kumar Das during a press briefing at East Agartala police station on Friday evening said that soon after the identity establishment of the deceased woman body as Aparna Karmakar Ghosh (43), wife of Dipak Kumar Ghosh of Chittaranjan area under same police station, her daughter Dwapanita Ghosh filed an FIR at East Agartala women police station with complaint that her mother might be raped and murder.</p><p>He said that police registering the case , started massive investigation and based on the circumstantial and scientific evidences, initially police detained two persons including the paramour of the deceased woman, who was a group-D government employee posted at MBB College library and another suspected accused persons. During interrogation of both detained persons, the police team getting no satisfactory answer from them, were arrested and police before a local court with police remand appeals. Later, the court sent them in police custody.</p><p>While analyzing the CCTV footage of the crime spot, police identified that a person was seen , who was moving with that deceased woman in Scotty. Analyzing the information, police identified that person as Satya Ranjan Ghosh of Devendra Chandra Nagar village of Lembucherra area of West Tripura district and in association with police personnel of Mohanpur subdivision, police on Friday morning managed to arrest him from his house.</p><p>SDPO Das said during interrogation suspected prime accused Satya Ranjan Ghosh revealed that when he returned to his house through Kalyani area from his friend's house on October 11 night, he spotted the deceased woman. After primary discussion, the woman wanted to drink wine and accused Satya Ranjan moved through his Scotty with that woman in city areas and returned back to the same spot.</p><p>Later, accused raped and dumped the woman in the drain water to ascertain her death, said SDPO Das.</p><p>He said that based on confessional statement made by prime accused police will produced him in a court citing police remand to unearth the entire murder scene.</p><p>It may be recalled here that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of the woman in the drain. Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of one e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she did not return.</p>"
            },
            {
                "id":"T141020222",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Prime accused of Aparna Karmakar rape and murder arrested",
                "description":" In another sudden political development and  yet another big blow to the regional Indigenous Peoples Front of Tripura (IPFT) , ruling alliance of BJP-IPFT Tripura government, IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Friday submitted  his resignation as MLA from the state assembly and joined the ‘Tipra Motha’ party.",
                "imageName":"T141020222.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>In another sudden political development and  yet another big blow to the regional Indigenous Peoples Front of Tripura (IPFT) , ruling alliance of BJP-IPFT Tripura government, IPFT MLA from Raima Valley constituency (Gandacherra) Dhananjay Tripura on Friday submitted  his resignation as MLA from the state assembly and joined the ‘Tipra Motha’ party.</p><p>Dhananjay Tripura along with Tipra-Motha’s supremo and royal scion Pradyot Kishore Debbarma appeared in the chamber of assembly speaker Ratan Chakraborty  and formally tendered his resignation personally as required.</p><p>Later, speaking with media persons, Assembly speaker Ratan Chakraborty said that his resignation has been accepted and soon a gazette notification will be issued by the state’s assembly.</p><p>After submitting his resignation, Pradyot Kishore speaking with media persons said that Dhananjoy Tripura and a few other leaders of different political parties, would join Tipra-Motha on Saturday.</p><p>Dhananjoy Tripura (32), who was elected from the Raima Valley Assembly constituency in Dhalai district in the 2018 assembly  polls, is the second IPFT MLA to quit the Assembly since last year.</p><p>IPFT MLA Brishaketu Debbarma also resigned from the Assembly in June last year and joined the TIPRA, reducing the party's (IPFT) strength to seven.</p><p>Dhananjoy Tripura is the sixth MLA of the BJP-IPFT ruling alliance who stepped down from the assembly. Earlier BJP MLAs Burba Mohan Tripura, Ashish Das, Sudip Roy Barman, and Ashish Kumar Saha also quit the party and the Assembly membership after open differences with then Chief Minister Biplab Kumar Deb, who resigned on May 14 following the instructions of the party's central leadership.</p><p>Ashish Das, later joined the Trinamool Congress (TMC) last year and May this year Sudip Roy Barman, also a former BJP Minister and Ashish Kumar Saha joined the Congress in February this year after submitting their resignation as MLAs.</p><p>Sudip Roy Barman was re-elected to the state assembly for the sixth time in the by-elections held  in June as a Congress candidate. Burba Mohan Tripura after his submission of resignation letter as MLA, joined Tipra-Motha.</p>"
            },
            {
                "id":"T131020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Body recovered from drain identified, one detain for suspected murder",
                "description":"The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.",
                "imageName":"T131020221.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of on e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she could not return.</p><p>On Wednesday amidst tight security across the Agartala city due to the maiden visit of President Droupadi Murmu, at about 2 PM some pedestrians noticed the floating body of Aparna Karmakar Ghosh in a drain in mysterious condition.</p><p>Soon after the recovery of body, the police led by SDPO (Sadar) started massive investigation to unearth the mystery of the death and within 24-hours, they established the identity of the victim woman and has also detained her paramour over suspicion of her murder.</p><p>While, police sources said that main accused of the murder is another man and police investigation and hunt to trace the main accused has been expedite and soon they will able to resolve the murder mystery, probably for a triangle love affairs.</p>"
            },
            {
                "id":"T131020222",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "description":"TJust few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government",
                "imageName":"T131020222.jpg",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>Just few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government.</p><p>Addressing a press conference here at CPI(M) headquarters on Thursday evening, CPI(M) state secretary Jitendra Chowdhury said that CPI(M) general secretary Sitaram Yechury along with opposition leader and party’s polit bureau member Manik Sarkar will address the mass gathering, where party workers and their supporters from different parts of the state will gather.</p><p>Chowdhury said that the proposed rally on October 21st is not the party’s election rally, but the rally will be organized to show their protest against four and half years 'misrule' of the present state government and a protest against the prevailing lawlessness situation of the state.</p><p>Castigating the functioning of the state government, Chowdhury alleged that since the formation of BJP government, the rights of common people and the opposition party are being suppressed by the ruling party through their continuous violence.</p><p>He said that from August 16 to September 30 last, the party has organized about 175 to 180 meetings, rallies and demonstrations across the state against the misrule of the state government and in support of basic demand of the state’s people, which received massive support from the cross section of the society.</p><p>He said that day by day the law and order situation of the state is deteriorating and appealed to the state’s people to strengthen their agitation against the government to restore democracy in the state.</p><p>Mentioning the high unemployment rate and political violence in terms of National Crime Record Bureau (NCRB) data, which make Tripura top among all Northeastern states, Chowdhury said that now Chief Minister of the state in recently held Northeast Council (NEC) meeting has admitted Tripura now turns into safe corridor of drug smuggling, which are destroying the young generation of the state.</p><p>He also alleged that during the past four and half years of rule, the BJP government failed to introduce any new project for the benefit of the state's people and claimed that the state government defamed President Droupadi Murmu by inaugurating old projects.</p>"
            }, 
            {
                "id":"T121020221",                          
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "description":"The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.",
                "imageName":"T121020221.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.</p><p>The President Droupadi Murmu in her maiden visit to Agartala arrived at the airport through a special flight and  was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After attending a series of programmes including inauguration of the National Law University (NLU) at Narsingarh and visiting the Durgabari tea estate in the West Tripura district's Mohanpur subdivision, and interacted with tea garden workers.</p><p>The President in another programme held at Rabindra Satabarshiki Bhavan inaugurates, lays foundation stones for various projects for strengthening the connectivity, education sector, Judicial Academy and Law University among the projects.</p><p>While, addressing the gathering the President said that development of the North Eastern region in getting new impetus with various new projects of Highway, Railway, Airway and Waterway after virtually inaugurated an MLA Hostel at Capital Complex, Agartala and laid foundation stones for Maharaja Birendra Kishore Manikya Museum and Cultural Centre; IIIT-Agartala; and various projects of government of Tripura related to roads, schools and hostels for students from Rabindra Satabarshiki Bhavan.</p><p>She said that projects inaugurated today will not only strengthen the connectivity, education, judiciary and legislature in Tripura, but also boost the rich culture of the state.</p><p>The President said that the youth of India have made a unique identity in the field of Information Technology, all over the world. She was confident that the permanent campus of Indian Institute of Information Technology, Agartala will set new benchmarks in the field of Information Technology.</p><p> The President said that a holistic education system is essential for the development of the nation and progress of the youth. ‘Along with higher education, we should give more emphasis on primary education,’ said President and added that she was happy to note that the Ministry of Development of North Eastern Region, in association with Tripura  government, has launched 'Vidya-Jyoti Mission 100' under which 100 existing higher secondary schools will be converted into quality education institutions with state-of-the-art facilities.</p><p>The President said that there is immense potential for development in the North-Eastern Region. Today, development of the Region is getting a new impetus with various new projects of highways, railways, airways and waterways.</p><p>The President said that India has become the 5th largest economy in the world. The North Eastern Region, including Tripura, will play an important role in making India a five trillion dollar economy by 2025. She expressed confidence that the aspirations, innovation and entrepreneurship of the talented and hardworking people, especially the youth of Tripura, will play an important role in achieving this goal.</p><p>While, attending Civic reception hosted by Agartala Municipal Corporation (AMC) here at Agartala Town Hall on Wednesday evening in presence of Chief Minister, Deputy Chief Minister, Urban Development Minister and Mayor of AMC, the President recalling great sacrifice and bravery of Elbert Ekka said that Tripura among the prosperous and proud state of the country, which has been known for producing least plastic waste.</p><p>The President thanked the people of Tripura for their warm welcome. She said that the composite culture of Tripura is the pride of India. The tribal community of Tripura has maintained a beautiful amalgamation of democracy and tradition.</p><p>The President said that living in harmony with nature is the specialty of tribal society. Most of the area of Tripura is rich in forest resources. In preserving this invaluable forest wealth, the natural lifestyle of the tribal society has played an important role.</p><p>Tripura was on the top place in achieving the target of ‘Responsible Consumption and Production’, included in the Sustainable Development Goal –12 during the year 2020-21, said Murmu and added that Tripura is one of the two states that generate the least plastic waste.</p><p>Tripura is a power-surplus state and it exports electricity to Bangladesh and the connectivity between Bangladesh and India has increased with the construction of ‘Maitri Setu’ over Feni River, said President and added that at the same time, it has become convenient for the entrepreneurs of Tripura to use the ports of Chittagong and Ashuganj.</p><p>From the very beginning, Tripura has played a major role in deepening India's friendship with Bangladesh, said Murmu and expressing happiness added that Tripura is making steady progress as an educational hub. She said that many institutions of higher and professional education are established in the state, where students from not only the North Eastern region but also from other parts of India and abroad come for education. She was also happy to note that Tripura has achieved the target of 100 percent enrollment at the level of elementary education.</p><p>Appreciating the artistic craft made by bamboo by thousands of bamboo artisans of the state, the President said that the government is taking holistic steps to improve the socio-economic  status of tribes including tea-garden workers.</p><p>Earlier, the President visited Albert Ekka War Memorial in Agartala and paid homage to brave soldiers who made the supreme sacrifice in the line of duty during the 1971 Bangladesh Liberation war.</p>"
            },           
            {
                "id":"T121020222",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Unidentified woman body recovered from drain in Agartala city",
                "description":"Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.",
                "imageName":"T121020222.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.</p><p>Soon after recovery of the body, panic triggered in that locality and police with a forensic team rushed to the spot to recover the body.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>While giving details SDPO(Sadar) Ajoy Kumar Das said that apparently there were no injury marks in the body and police cannot say anything in details till the finding of autopsy and forensic report.</p><p>He said that till night the identity of the deceased woman was yet to be established and even the local people were not able to identify the woman. Das added that police registering an unnatural death (UD) case started investigation to identify the woman and reason of her death and who the body has been found in the drain water.</p>"
            },
            {
                "id":"T121020223",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura ready to welcome President Droupadi Murmu",
                "description":"All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.",
                "imageName":"T121020223.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.</p><p>President Droupadi Murmu, will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state. On Wednesday morning at about 11.15 AM through a special flight President will arrive at Agartala airport and Tripura Police will welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Giving details of the tour programmes of the President, DM and SP of the West Tripura district Debapriya Burdhan and Sankar Debnath addressing a press conference on Tuesday afternoon said that after guard-of-honour and reception of the President in the Airport, she will move for Narsingarh to inaugurate the new building of Judicial Academy and will lay the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present.</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>While giving details of the security measures SP(West) Sankar Debnath said that tight security measures had been and a large number of security forces were deployed in Agartala and Udaipur, where the President is scheduled to visit on both days.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Debnath added  that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit. He said that during movement of the President's convoy, the road traffic system will be restricted and appealed to the people to cooperate with the security personnel during the proposed visit of the President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"T121020224",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"64 voters from PCC to cast votes for AICC president’s election",
                "description":"A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.",
                "imageName":"T121020224.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.</p><p>AICC set up 67 polling booths  across the country  'Kharge vs Tharoor' fight on Oct 17, where the last electoral contest for the top post of the party took place in the year 2000 when Jitendra Prasada had suffered a crushing defeat at the hands of Sonia Gandhi.</p><p>For the Congress president election, Shashi Tharoor and Mallikarjun Kharge are the party's two contestants and the counting of ballots will be taken up on October 19 and results will be declared as to who between the two candidates, octogenarian Mallikarjun Kharge or shashi Tharoor, will win the election.</p><p>PCC president Birajit Sinha said that a ten member delegation of Tripura Congress led by PCC working president Sushanta Chakraborty, Niranjan Das and Abhijit Sarkar had gone to Guwahati and attended a meeting addressed by Kharge on Monday. He said that the PCC does not receive any communication from AICC, whether candidates Mallikarjun Kharge or shashi Tharoor will come into Tripura for the poll campaign.</p><p>Sinha said that senior Congress leader Abdul Hannan has been appointed as presiding officer for elections in Tripura which will come off at the Congress Bhavan on October 17 next and the Tripura Pradesh Congress’s working president Sushanta Chakraborty and Pancham Misra have been appointed as election agents.</p><p>He added that said that all the voters of TPCC have been informed of the election schedule and they will duly turn up on the scheduled day for casting their ballots in favour of their candidate  7. Elections will take place on October 17 in every state capital from 10 AM to 4 PM, Sinha said, adding that the vote will be by secret ballot. All the state’s ballot boxes will be brought to Delhi and counting will take place on October 19 and results will be declared the same day, he said.</p><p>Ballot papers will also be sent to the Bharat Jodo Yatra campsite in Karnataka and a booth will be set up there for the yatris, he said. More than 9,000 Pradesh Congress Committee (PCC) delegates will vote in the poll</p>"
            },
            {
                "id":"T121020225",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Opposition will boycott President’s programmes",
                "description":"Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC)",
                "imageName":"T121020225.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC).</p><p>CPI(M) state secretary Jitendra Chowdhury through a press statement said that the during the visit of President, the state government will organize civic reception and another government programme and the state government has sent invitations to the CPI(M) state secretary, party MLAs and former MPs, but the state secretariat members of the party welcome the visit of President and decided to be absent from both programmes in protest of four and half years long violence against opposition.</p><p>Chowdhury said that there are no rules of law and everyday there are attacks on personal liberty and citizen’s rights and now the present situation goes that even the rights to pay tribute to martyrs of the party have been snatched by the ruling party.</p><p>CPI(M) hoped that the President will realize the suffocation environment prevailed in the past four and half years and from her position will take steps to restore the rights of people in the state.</p>"
            },
            {
                "id":"T121020226",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"NF Railways to upscale its services and infrastructure in Tripura",
                "description":"In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.",
                "imageName":"T121020226.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.</p><p>Towards this direction it has again decided to extend the services of train number 02518/02517 to Agartala. This train was so far running between Kolkata and Guwahati. Now the passengers could board this train at Guwahati in the evening and will reach Agartala the next morning. Further, the recently introduced Jan Shatabdi Express train’s service between Agartala to Jiribam in Manipur will be extended up to Khongsang in Manipur. With this the train will run over an additional 55 km. distance and it will be able to cover a distance of 300 km in six hours. This train will also have a new LHB rake with latest amenities and a Vistadome coach to promote tourism in this section, informed the Divisional Railway Manager J.S. Lakra today at a press meet at the Agartala rail station.</p><p>The DRM of NF Railways further informed that a survey for a second line between Lumding – Badarpur via Lanka- Chandranathpur has been sanctioned by the Railway Board and will be completed by March 2023. The work of electrification of the Lumding-Agartala line is expected to be completed by December, 2023. Survey for new line between Dharmanagar-Pecharthal up to Belonia via Kamalpur-Khowai[1]Agartala measuring 178.72 km has been completed. The Railways has also started a survey for upgrading the Agartala rail station with modern state of the art facilities.</p><p>Two escalators are being constructed here and these are expected to be completed next month. Two more escalators are coming up at Dharmanagar rail station. Expanding commercial opportunities the NF Railway has opened two modular stalls at Agartala rail station and very soon such modular stalls will be opened at Udaipur, Belonia, Sabroom, Ambassa, Kumarghat and Dharmanagar station. This is being done under the ‘One Station One Product’ scheme to showcase the indigenous products of Tripura. Local artisans have been requested to make maximum use of this opportunity. At the same time NF Railway has introduced e-auction schemes to delegate parking, pay and use toilet, advertisement space at the rail stations in Tripura for commercial use. In an effort to improve freight transport and logistics, works for additional goods terminals at Sekerkote and Agartala have been shortlisted and one additional goods line at Agartala is being processed. The NF Railways has also been coordinating with local traders for boosting trade by providing parcel train facilities for the transport of rubber, timber, pineapple, jackfruit and other indigenous products of the region. In the international connectivity sector the Agartala-Akhaura rail line is expected to be completed in the next four-five months.</p>"
            }
        ], 
        "national":[
            {
                "id":"N141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Seat belts mandatory for all 4-wheeler passengers from Nov 1 in Mumbai",
                "description":"Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.",
                "imageName":"N141020221.jpg",
                "publishedAt":"Mumbai, October 14, 2022",
                "content":"<p>Mumbai Police on Friday issued a notice making seat belts mandatory for all passengers, both in front and rear seats, travelling in four-wheelers from November 1.</p><p><b>“All motor vehicle drivers and all commuters in vehicles, whoever travels on the roads of Mumbai City are hereby informed that it will be mandatory for drivers and all passengers to wear seat belts while travelling from November 1,” the Mumbai Police said in a statement.</b></p><p>Violators of the new rule will be liable for punishment under the relevant sections of the Motor Vehicles (Amendment) Act, 2019.</p><p><b>In the notice, the Mumbai Police directed that four-wheelers that do not have seat belts for all passengers should get them installed by November 1.</b></p><p>Last month, Union Minister of Road Transport and Highways Nitin Gadkari announced that seatbelts will be mandatory for all passengers sitting in a vehicle.</p><p>'It will now be mandatory for all the people sitting in the car to wear a seat belt,' the Union Minister said.</p><p>Gadkari's announcement came after the fatal accident of former Tata Group chairman Cyrus Mistry, which had sparked criticism over the flaws in the transport and traffic control system, including laws governing seat belts for car passengers</p>"
            }
        ],
        "politics":[
            {
                "id":"P141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Election Commission likely to announce assembly poll dates for Gujarat, Himachal Pradesh today",
                "description":"The Election Commission of India (ECI) is likely to announce the dates for upcoming assembly elections in Gujarat and Himachal Pradesh Friday.",
                "imageName":"P141020221.jpg",
                "publishedAt":"Agartala, October 14, 2022",
                "content":"<p>The Election Commission of India (ECI) is likely to announce the dates for upcoming assembly elections in Gujarat and Himachal Pradesh Friday. </p><p>The EC is likely to announce the dates at a press conference scheduled for 3 pm.</p><p>Gujarat, the backyard of Prime Minister Narendra Modi, is witnessing Delhi Chief Minister Arvind Kejriwal's Aam Aadmi Party (AAP) spirited campaign to keep its footprint in the western state, where the BJP is aiming for a straight seventh term. </p><p>The Congress, which had offered Modi's BJP a close contest back in 2017 polls, is facing the challenge to keep its relevance after being wiped out of the majority of Indian states including its stronghold Punjab earlier this year.</p><p>The elections in Gujarat are closely followed to track whether the AAP, which swept Punjab in 2022, emerges as a new alternative to the BJP in the state with national repercussions.</p><p>In Himachal, the BJP had won 43 out of 68 seats, comfortably ahead of Congress' 22, in the 2017 state polls.</p>"
            }
        ],
        "sports":[
            {
                "id":"S141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Sourav Ganguly's BCCI president stint: List of drives and misses",
                "description":"Former Indian skipper Sourav Ganguly's stint as the country's cricket board (BCCI) president is nearing an end as he has been controversially denied a second term in the governing body by the officials",
                "imageName":"S141020221.jpg",
                "publishedAt":"IBNS, October 14, 2022",
                "content":"<p>Former Indian skipper <b>Sourav Ganguly's </b>stint as the country's cricket board (BCCI) president is nearing an end as he has been controversially denied a second term in the governing body by the officials. </p><p>Ganguly's exit, which is also dubbed as an ‘unceremonious one’, has triggered controversies even leading to political ramifications involving the ruling parties of India and the ex-captain's homestate West Bengal - the Bharatiya Janata Party (BJP) and Trinamool Congress (TMC) respectively. </p><p>Cutting across the controversy, India Blooms presents some of the important decisions Ganguly took as the Board of Control for Cricket in India (BCCI) chief as well as the uncomfortable scenarios that popped up under his three-year tenure. </p><p><h1>Achievements and Highlight of Sourav's tenure </h1></p><p><h2>Day/Night Test</h2></p><p>Ganguly's BCCI was instrumental in hosting the first Day/Night Test (also called Pink Ball Test) in the country. </p><p>Then skipper Virat Kohli's Team India took on Bangladesh and headed for a massive win in the Day/Night Test which was held at the Eden Gardens in Kolkata in Nov 2019. </p><p><h2>IPL amid Covid scare</h2></p><p>When the world was unable to grasp the evolving and fast-changing scenarios after Covid-19 broke out in 2020, the BCCI managed to organise the delayed IPL for that year in Dubai, where the infection rates were far less. </p><p><h2>Domestic cricketers' pay hike</h2></p><p>After assuming the charge of the BCCI, Ganguly had clearly stated that his focus would be on first-class cricket. </p><p>In a significant decision, Ganguly introduced pay hikes for the cricketers who play in the domestic circuit. </p><p><h2>Appointing Rahul Dravid as coach</h2></p><p>Ganguly was instrumental in convincing his former colleague Rahul Dravid to become the men's team's head coach after his predecessor Ravi Shastri stepped down. </p><p>Also VVS Laxman was given the charge of the National Cricket Academy after Dravid quit to become the Team India head coach. Ganguly had played an active role in appointing Laxman to the NCA post as well. </p><p><h2>Record IPL media rights </h2></p><p>The IPL media rights for the period of 2023-2027 were sold at a huge amount of Rs. 48,390 crore, which is the second highest for any sporting event after the United States' National Football League. </p><p>Also, the monopoly of a company in acquiring media rights across platforms was broken with two separate biddings for television and digital media. </p><p>While Star won the television rights for Rs. 23,575 crore, Viacom 18 bagged the digital rights at a bigger amount of Rs. 23,758 crore. </p><p><h2>Women's IPL</h2></p><p>Barely a few weeks ago, the outgoing BCCI president had announced the commencement of the women's IPL, which is likely to begin next year. </p><p>In a letter to the state associations, Ganguly wrote as quoted by various media, 'The BCCI is currently working on the much-awaited Women’s IPL. We are expecting to start the first season early next year.' </p><p><h2>Controversies</h2></p><p>Captaincy issues involving Virat Kohli </p><p>Ganguly's decisions on former skipper Virat Kohli (his stepping down as T20 captain and each other's contradictory remarks on the issue) also earned him the wrath of many in cricketing circles and among Kohli fans. </p><p>Ganguly claimed he had personally requested Kohli not to step down as the T20 skipper, something which the latter contradicted. </p><p><h2>Wriddhiman Saha's allegation</h2></p><p>After getting dropped from the senior men's team, wicketkeeper-batsman Wriddhiman Saha made an explosive claim that Ganguly had assured him of a berth in Team India as long as he remains the BCCI boss. </p><p>The claim had raised questions on whether Ganguly interferes into the team selection, which primarily remains the job of the selection committee. </p><p><h2>Endorsements</h2></p><p>Reports said former BCCI president and Chennai Super Kings (CSK) owner N Srinivasan was one among those who slammed Sourav Ganguly as a board president accusing him of 'nonperformance' and alleging that he had represented brands that were the direct rivals of sponsors of BCCI. </p><p>Ganguly, a common face for multiple brands catering to diverse products, was also slammed by his ex-colleague and Delhi BJP MP Gautam Gambhir for doing surrogate advertising. </p><p><b>’If the BCCI president (Ganguly) is doing it (endorsing fantasy league), you can't expect other players not to do it,’ said Gambhir, who made his international debut under Ganguly's captaincy.</b></p>"
            }
        ],
        "entertainment":[

            {
                "id":"E141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Sonam Kapoor gives us a sneak peek at her stunning look from Karwa Chauth. Check out",
                "description":"Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.",
                "imageName":"E141020221.jpg",
                "publishedAt":"Mumbai/IBNS, October 14, 2022",
                "content":"<p>Bollywood actress and fashionista Sonam Kapoor gave a peek of her Karwa Chauth dress up even as she did not fast for the occasion.</p><p>Sharing a set of images from her parents' Anil and Sunita Kapoor's Mumbai house, Sonam, in her Instagram post revealed that she doesn't fast on Karwa Chauth but loves dressing up a bit to celebrate the day with family.</p><p>'My husband isn't a fan of Karwa Chauth as he thinks fasting should only be intermittent so I've never kept it! But both of us are big believers that festivals and traditions are a great reason for family and friends to come together,' she wrote.</p><p><b>Sonam Kapoor's mom Sunita Kapoor hosts Karwa Chauth festivities at home every year, which are attended by her friends from the industry. </b></p><p>'I love that my mom loves celebrating it and I love being a part of it and dressing up. Sunita Kapoor, you always throw the best dos! Your energy and generosity is legendary and I hope to follow the same path! Happy KC everyone,' wrote Sonam.</p><p>She also posted a video of herself getting ready for the festivities and wrote: 'It's so nice to get back to the real world with my team, get dressed up and meet people... Love being back in my home ground. Love you Mumbai with all your scars and cracks you're magic.'</p>"
            }
        ],
        "international":[
            {
                "id":"I141020221",               
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"World Food Day: Another year of global record hunger looms amid food and climate crisis",
                "description":"The world is at risk of yet another year of record hunger as the global food crisis continues to drive more people into worsening levels of acute food insecurity, The World Food Programme (WFP) warned on Thursday",
                "imageName":"I141020221.jpg",
                "publishedAt":"New York, October 14, 2022",
                "content":"<p>The world is at risk of yet another year of record hunger as the global food crisis continues to drive more people into worsening levels of acute food insecurity, The World Food Programme (WFP) warned on Thursday.</p><p>In a call for urgent action to address the root causes of rising hunger, ahead of World Food Day, the agency said the current crisis was down to a “confluence of competing crises”, caused by climate shocks, conflict and economic instability.</p><p>The number of hungry people around the world has shot up from 282 million to around 345 million since the beginning of 2022, and by mid-year, WFP had reached just over 111 million in need, aiming to reach a record 153 million by year’s end.</p><p>“We are facing an unprecedented global food crisis and all signs suggest we have not yet seen the worst”, said WFP Executive Director David Beasley.</p><p>“For the last three years hunger numbers have repeatedly hit new peaks. Let me be clear: things can and will get worse unless there is a large scale and coordinated effort to address the root causes of this crisis. We cannot have another year of record hunger”.</p><p>Holding back famine</p><p>The emergency food relief agency underscored that it is currently “holding back famine” in five countries: Afghanistan, Ethiopia, Somalia, South Sudan and Yemen.</p><p>Conflict continues to drive the most vulnerable into catastrophic hunger, with communications disrupted, humanitarian access restricted and communities displaced.</p><p>The current war in Ukraine, for example, has disrupted global trade, pushing up transport costs and lead times while leaving farmers lacking access to enough fertilizers and other agricultural supplies they need, to produce enough food.</p><p>Economy and climate</p><p>Meanwhile, climate shocks are increasing in frequency and intensity, leaving those affected, no time to recover between disasters.</p><p>An unprecedented drought in the Horn of Africa is pushing more people into alarming levels of food insecurity, with famine now projected in Somalia, while floods have devastated homes and farmland in several countries, most strikingly in Pakistan.</p><p>WFP explained that the ability of governments to respond is constrained by their own national economic woes – currency depreciation, inflation, debt distress – as the threat of global recession also mounts.</p><p>“This will see an increasing number of people unable to afford food and needing humanitarian support to meet their basic needs”, the agency warned.</p>"
            }

        ],
        "region":[],
        "tourism":[]

    }
}