{
    "totalResults":"8",
    "news":
    {
        "global":[
            {
                "id":"34",   
                "shortTitle":"Headline Today",            
                "name":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "description":"The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.",
                "url":"/news?id=34",
                "urlToImage":"News35.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.</p><p>The President Droupadi Murmu in her maiden visit to Agartala arrived at the airport through a special flight and  was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After attending a series of programmes including inauguration of the National Law University (NLU) at Narsingarh and visiting the Durgabari tea estate in the West Tripura district's Mohanpur subdivision, and interacted with tea garden workers.</p><p>The President in another programme held at Rabindra Satabarshiki Bhavan inaugurates, lays foundation stones for various projects for strengthening the connectivity, education sector, Judicial Academy and Law University among the projects.</p><p>While, addressing the gathering the President said that development of the North Eastern region in getting new impetus with various new projects of Highway, Railway, Airway and Waterway after virtually inaugurated an MLA Hostel at Capital Complex, Agartala and laid foundation stones for Maharaja Birendra Kishore Manikya Museum and Cultural Centre; IIIT-Agartala; and various projects of government of Tripura related to roads, schools and hostels for students from Rabindra Satabarshiki Bhavan.</p><p>She said that projects inaugurated today will not only strengthen the connectivity, education, judiciary and legislature in Tripura, but also boost the rich culture of the state.</p><p>The President said that the youth of India have made a unique identity in the field of Information Technology, all over the world. She was confident that the permanent campus of Indian Institute of Information Technology, Agartala will set new benchmarks in the field of Information Technology.</p><p> The President said that a holistic education system is essential for the development of the nation and progress of the youth. ‘Along with higher education, we should give more emphasis on primary education,’ said President and added that she was happy to note that the Ministry of Development of North Eastern Region, in association with Tripura  government, has launched 'Vidya-Jyoti Mission 100' under which 100 existing higher secondary schools will be converted into quality education institutions with state-of-the-art facilities.</p><p>The President said that there is immense potential for development in the North-Eastern Region. Today, development of the Region is getting a new impetus with various new projects of highways, railways, airways and waterways.</p><p>The President said that India has become the 5th largest economy in the world. The North Eastern Region, including Tripura, will play an important role in making India a five trillion dollar economy by 2025. She expressed confidence that the aspirations, innovation and entrepreneurship of the talented and hardworking people, especially the youth of Tripura, will play an important role in achieving this goal.</p><p>While, attending Civic reception hosted by Agartala Municipal Corporation (AMC) here at Agartala Town Hall on Wednesday evening in presence of Chief Minister, Deputy Chief Minister, Urban Development Minister and Mayor of AMC, the President recalling great sacrifice and bravery of Elbert Ekka said that Tripura among the prosperous and proud state of the country, which has been known for producing least plastic waste.</p><p>The President thanked the people of Tripura for their warm welcome. She said that the composite culture of Tripura is the pride of India. The tribal community of Tripura has maintained a beautiful amalgamation of democracy and tradition.</p><p>The President said that living in harmony with nature is the specialty of tribal society. Most of the area of Tripura is rich in forest resources. In preserving this invaluable forest wealth, the natural lifestyle of the tribal society has played an important role.</p><p>Tripura was on the top place in achieving the target of ‘Responsible Consumption and Production’, included in the Sustainable Development Goal –12 during the year 2020-21, said Murmu and added that Tripura is one of the two states that generate the least plastic waste.</p><p>Tripura is a power-surplus state and it exports electricity to Bangladesh and the connectivity between Bangladesh and India has increased with the construction of ‘Maitri Setu’ over Feni River, said President and added that at the same time, it has become convenient for the entrepreneurs of Tripura to use the ports of Chittagong and Ashuganj.</p><p>From the very beginning, Tripura has played a major role in deepening India's friendship with Bangladesh, said Murmu and expressing happiness added that Tripura is making steady progress as an educational hub. She said that many institutions of higher and professional education are established in the state, where students from not only the North Eastern region but also from other parts of India and abroad come for education. She was also happy to note that Tripura has achieved the target of 100 percent enrollment at the level of elementary education.</p><p>Appreciating the artistic craft made by bamboo by thousands of bamboo artisans of the state, the President said that the government is taking holistic steps to improve the socio-economic  status of tribes including tea-garden workers.</p><p>Earlier, the President visited Albert Ekka War Memorial in Agartala and paid homage to brave soldiers who made the supreme sacrifice in the line of duty during the 1971 Bangladesh Liberation war.</p>"
            }
          
        ],    
        "local":[
         
          ],
        "flash":[
            {
                "id":"37",               
                "name":"Body recovered from drain identified, one detain for suspected murder",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Body recovered from drain identified, one detain for suspected murder",
                "description":"The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.",
                "url":"/news?id=37",
                "urlToImage":"News36.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of on e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she could not return.</p><p>On Wednesday amidst tight security across the Agartala city due to the maiden visit of President Droupadi Murmu, at about 2 PM some pedestrians noticed the floating body of Aparna Karmakar Ghosh in a drain in mysterious condition.</p><p>Soon after the recovery of body, the police led by SDPO (Sadar) started massive investigation to unearth the mystery of the death and within 24-hours, they established the identity of the victim woman and has also detained her paramour over suspicion of her murder.</p><p>While, police sources said that main accused of the murder is another man and police investigation and hunt to trace the main accused has been expedite and soon they will able to resolve the murder mystery, probably for a triangle love affairs.</p>"
            },
            {
                "id":"38",               
                "name":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "description":"TJust few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government",
                "url":"/news?id=38",
                "urlToImage":"News38.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>Just few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government.</p><p>Addressing a press conference here at CPI(M) headquarters on Thursday evening, CPI(M) state secretary Jitendra Chowdhury said that CPI(M) general secretary Sitaram Yechury along with opposition leader and party’s polit bureau member Manik Sarkar will address the mass gathering, where party workers and their supporters from different parts of the state will gather.</p><p>Chowdhury said that the proposed rally on October 21st is not the party’s election rally, but the rally will be organized to show their protest against four and half years 'misrule' of the present state government and a protest against the prevailing lawlessness situation of the state.</p><p>Castigating the functioning of the state government, Chowdhury alleged that since the formation of BJP government, the rights of common people and the opposition party are being suppressed by the ruling party through their continuous violence.</p><p>He said that from August 16 to September 30 last, the party has organized about 175 to 180 meetings, rallies and demonstrations across the state against the misrule of the state government and in support of basic demand of the state’s people, which received massive support from the cross section of the society.</p><p>He said that day by day the law and order situation of the state is deteriorating and appealed to the state’s people to strengthen their agitation against the government to restore democracy in the state.</p><p>Mentioning the high unemployment rate and political violence in terms of National Crime Record Bureau (NCRB) data, which make Tripura top among all Northeastern states, Chowdhury said that now Chief Minister of the state in recently held Northeast Council (NEC) meeting has admitted Tripura now turns into safe corridor of drug smuggling, which are destroying the young generation of the state.</p><p>He also alleged that during the past four and half years of rule, the BJP government failed to introduce any new project for the benefit of the state's people and claimed that the state government defamed President Droupadi Murmu by inaugurating old projects.</p>"
            },
            {
                "id":"33",                            
                "name":"President Murmu on two-day visit to Tripura arrived",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu on two-day visit to Tripura arrived",
                "description":"Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.",
                "url":"/news?id=33",
                "urlToImage":"News34.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.</p><p>Soon after landing of her special flight in Agartala airport, President was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After rousing welcome, Tripura police welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Then, President leaves the airport towards the venue for inauguration of Tripura Judicial Academy in Narsingarh and inaugurated the new building of Judicial Academy and has also laid the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT. </p>"
            },
            {
                "id":"35",               
                "name":"Unidentified woman body recovered from drain in Agartala city",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Unidentified woman body recovered from drain in Agartala city",
                "description":"Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.",
                "url":"/news?id=35",
                "urlToImage":"News36.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.</p><p>Soon after recovery of the body, panic triggered in that locality and police with a forensic team rushed to the spot to recover the body.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>While giving details SDPO(Sadar) Ajoy Kumar Das said that apparently there were no injury marks in the body and police cannot say anything in details till the finding of autopsy and forensic report.</p><p>He said that till night the identity of the deceased woman was yet to be established and even the local people were not able to identify the woman. Das added that police registering an unnatural death (UD) case started investigation to identify the woman and reason of her death and who the body has been found in the drain water.</p>"
            },
            {
                "id":"29",               
                "name":"Tripura ready to welcome President Droupadi Murmu",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura ready to welcome President Droupadi Murmu",
                "description":"All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.",
                "url":"/news?id=29",
                "urlToImage":"News30.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.</p><p>President Droupadi Murmu, will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state. On Wednesday morning at about 11.15 AM through a special flight President will arrive at Agartala airport and Tripura Police will welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Giving details of the tour programmes of the President, DM and SP of the West Tripura district Debapriya Burdhan and Sankar Debnath addressing a press conference on Tuesday afternoon said that after guard-of-honour and reception of the President in the Airport, she will move for Narsingarh to inaugurate the new building of Judicial Academy and will lay the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present.</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>While giving details of the security measures SP(West) Sankar Debnath said that tight security measures had been and a large number of security forces were deployed in Agartala and Udaipur, where the President is scheduled to visit on both days.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Debnath added  that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit. He said that during movement of the President's convoy, the road traffic system will be restricted and appealed to the people to cooperate with the security personnel during the proposed visit of the President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"30",               
                "name":"64 voters from PCC to cast votes for AICC president’s election",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"64 voters from PCC to cast votes for AICC president’s election",
                "description":"A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.",
                "url":"/news?id=30",
                "urlToImage":"News31.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.</p><p>AICC set up 67 polling booths  across the country  'Kharge vs Tharoor' fight on Oct 17, where the last electoral contest for the top post of the party took place in the year 2000 when Jitendra Prasada had suffered a crushing defeat at the hands of Sonia Gandhi.</p><p>For the Congress president election, Shashi Tharoor and Mallikarjun Kharge are the party's two contestants and the counting of ballots will be taken up on October 19 and results will be declared as to who between the two candidates, octogenarian Mallikarjun Kharge or shashi Tharoor, will win the election.</p><p>PCC president Birajit Sinha said that a ten member delegation of Tripura Congress led by PCC working president Sushanta Chakraborty, Niranjan Das and Abhijit Sarkar had gone to Guwahati and attended a meeting addressed by Kharge on Monday. He said that the PCC does not receive any communication from AICC, whether candidates Mallikarjun Kharge or shashi Tharoor will come into Tripura for the poll campaign.</p><p>Sinha said that senior Congress leader Abdul Hannan has been appointed as presiding officer for elections in Tripura which will come off at the Congress Bhavan on October 17 next and the Tripura Pradesh Congress’s working president Sushanta Chakraborty and Pancham Misra have been appointed as election agents.</p><p>He added that said that all the voters of TPCC have been informed of the election schedule and they will duly turn up on the scheduled day for casting their ballots in favour of their candidate  7. Elections will take place on October 17 in every state capital from 10 AM to 4 PM, Sinha said, adding that the vote will be by secret ballot. All the state’s ballot boxes will be brought to Delhi and counting will take place on October 19 and results will be declared the same day, he said.</p><p>Ballot papers will also be sent to the Bharat Jodo Yatra campsite in Karnataka and a booth will be set up there for the yatris, he said. More than 9,000 Pradesh Congress Committee (PCC) delegates will vote in the poll</p>"
            },
            {
                "id":"31",               
                "name":"Opposition will boycott President’s programmes",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Opposition will boycott President’s programmes",
                "description":"Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC)",
                "url":"/news?id=31",
                "urlToImage":"News32.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC).</p><p>CPI(M) state secretary Jitendra Chowdhury through a press statement said that the during the visit of President, the state government will organize civic reception and another government programme and the state government has sent invitations to the CPI(M) state secretary, party MLAs and former MPs, but the state secretariat members of the party welcome the visit of President and decided to be absent from both programmes in protest of four and half years long violence against opposition.</p><p>Chowdhury said that there are no rules of law and everyday there are attacks on personal liberty and citizen’s rights and now the present situation goes that even the rights to pay tribute to martyrs of the party have been snatched by the ruling party.</p><p>CPI(M) hoped that the President will realize the suffocation environment prevailed in the past four and half years and from her position will take steps to restore the rights of people in the state.</p>"
            },
            {
                "id":"32",               
                "name":"NF Railways to upscale its services and infrastructure in Tripura",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"NF Railways to upscale its services and infrastructure in Tripura",
                "description":"In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.",
                "url":"/news?id=32",
                "urlToImage":"News33.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.</p><p>Towards this direction it has again decided to extend the services of train number 02518/02517 to Agartala. This train was so far running between Kolkata and Guwahati. Now the passengers could board this train at Guwahati in the evening and will reach Agartala the next morning. Further, the recently introduced Jan Shatabdi Express train’s service between Agartala to Jiribam in Manipur will be extended up to Khongsang in Manipur. With this the train will run over an additional 55 km. distance and it will be able to cover a distance of 300 km in six hours. This train will also have a new LHB rake with latest amenities and a Vistadome coach to promote tourism in this section, informed the Divisional Railway Manager J.S. Lakra today at a press meet at the Agartala rail station.</p><p>The DRM of NF Railways further informed that a survey for a second line between Lumding – Badarpur via Lanka- Chandranathpur has been sanctioned by the Railway Board and will be completed by March 2023. The work of electrification of the Lumding-Agartala line is expected to be completed by December, 2023. Survey for new line between Dharmanagar-Pecharthal up to Belonia via Kamalpur-Khowai[1]Agartala measuring 178.72 km has been completed. The Railways has also started a survey for upgrading the Agartala rail station with modern state of the art facilities.</p><p>Two escalators are being constructed here and these are expected to be completed next month. Two more escalators are coming up at Dharmanagar rail station. Expanding commercial opportunities the NF Railway has opened two modular stalls at Agartala rail station and very soon such modular stalls will be opened at Udaipur, Belonia, Sabroom, Ambassa, Kumarghat and Dharmanagar station. This is being done under the ‘One Station One Product’ scheme to showcase the indigenous products of Tripura. Local artisans have been requested to make maximum use of this opportunity. At the same time NF Railway has introduced e-auction schemes to delegate parking, pay and use toilet, advertisement space at the rail stations in Tripura for commercial use. In an effort to improve freight transport and logistics, works for additional goods terminals at Sekerkote and Agartala have been shortlisted and one additional goods line at Agartala is being processed. The NF Railways has also been coordinating with local traders for boosting trade by providing parcel train facilities for the transport of rubber, timber, pineapple, jackfruit and other indigenous products of the region. In the international connectivity sector the Agartala-Akhaura rail line is expected to be completed in the next four-five months.</p>"
            },
            {
                "id":"27",               
                "name":"Massive security arrangements made for President visit",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Massive security arrangements made for President visit",
                "description":"Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "url":"/news?id=27",
                "urlToImage":"News28.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Tight security measures also took place in Agartala and Udaipur, where the President is scheduled to visit the temple town on October 13 next.</p><p>On Monday morning DGP Amitabh Ranjan accompanied by the officials of President’s security guard and other officials visited all venues including Agartala airport, railway station and Rabindra Satabarshiki Bhavan and reviewed the security measures.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Police sources said that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit.</p><p>Official sources said that President Droupadi Murmu will inaugurate several development projects in the state during her two-day visit from Wednesday.</p><p>The President is scheduled to land at Maharaja Bir Bikram Airport here on Wednesday at 11.15 am. It will be Murmu's first visit to the state after becoming the President. During the visit, Murmu will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>The President is scheduled to lay the foundation stone of Pushbanta Palace Museum, will inaugurate the Tripura Judicial Academy at Narsingarh in West Tripura district and will also participate in the 75th anniversary celebration of MBB College.</p><p>The state government plans to develop Pushbanta Palace which was built by Maharaja Birendra Kishore Mankya Bahadur in 1917 into a digital museum. The Pushbanta palace was the official residence of the Governor till April 2018.</p><p>The President  will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>The president is scheduled to visit Udaipur to offer prayer to Tripura Sundari temple on October 13 and will leave the state for Guwahati at 1.10 pm.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"28",               
                "name":"City police arrested 13 bike lifters, 5 stolen bikes recovered in past 15 days",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"City police arrested 13 bike lifters, 5 stolen bikes recovered in past 15 days",
                "description":"In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.",
                "url":"/news?id=28",
                "urlToImage":"News29.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.</p><p>In their continuous investigations and operations, the city police has so far burst the inter-state motor bike lifter gang and based on the interrogation statements of previous arrested bike lifters, the West Agartala police station on Sunday midnight have also managed to detain two motor bike lifters.</p><p>While, giving details, SDPO(Sadar) Ajoy Kumar Das speaking with media persons on Monday afternoon here at West Agartala police station said that after thorough interrogation of two detained bike lifters identified as Sujjan Hussain of Madhupur and Kishore Paul of bordering Rajnagar area of Agartala, police recovered two stolen motor bikes under their possession.</p><p>He said that with the arrest of two new bike lifters, many gang members of inter-state bike lifters have been arrested so far and among them 11 are in jail custody. Das said that police arrested both Sujjan Hussain and Kishore Paul and they will be produced before a local court on Tuesday with police remand appeals for further interrogation.</p><p>He said that a gang of property thefts and snatchers from North Tripura are staying in the capital city for months in rented houses and they were involved with many stolen incidents. After snatching a number of motor bikes, they smuggled these stolen bikes to neighbouring Bangladesh through their international theft network.</p><p>He also said that police have identified all the gang members and soon they will be able to arrest more lifters.</p><p>During the past one month, the capital city police have arrested a number of thieves and motor bike lifters involved in a series of stolen incidents and after the arrest of these criminals, the growing number of stolen incidents  across Agartala has also started decreasing.</p>"
            },
            {
                "id":"23",               
                "name":"AIKS demands immediate roll back of hiked CNG prices",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"AIKS demands immediate roll back of hiked CNG prices",
                "description":"The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.",
                "url":"/news?id=23",
                "urlToImage":"News24.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.</p><p>Speaking with media persons, AIKS, state secretary and veteran CPI(M) leader Pabitra Kar condemning the price hike decision of the government said that it’s a secret attempt of the government to increase the burden of high inflation among the general people.</p><p>The abrupt hike of Compressed Natural Gas (CNG) prices will directly impact on the daily earning of about 20,000 auto-rickshaws and other light motor vehicles, which are solely depend on CNG to run their passenger services, said Kar and added that government has also abnormally hiked prices of pipeline gas (PNG) at about 50 % during last four and half years.</p><p>Giving statistics on hiked CNG and PNG prices, Kar said that on April 1st, 2018 the price per kilogram of CNG was Rs. 41 and now it stands at Rs. 77.30 per kilogram.</p><p>It may be recalled here that amidst festivities of Durga Puja on October 1st , Tripura Natural Gas Company Limited (TNGCL) increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>The abnormal hike of prices of CNG across the state has affected the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.</p><p>TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 1st, the CNG price of TNGCL have also been increased, which in accordance with the order of Union Ministry of Petroleum and Natural Gas has once again abruptly hiked the price of Compressed Natural Gas (CNG).</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p><p>Kar also said that if any customer purchases CNG of Rs. 100, then he has to pay 4 % for VAT and 19.5% for Tripura Road Development Cess, that means Rs. 23.50  taxes only for purchase of Rs. 100.</p><p>Kar said that if the government cannot rollback their decision, then AIKS will organize statewide movements.</p>"
            },
            {
                "id":"24",               
                "name":"President Murmu to visit Tripura on Oct 12",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu to visit Tripura on Oct 12",
                "description":"The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "url":"/news?id=24",
                "urlToImage":"News25.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Official sources said that the tour schedules of the President have been finalized and  during the visit the President will inaugurate the Tripura Judicial Academy at Narsingarh and will also participate in the 75th anniversary celebration of MBB College. On October 13 next, she will visit Tripura Sundari temple in Udaipur to offer prayers.</p><p>Sources added that Agartala Municipal Corporation (AMC) will give her civic reception at Agartala Town Hall in presence of Chief Minister Dr Manik Saha along with his cabinet colleagues.</p><p>During a programme at the hall number-1 of Rabindra Satabarshiki Bhavan, the President will virtually inaugurate and lay the foundation of various projects. On October 13, the President will flag off trains from Agartala railway station.</p><p>Sources added that the DGP Amitabh Ranjan held a high-level meeting on security arrangements for the President's proposed visit and top administrative officials had also attended a preparatory meeting for the President's visit and to finalize the receiving details of the tour programme as per the protocol.</p><p>Sources also said that the tour programme has been finalized and security measures are being taken as per the tour schedule of the President. After being elected as President, this will be her first visit to Tripura as President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"25",               
                "name":"Police destroyed huge quantities of seized drugs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Police destroyed huge quantities of seized drugs",
                "description":"As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.",
                "url":"/news?id=25",
                "urlToImage":"News26.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.</p><p>Giving details, police said that on the first day of drug disposal, the state police had destroyed drugs worth Rs. 2.33 crore including 3990 kilograms, cannabis ( Ganja), 9416 bottles of contraband cough syrup and 33,525 Yaba tablets.</p><p>On the second day of disposal on Saturday, the DDC destroyed more items of seized drugs including huge quantities of cannabis, banned cough syrup Phensedyl, different kinds of tablets and Heroin.</p><p>Police added that the officials of Union Ministry of Home Affairs (MHA) Amit Shah from Guwahati through video conferencing monitored the entire drug disposal process along with other states of the country during the past two days.</p><p>The Narcotics Control Bureau (NCB) has monitored the disposal process along with state’s agencies, which have  confiscated different anti-drug operations by state police and other security forces.</p><p>Among all Northeast states, the highest quantity of 12,000 kg of drugs was destroyed in Tripura while 4,000 kg of narcotics was burnt in Arunachal Pradesh, 1,600 kg in Meghalaya, 1,900 kg in Manipur 1,900 kg, 1,500 kg in Mizoram and 398 kg in Nagaland and including Assam, a total of  40,000 kg of seized drugs were destroyed during past two days.</p><p>Official sources said that the Union Home Minister Amit Shah, who is currently on a three-day visit to Assam, will hold a meeting on narcotics control with the chief ministers, chief secretaries and directors general of police of the Northeastern states.</p>"
            }
          
        ],
        "trending":[
            {
        
                "id":"4",
                "name":"Kingpins of dacoity incident arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Kingpins of dacoity incident arrested",
                "description":"After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night",
                "url":"/news?id=5",
                "urlToImage":"News5.jpg",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last, the investigation  team through scientific investigation and using technical aid, arrested prime accused person of the incident identified as Safar Ali (41), son of Bahar Miah of Loknath Para, Aralia under East Agartala police station.</p><p>Based on the interrogation statements of arrest dacoit Safar Ali,  police have also managed to arrest another kingpin of the dreaded dacoity incident of Baldakhal robbery case namely Ashim Das from Bagbari under Lefunga police station last night. He was forwarded before a local court and police got 5 days remand. He was also arrested earlier in two more property offence cases under East Agartala and R K Pur police stations.</p><p>Police added that a massive scientific investigation is going on to arrest other culprits involved in two dacoity incidents held at Champamura area of East Aralia and Baldakhal area on August 21 and 23rd night respectively. They added that the investigations are continuous raids in different locations to arrest associates of the two arrested dacoits involved in many stolen cases.</p><p>It may be recalled here that though city police claimed that during last fortnight the incidents stolen has been reduced across the city, but on Saturday evening two major robbery incidents were held at East Aralia and Chandrapur areas under East Agartala police station. Despite police assurance of increases in night patrolling and police surveillance, just a few days before the festivities of Durga Puja, still major parts of Agartala city remain unguarded in night time.</p>"
            },
            {
                "id":"5",
                "name":"Three missing minor girls rescued",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Three missing minor girls rescued",
                "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
                "url":"/news?id=6",
                "urlToImage":"News6.JPG",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
            },
            {
                "id":"6",
                "name":"Pharmacists plays important role in health services, CM",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Pharmacists plays important role in health services, CM",
                "description":"The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha",
                "url":"/news?id=7",
                "urlToImage":"News7.JPG",
                "publishedAt":"Agartala, September 25, 2022",
                "content":"<p>The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha.</p><p>Chief Minister Dr Manik Saha delivering his speech during the celebration of the 12th World Pharmacist Day at the Regional Institute of Pharmaceutical Science and Technology (RIPSAT) campus in Abhoynagar area of Agartala on Sunday said that the World Pharmacist Day 2022 theme is 'Pharmacy united in action for a healthier world.' The theme aims to emphasize the united effort of global pharmacists to improve the healthcare sector.</p><p>He said that it is a moment for pride for the people of the state that hundreds of students from other states of the country are now pursuing the education in the RIPSAT, but earlier the students of Tripura had to study in other states for their pharmacy education.</p><p>He assured the RIPSAT authorities all the vacant posts for the faculty members of the institute will be filled up.</p><p>During the celebration of day, Chief Minister has also inaugurated a voluntary blood donation camp and during the programme, the secretary of Health and Family Welfare Dr Debasish Basu, director of medical education Dr Chinmoy Biswas and director of Health department Dr Subhasish Debbarma along with authorities of Pharmacy college were also present. (OVER)</p>"
            }
        ],
        "latest":[
            {
                "id":"38",               
                "name":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "description":"TJust few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government",
                "url":"/news?id=38",
                "urlToImage":"News38.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>Just few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government.</p><p>Addressing a press conference here at CPI(M) headquarters on Thursday evening, CPI(M) state secretary Jitendra Chowdhury said that CPI(M) general secretary Sitaram Yechury along with opposition leader and party’s polit bureau member Manik Sarkar will address the mass gathering, where party workers and their supporters from different parts of the state will gather.</p><p>Chowdhury said that the proposed rally on October 21st is not the party’s election rally, but the rally will be organized to show their protest against four and half years 'misrule' of the present state government and a protest against the prevailing lawlessness situation of the state.</p><p>Castigating the functioning of the state government, Chowdhury alleged that since the formation of BJP government, the rights of common people and the opposition party are being suppressed by the ruling party through their continuous violence.</p><p>He said that from August 16 to September 30 last, the party has organized about 175 to 180 meetings, rallies and demonstrations across the state against the misrule of the state government and in support of basic demand of the state’s people, which received massive support from the cross section of the society.</p><p>He said that day by day the law and order situation of the state is deteriorating and appealed to the state’s people to strengthen their agitation against the government to restore democracy in the state.</p><p>Mentioning the high unemployment rate and political violence in terms of National Crime Record Bureau (NCRB) data, which make Tripura top among all Northeastern states, Chowdhury said that now Chief Minister of the state in recently held Northeast Council (NEC) meeting has admitted Tripura now turns into safe corridor of drug smuggling, which are destroying the young generation of the state.</p><p>He also alleged that during the past four and half years of rule, the BJP government failed to introduce any new project for the benefit of the state's people and claimed that the state government defamed President Droupadi Murmu by inaugurating old projects.</p>"
            },
            {
                "id":"33",                            
                "name":"President Murmu on two-day visit to Tripura arrived",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu on two-day visit to Tripura arrived",
                "description":"Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.",
                "url":"/news?id=33",
                "urlToImage":"News34.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.</p><p>Soon after landing of her special flight in Agartala airport, President was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After rousing welcome, Tripura police welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Then, President leaves the airport towards the venue for inauguration of Tripura Judicial Academy in Narsingarh and inaugurated the new building of Judicial Academy and has also laid the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT. </p>"
            },
            {
                "id":"29",               
                "name":"Tripura ready to welcome President Droupadi Murmu",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura ready to welcome President Droupadi Murmu",
                "description":"All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.",
                "url":"/news?id=29",
                "urlToImage":"News30.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.</p><p>President Droupadi Murmu, will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state. On Wednesday morning at about 11.15 AM through a special flight President will arrive at Agartala airport and Tripura Police will welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Giving details of the tour programmes of the President, DM and SP of the West Tripura district Debapriya Burdhan and Sankar Debnath addressing a press conference on Tuesday afternoon said that after guard-of-honour and reception of the President in the Airport, she will move for Narsingarh to inaugurate the new building of Judicial Academy and will lay the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present.</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>While giving details of the security measures SP(West) Sankar Debnath said that tight security measures had been and a large number of security forces were deployed in Agartala and Udaipur, where the President is scheduled to visit on both days.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Debnath added  that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit. He said that during movement of the President's convoy, the road traffic system will be restricted and appealed to the people to cooperate with the security personnel during the proposed visit of the President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            }
           
        ],    
        "all":[
                {
                    "id":"0",
                    "name":"Opposition stage walkout over adjournment motion",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Opposition stage walkout over adjournment motion",
                    "description":"Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday",
                    "url":"/news?id=1",
                    "urlToImage":"News1.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>Opposition CPI(M) on the first day of 12th session of the 12thassembly staged walkout on Friday after Speaker rejected their adjournment motion to discuss police action over the supporters of Left’s student and youth organizations on September 15 last and attack on their party workers in Hapania.</p><p>Soon after the first day session began, veteran CPI(M) MLA Tapan Chakraborty asked the speaker about their adjournment motion, which had to be placed before the speaker. When, speaker Ratan Chakraborty in his reply said that there was no need for the motion in the House as opposition members will be allowed to raise the respective issues in an appropriate time during the two days session.\nAll CPI (M) members staged a protest after the denial from the speaker and all of them rushed to the well of the House demanding that their motion should be accepted by the speaker. After their walkout from the House during question hour, Opposition leader Manik Sarkar addressing a press conference at the official chamber of opposition leader in the assembly alleged that the speaker intentionally suppressed their motion on behalf of the treasury bench.</p><p>Sarkar narrating the incidents of police atrocities on student and youth activities on September 15 last during their deputation towards Chief Minister and attack on CPI(M) supporters in Hapania on September22 and subsequent attacks on the houses and shops of their supporters in the same night, said that the role of speaker is not impartial and he continuously giving more attention to treasury bench.\nCriticizing the functioning of BJP-IPFT coalition government, Sarkar said that BJP are continuing their violence politics to win the next assembly elections, but they should remember that united resistance of common people will not continue their violent politics. Sarkar also described Thursday's incident as the ‘beginning of the end’ of BJP in Tripura. Later, in the second session of the House, the opposition bench returned in the assembly proceedings and participated in the private members resolutions.</p>"
                },
                {
                    "id":"1",
                    "name":"Govt to recruit all TET qualified candidates at a time",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Govt to recruit all TET qualified candidates at a time",
                    "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                    "url":"/news?id=2",
                    "urlToImage":"News2.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
                },
                {
                    "id":"2",
                    "name":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"CM stress on the role of MLAs to strengthen democracy, four MLAs missing assembly",
                    "description":"As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session",
                    "url":"/news?id=2",
                    "urlToImage":"News3.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>As assured by the state government, the Education Minister Ratan LalNath in the first day of assembly session once again assured the House that all Teacher Eligibility Test (TET) qualified candidates will be appointed. Replying to the private members resolution moved by the opposition MLA Sudhan Das over recruitment process educated unemployed youths of the state in the second session of the House on Friday, Nath giving statistic of the employment opportunities created by the present state government said that a special meeting under the leadership of Chief Minister Dr Manik Saha along with deputy chief minister and Finance minister Jishnu Dev Varma, Chief Secretary and Finance secretary held on Thursday said that government has taken a major decision and will recruit all TET qualified candidates at a time.</p><p>Nath said at present, the state has 3,108 candidates who have qualified the TET and are eligible for appointment as teachers for class one to eight and added that all qualified TET candidates will be given their appointment letters as teachers under the Education department within a short period. He also there are process going on to appoint around 600graduate and post-graduate teachers.</p><p>While giving statistics of government jobs given during the past four and half years rule of BJP-IPFT government, Nath said that altogether23,031 jobs including regular, contractual and jobs throughout sourcing has been given to the youths of the state. He said that by December, 2022 next the number will be about 38,000 as the government has taken massive initiative to recruit more candidates in various departments and to fill up vacant posts. He also said that there are 6,382 jobs in the pipeline and soon the government will release appointment letters for these numbers of posts.</p>"
                },
                {
                    "id":"13",
                    "name":"Massive preparations for grand celebration of “Mayer Goman”",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Massive preparations for grand celebration of “Mayer Goman”",
                    "description":"In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event",
                    "url":"/news?id=4",
                    "urlToImage":"News4.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>In order to ensure great immersion carnival festival “Mayer Goman”, a historic event for the state’s people, the Information and Cultural Affairs (ICA) department has taken massive initiative   to make the festival as a grand event, said ICA Minister Sushanta Chowdhury.</p><p>Speaking at the review meeting held with concern officials and club authorities of Agartala, Minister with his appeals to clubs to participate in the immersion carnival “Mayer Goman” on October 7th next said that this for the first time ICA department has been organizing such grand event and department will also give special prizes to Puja organizers.</p><p>Giving details on the preparation for the great immersion carnival festival of Goddess Durga, Chowdhury said that the department has also taken preparation that people from outside Agartala can witness the festival and the department will give prizes to clubs, who will participate in the “Mayer Goman” carnival. Among the participating clubs, first prize will be awarded with Rs. 50,000, second prize with Rs. 30,000 and third prize winner club will get Rs. 20,000.</p><p>He said that the “Mayer Goman” festival will be organized in front of Agartala city centre and a detailed road map will also be finalized to make the celebration a grand event.</p><p>Speaking in the review meeting, Mayor Dipak Majumder of Agartala Municipal Corporation (AMC) said that AMC has taken a massive cleaning drive before the ensuing festivities of Durga Puja and has taken different pro-people measures for smooth celebration of the festivities.</p><p>He said that AMC has also prepared a detailed plan for smooth celebration of festivities and hoped that this time people of the state as well as devotees from different areas will witness a hassle puja celebration across Agartala.</p><p>He said that several teams will be formed under the leadership of AMC councilors and government authorities to finalize all pre-puja preparation works across the city and special measures would be taken for immersion processions and immersion of Goddess at ‘Dashamighat’ and other seven immersion spots of the city and AMC would repair and will made necessary constructions if needed, said Mayor. Mayor also said that AMC will give awards to community puja organizers based on their celebration of puja by maintaining the environment and its protection.</p><p>Director of ICA department Ratan Biswas said that the department will award the community puja organizers of Agartala and its adjoining areas based on six themes.</p><p>During the review meeting, secretary of ICA Dr P K Chakraborty, TTDC’s chairman Santosh Saha, editor of North East Colors Sanjib Deb, president of Agartala club forum Pranab Sarkar, SP (Security) Bijoy Debbarma and other dignitaries were also present. (OVER)</p>"
                },
                {
                    "id":"4",
                    "name":"Kingpins of dacoity incident arrested",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Kingpins of dacoity incident arrested",
                    "description":"After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last",
                    "url":"/news?id=5",
                    "urlToImage":"News5.jpg",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>After one month of dreaded dacoity incidents held at East Aralia and Baldakhal, the police have also managed to arrest  another kingpin  involved in the dacoity incident held at Baldakhal on August 23rd night.</p><p>Police sources said that based on the dacoity case registered at Budhjungnagar police station on August 24 last, the investigation  team through scientific investigation and using technical aid, arrested prime accused person of the incident identified as Safar Ali (41), son of Bahar Miah of Loknath Para, Aralia under East Agartala police station.</p><p>Based on the interrogation statements of arrest dacoit Safar Ali,  police have also managed to arrest another kingpin of the dreaded dacoity incident of Baldakhal robbery case namely Ashim Das from Bagbari under Lefunga police station last night. He was forwarded before a local court and police got 5 days remand. He was also arrested earlier in two more property offence cases under East Agartala and R K Pur police stations.</p><p>Police added that a massive scientific investigation is going on to arrest other culprits involved in two dacoity incidents held at Champamura area of East Aralia and Baldakhal area on August 21 and 23rd night respectively. They added that the investigations are continuous raids in different locations to arrest associates of the two arrested dacoits involved in many stolen cases.</p><p>It may be recalled here that though city police claimed that during last fortnight the incidents stolen has been reduced across the city, but on Saturday evening two major robbery incidents were held at East Aralia and Chandrapur areas under East Agartala police station. Despite police assurance of increases in night patrolling and police surveillance, just a few days before the festivities of Durga Puja, still major parts of Agartala city remain unguarded in night time. (OVER)</p>"
                },
                {
                    "id":"5",
                    "name":"Three missing minor girls rescued",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Three missing minor girls rescued",
                    "description":"The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday",
                    "url":"/news?id=6",
                    "urlToImage":"News6.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>The state police within 24-hours of the missing incident of three minor girls from Lalcherri village under Ambassa police station were rescued on Sunday.</p><p>Police sources said that on Saturday evening three minor girls, reading in class-IX went missing from their houses at Lalcherri village under Ambassa police station of Dhalai district.</p><p>After receiving the information, police reacted sharply and immediately started investigation and due to quick action by the Ambassa police station and Agartala GRP police station, all the three minor girls were recovered within 24 hours of their disappearance. After completing all legal formalities all three girls were handed over to their respective parents. (OVER)</p>"
                },
                {
                    "id":"6",
                    "name":"Pharmacists plays important role in health services, CM",
                    "category":"NEH Report",
                    "author":"Our Correspondent",
                    "title":"Pharmacists plays important role in health services, CM",
                    "description":"The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha",
                    "url":"/news?id=7",
                    "urlToImage":"News7.JPG",
                    "publishedAt":"Agartala, September 25, 2022",
                    "content":"<p>The services of pharmacists are like the services of doctors, nurses and paramedics are also very important for overall health services, said Chief Minister Dr Manik Saha.</p><p>Chief Minister Dr Manik Saha delivering his speech during the celebration of the 12th World Pharmacist Day at the Regional Institute of Pharmaceutical Science and Technology (RIPSAT) campus in Abhoynagar area of Agartala on Sunday said that the World Pharmacist Day 2022 theme is 'Pharmacy united in action for a healthier world.' The theme aims to emphasize the united effort of global pharmacists to improve the healthcare sector.</p><p>He said that it is a moment for pride for the people of the state that hundreds of students from other states of the country are now pursuing the education in the RIPSAT, but earlier the students of Tripura had to study in other states for their pharmacy education.</p><p>He assured the RIPSAT authorities all the vacant posts for the faculty members of the institute will be filled up.</p><p>During the celebration of day, Chief Minister has also inaugurated a voluntary blood donation camp and during the programme, the secretary of Health and Family Welfare Dr Debasish Basu, director of medical education Dr Chinmoy Biswas and director of Health department Dr Subhasish Debbarma along with authorities of Pharmacy college were also present. (OVER)</p>"
                },
               {
                "id":"8",
                "name":"Snatcher gang busted in city, five arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Snatcher gang busted in city, five arrested",
                "description":"Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.",
                "url":"/news?id=8",
                "urlToImage":"news8.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>Agartala, September 29, 2022: Just a couple of days before the great festival of Durga Puja, the capital city police have busted a gang of thieves and snatchers and foiled the pre-puja snatching incidents held across Agartala city.</p><p>The city police have arrested three snatchers involved with looting of cash among from a senior citizen after his withdrawal the amount from Punjab National Bank (PNB) branch located at Kaman Choumohani and escaped from the spot.</p><p>Giving details SDPO (Sadar) Ajay Kumar Das accompanied by OC of East Agartala police station Rana Chatterjee said that they have also arrested two thieves involved with many stolen incidents.</p><p>Das said that on Tuesday afternoon, when a senior citizen had withdraw an amount of Rs. 50, 000 from the Kaman Choumohani branch of PNB and when the man tried to purchase some medicines from a nearby medical store, three snatchers arrived at the spot and snatched the entire amount of Rs. 50,000.</p><p>Later, the victim old man registered a case at East Agartala police station under section 382 (B) of IPC and the police team started massive investigation to identify these snatchers and subsequently police team managed to arrest all three snatchers identified as Sukumar Das, Litan Bhuiya and Anjan Sarkar.</p><p>All these three snatchers were members of a active snatching gang working across the Agartala city and specially before the Durga Puja festival, they are very much active in the city, said Das and added that these miscreants had also committed many stolen incidents taking pre-puja rush in the city.</p><p>He claimed that police busted the snatcher gang involved in the city and the arrested trio has been produced before a local court with police remand appeals to interrogate them for arrest of other gang members.</p><p>Police has also arrested two thieves identified as Raju Chakma of Pecharthal and Bishal Dey, who are habitual drug addicts and involved with many stolen incidents held in Agartala city in recent past, specially they were involved with theft of LPG cylinders and copper wires.</p>"
            },
            {
                "id":"9",
                "name":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Retrenched teachers hopeful after meeting with CM to get back their jobs",
                "description":"As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them",
                "url":"/news?id=9",
                "urlToImage":"news9.jpg",
                "publishedAt":"Agartala, September 29, 2022",
                "content":"<p>As assured in the state assembly, Chief Minister Dr Manik Saha on Wednesday met a delegation of retrenched 10, 323 teachers and assured them will take all positive steps as per law to rehabilitate them.</p><p>As promised in the state assembly the Chief Minister Dr Manik Saha had invited the representatives of the retrenched teachers for a discussion in his official chamber here at Civil Secretariat on Wednesday morning over the claims of retrenched teachers in presence Advocate General Siddhartha Sankar Dey and Law Secretary Biswajit Palit.</p><p>Sources said that after getting appointment and invitation from Chief Minister Office (CMO), a delegation of six members of retrenched teachers led by Bijay Krishna Saha explained how according to the High Court judgment of 2014 (Para-127) only teachers whose jobs had been challenged on the ground of recruitment rules-not more than 58-had been terminated and the same order has also been uphold by the Supreme Court in its order dated March 29th, 2017 last.</p><p>But, recently in a reply to RTI queries the Supreme Court has clarified that no teacher except the 462 notified had been parties to the case and their claims to reinstatement is justified as they had been illegally terminated en masse without any individual notice by the previous government.</p><p>After hearing the claims made by retrenched teachers, The Chief Minister had collected all the documents substantially proving their claims and Dr Saha said that he was not fully aware of all such developments over the cases of teachers, said Bijay Krishna Saha.</p><p>Saha speaking with media persons after their meeting with the Chief Minister said that CM has compassionately heard their grievance and assured that he will meet them again after Durga Puja celebration. Chief Minister also asked the agitated teachers for all relevant documents in support of their claims and assured that government will take all possible steps to rehabilitate them as per law.</p><p>Chief Minister also said that the Law department will analyze and verify all the submitted documents and after consultation with the Advocate General and Law Secretary of the state government, he will meet them again.</p><p>Bijay Krishna Saha and other retrenched teachers also added that the Chief Minister repeatedly told them within the framework of law, the present government wanted to rehabilitate and will take all necessary steps if the law and orders of Courts permit the state government.</p><p>He also directed the concerned law officials to examine the claims of teachers and to give suggestions to the state government to protect their livelihood.</p><p>The leaders of retrenched teachers have also expressed their satisfaction after meeting with the Chief Minister and added that they are now seeing a ray of hope to protect their livelihood and their families.</p><p>It may be recalled here that leader of the Opposition Manik Sarkar and the lone Congress MLA Sudip Roy Barman condemned the police action held on September 26 during ‘assembly march’ by retrenched teachers and urged the Chief Minister to meet the agitating teachers. Accordingly, their representatives called on Dr Saha on Wednesday.</p>"
            },
            {
                "id":"10",
                "name":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"All TET qualified teachers to get offers, 15 % hike in salaries of Anganwadi, ASHA workers",
                "description":"The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers",
                "url":"/news?id=10",
                "urlToImage":"News10.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>The state is going to celebrate the Durga Puja festival with a bunch of good news including offer of appointment for 3,108 TET teachers, 6,067 Special Executives in the police department, a 15 % hike in salaries for Anganwadi and ASHA workers.</p><p>Those who are not coming under the bracket of government also don’t have to reason to dishearten as another 30,000 people are coming under the social pension scheme. The cabinet decided all these in a meeting held on Thursday night.</p><p>The Information and Cultural Affairs (ICA) Minister on Friday afternoon  informed in a press conference, while Education Minister Ratan Lal Nath said that the government kept its commitment and urged people to enjoy the Durga Puja with a smiling face.</p><p>Chowdhury said that a total of 3, 18,415 social pensioners will get new wages of Rs.2000 per month from October 1 and they will receive the same amount in their respective bank accounts. The cabinet has also decided to give social pension to more than 30,000 beneficiaries and for that the government will spend Rs. 6 crore per month in addition.</p><p>He said that Thursday’s cabinet has also decided to appoint 6,067 Special Executive under Home Department on contract basis and they will be appointed in the service through SPs of the districts. He said that interested people from the age group of 21 to 45 years can apply for the post in their respective police stations and the recruitment process will be completed in the next one month.</p><p>The cabinet has also decided to hike the salaries of 9,931 Anganwadi workers and helpers at the rate of 15% , similarly the honorarium of ASHA workers will also get a hike of 15%, said Chowdhury. The cabinet has decided that 17 Professors will also be appointed on contract basis for Veterinary college and has also created 374 new posts under the Rural Development department, said the Minister.</p><p>Meanwhile, Education Minister Ratan Lal Nath addressing another press conference said that on September 27 and September 30, offer letters for 514 TET qualified teachers had been released by the Education department.</p><p>He said that the cabinet has decided to release offer letters for 3,108 Teacher Eligibility Test (TET) qualified candidates will be released and in addition of 514 offer letters, altogether 3,622 TET qualified candidates are getting their appointment as government teachers.</p>"
            },
            {
                "id":"11",
                "name":"85 TPS Gr-I, II officers transferred",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"85 TPS Gr-I, II officers transferred",
                "description":"In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police",
                "url":"/news?id=11",
                "urlToImage":"News11.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>Agartala, October 1, 2022: In a major administrative reshuffle, altogether 85 TPS Grade-I and II officers transferred and posted in different wings of state police.</p><p>The General Administration (Personnel and Training) department of the state government through notification issued on Thursday said that among the transferred officer only TPS Grade-I officer Nila Kumar Jamatia has been transferred as deputy commandant of 6th TSR battalion and rest 84 TPS Grade-II officers are mostly new promote officers, who are promoted from police inspectors to Dy.SP rank officers and were posted in different wings of state police including in TSR battalions.</p>"
            },
            {
                "id":"12",
                "name":"CM inaugurates 5 smart city projects",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM inaugurates 5 smart city projects",
                "description":"In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday",
                "url":"/news?id=12",
                "urlToImage":"News12.jpg",
                "publishedAt":"Agartala, October 1, 2022",
                "content":"<p>In order to fulfill the basic demands and rights  of people by improving their socio-economic status, the state government is working round the clock, said Chief Minister Dr Manik Saha inaugurating five new projects under Agartala Smart City project on Friday.</p><p>During an inauguration programme held at Old Motor Stand area of the city  on Friday under Agartala Smart City Mission and Agartala Municipal Corporation (AMC) , Dr Said said that based on the requirement and demands of people, the present state government is taking projects for the welfare of people  and these are now reflecting.</p><p>He said that welfare schemes of the government are now reaching every corner of the state.</p><p>Highlighting the launching of state level special campaign “Prati Ghore Susashan” (good governance at every household)   to ensure benefits  of various state and central schemes for the people of the state during the celebration of 72th birthday of Prime Minister Narendra Modi on September 17 last, the Chief Minister said that two-and-a-half-month long campaign on good governance will reach every household.</p><p>He also said that as per the decision taken by the state cabinet, above 6000 government jobs will be given in coming days and the government has also hiked the salaries of Anganwadi and ASHA workers at the rate of 15 %.</p><p>During the programme, AMC mayor Dipak Majumder and AMC commissioner Dr Shailesh Yadav, deputy mayor Manika Das Datta and MLA Dr Dilip Das were also present.</p>"
            },
            {
                "id":"14",
                "name":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Amidst festival abrupt hike in CNG prices, protest demanding roll back",
                "description":"Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.",
                "url":"/news?id=14",
                "urlToImage":"News14.JPG",
                "publishedAt":"Agartala, October 2, 2022",
                "content":"<p>Amidst festivities of Durga Puja, Tripura Natural Gas Company Limited (TNGCL) on Saturday increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>Hundreds of auto rickshaw workers and activists under the banner of CITU on Sunday morning staged their protest in front on CNG stations demanding roll back of the decision. The workers also blocked roads.The abnormal hike of prices of CNG across the state has affect the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.<p></p>On Saturday, TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 2nd.</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p>"
            },
            {
                "id":"15",
                "name":"ECI gears up for 2023 assembly polls in Tripura, dispatches new EVMs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"ECI gears up for 2023 assembly polls in Tripura, dispatches new EVMs",
                "description":"The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.",
                "url":"/news?id=15",
                "urlToImage":"ECI2.jpg",
                "publishedAt":"Agartala, October 4, 2022",
                "content":"<p>The Election Commission of India (ECI) as part of its preparation of 2023 assembly elections in Tripura , a total of 4800 EVMs, 4900 VVPATs and same number of control units dispatched in the state and these machines has also arrived in the state  capital.</p><p>The elections to Tripura, Meghalaya, and Nagaland are expected to be held in February next year after the Assembly polls in Gujarat and Himachal Pradesh.</p><pAn official of the State Election department said that  on Monday the ECI had sent 4800 Electronic Voting Machines (EVMs), manufactured by the Hyderabad-based Electronic Corporation of India Ltd, in 15 big containers.</p><p>In presence of the representatives of the different political parties, the Election department has stored these EVMs here at the strong rooms of Umakanta Academy  with adequate security measures and these EVMs would be shifted to all the subdivisions of the state.</p><p>The official said that the National level Master Trainers (NLMT) appointed by the Election Commission last week have given training to all the eight District Magistrates and Additional District Magistrates on every important matter for the proper management of the election.</p>"
            },
            {
                "id":"16",
                "name":"Durga puja passed off peacefully barring some stray incidents",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Durga puja passed off peacefully barring some stray incidents",
                "description":"The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala",
                "url":"/news?id=16",
                "urlToImage":"News16.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The Durga Puja, biggest festival of Tripura, passed off by and large peacefully amidst incessant rain and thunderstorm with lightning across Agartala and many other parts of the state on the day of ‘Maha Saptami’ and ‘Maha Nabami’ and  barring some stray incidents of suspected murder and road mishaps  in separate places of the state during last four days.</p<p>The incessant rain on the night of ‘Maha Saptami’ across Agartala and other parts of Tripura, dampens the festival spirit . Resulting in, the majority of low-lying areas of the city getting inundated and road traffic was also badly affected.</p<p>While, irrespective of castes and creeds, a huge number of people thronged puja pandals during the festival days and immersion of Goddess is still going on Thursday also in different places of the state including capital city Agartala.</p<p>No untoward incident was reported from the capital town that alone hosts over 500 puja, said police on Thursday.</p<p>Meanwhile, the great immersion carnival festival “Mayer Goman”, which will be held on October 7 by participation of all major community Durga Puja organizers , the Information and Cultural Affairs (ICA) department is not leaving any stone unturned to make it a historic event for the state’s people.</p<p>Official sources said that all major clubs of the city will participate in the  immersion carnival “Mayer Goman” on October 7th and the government is now making big structures in front of Agartala City Centre for the event.</p<p>Though, four days of Durga Puja passes off peacefully, reports said that few person sustained injuries in several road mishaps due to reckless driving and a minor inmate of a drug rehabilitation centre in Madhupur area under Sepahijala district alleged beaten to death by the authorities of drug rehab centre and victim family has also filed a specific FIR against accused person.</p<p>Despite many apprehensions for bad weather conditions  , people in large numbers were seen visiting pandals in groups braving incessant rains.</p>"
            },
            {
                "id":"17",
                "name":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"ONGC Tripura asset celebrates Ravan Dahan event on the occasion Dussehra",
                "description":"During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event.",
                "url":"/news?id=16",
                "urlToImage":"N1.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>During the celebration of Dussehra festival as a mark of victory of good over evil, the Deputy Chief Minister of Tripura, Jishnu Dev Varma was the Chief Guest at ONGC Tripura Asset’s Ravan Dahan event. The event which was being held at ONGC premises after three years due to the pandemic-induced disruption made a rousing return as it witnessed massive public participation in thousands and was also widely covered by local media, as people thronged the ONGC KV Ground on the final day of Durga Puja Bijoya Dashami and the Navaratri festival.</p><p>Deputy Chief Minister Dev Varma was welcomed at the KV Ground by Asset Manager Tarun Malik and other senior officers of the Tripura Asset.</p><p>Speaking on the occasion, Jishnu Dev Varma said that the day marks not just the “victory of truth over untruth and ‘Dharma’ over ‘Adharma’ but is also a celebration of motherland and nationalism.” To have the epic tale of Ramayana staged symbolically at such a massive scale and with such huge public participation is also a reflection of how hope always triumphs eventually, he said in reference to the extreme uncertainty and difficulties posed by the pandemic to the people at large. He congratulated ONGC for making this event an important part of Tripura’s local life during this time of the year, and said, ‘none other than ONGC can pull of something like this at such a grand scale, not merely because it has the resources but also for the love that exists between ONGC and the people of Tripura’.</p><p>He also acknowledged the critical role the Maharatna major has played over the years in providing employment to Tripura’s youth as well as generating many business and livelihood opportunities for the local entrepreneurs and individuals. ONGC has transformed countless lives all over the country by providing the energy that obliterates darkness, celebrates light and ushers in prosperity and it rightfully deserves the dignity and honour that is accorded to it today, he said.</p><p>Asset Manager Tarun Malik while welcoming the Deputy CM was admired not only for his deft and expert handling of many important portfolios in the state but also for his scholarly knowledge on various subjects and issues of critical importance. “At a time when many of us today don’t have the patience to sit through even a few pages of reading, he is a true scholar and thinker in our midst and continues to inspire us with his meaningful words and advice”, he said. He also thanked the Dy CM for taking time out of his busy schedule in a festive period such as Durga Puja and said that would motivate ONGCians of Tripura immensely in their pursuit of energy security for this beautiful state and the country at large.</p><p>To mark the special occasion, a short yet entertaining and engaging Ram-Leela play-drama was also enacted by the young children of ONGC Tripura Asset, for the very first time.</p>"
            },
            {
                "id":"18",
                "name":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Drug rehab centre turns into a murder spot, one inmate lynched to death",
                "description":"The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.",
                "url":"/news?id=17",
                "urlToImage":"N2.JPG",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The mushrooming private drug rehabilitation centers across Tripura, now turns into a centre criminal syndicates with allegation of distribution of drugs and involvement in other criminal activities including murder related crime, which  are gradually turns into a  issue of serious concern.</p><p>On July 2nd night, two youths were murdered in a drug rehabilitation centre located at Nandan Nagar area under Budhjungnagar police station and the prime accused in the double murder case was the owner of drug rehab centre, who had committed the crime  in association of other inmates of the center. Day after the incident, police recovered two bodies from a jungle at Durga Chowdhury Para under the same police with multiple injuries and with hands tied behind their bodies.</p><p>While, on the day of “Bijoya Dashami”, one more drug rehab centre located at Madhupur area under Sepahijala district has been accused for their direct involvement for a brutal murder of an inmate of the rehab centre.</p><p>Police sources said that on September 25th last one Gafur Miah of Naljala village under Bishramganj police station handed over his addicted son Ismail Miah (18) to a drug rehabilitation centre named as “Hamkrai Naikol Bodol” in Madhupur area of the same district.</p><p>But, on the ‘Dashami’ day, Gafur Miah was called off by a authority of rehab centre that his son had suffered injuries as he slipped on the floor. Immediately, Gafur Miah along with his few relatives rushed to the spot and found his son dead with multiple injuries. They immediately shifted his Madhupur Primary health centre and informed the matter to police. They alleged that persons running the rehab center lynched their son and brutally killed him.</p><p>Police also rushed to the spot and conducted autopsy of the body in presence of a magistrate and has also registered the FIR against drug rehab authorities.</p><p>Police sources added that the primary autopsy report reveals that the victim boy had several injuries in his entire body and leg was severely broken and his penis was compressed probably for thrashing him.</p><p>Police also said that based on the complaint of the victim's family, they started an investigation and will take all legal steps against the accused persons</p>"
            },
            {
                "id":"19",
                "shortTitle":"Today Headline",
                "name":"CM kicked off grand ‘Mayer Goman’ festival",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CM kicked off grand ‘Mayer Goman’ festival",
                "description":"The great and colourful immersion carnival festival “Mayer Goman” has been kicked off by the Chief Minister Dr Manik Saha in presence of a host of dignitaries from Agartala city centre on Friday evening.",
                "url":"/news?id=19",
                "urlToImage":"news19.jpg",
                "publishedAt":"Agartala, October 6, 2022",
                "content":"<p>The great and colourful immersion carnival festival “Mayer Goman” has been kicked off by the Chief Minister Dr Manik Saha in presence of a host of dignitaries from Agartala city centre on Friday evening.</p><p>The inauguration of the great carnival festival begins with spectacular cultural programmes performed by different groups of artists and after formal inauguration of the event, the immersion ceremony by different clubs and community Durga Puja organizers of the state capital started in the long HGB Road of Agartala city towards their destination to Dashamighat at the bank of river Howrah.</p><p>While, in his inaugural address in the gathering, Chief Minister Dr Manik Saha said that due to Covid pandemic, the carnival festival was not organized in the city, but after a two years gap, the Information and Cultural Affairs (ICA) department organized the great and spectacular festival.</p><p>Amidst thousands of gatherings on both sides of the main road, Dr Saha said that the government is always promoting the cultural heritage of the state's people and has also appealed to people to cooperate with the government for developing the cultural traditions of the state.</p><p>Speaking on the occasion, Deputy Chief Minister Jishnu Dev Varma said that irrespective of caste, creed and religion, the people of Tripura unitedly observed the festival of Durga Puja and sought blessings for prosperous society.</p><p>ICA Minister Sushanta Chowdhury said that to strengthen the festivities of the state's people, the great immersion carnival ‘Mayer Goman’ has been organized by the state government.</p><p>In order to commemorate the festival of immersion, the ‘Mayer Goman’ ceremony is being organized with health competition among the organizers and in coming days such a kind of cultural festival will also be organized in district and subdivision levels.</p><p>Giving details on the preparation for the great immersion carnival festival of Goddess Durga, Chowdhury said that the department has also taken measures that people from outside Agartala can witness the festival and the department will give prizes to clubs, who are participating in the “Mayer Goman” carnival. Among the participating clubs, first prize will be awarded with Rs. 50,000, second prize with Rs. 30,000 and third prize winner club will get Rs. 20,000.</p><p>Meanwhile, during the carnival ceremony,  irrespective of castes and creeds, a huge number of people thronged the entire stretch of HGB Road during immersion of the Goddess, which  is still going on till last report.</p><p>In the carnival festival, Agriculture Minister Pranajit Sigha Roy, Mayor of Agartala Municipal Corporation (AMC) Dipak Majumder, DGP Amitabh Ranjan, ADGP Sourav Tripathi, ONGC’s Tripura asset manager Tarn Malik,  Justice Arindam Lodh of High Court of Tripura, secretary of ICA department P K Chakraborty, director Ratan Biswas, eminent social worker Rajib Bhattacharjee  were also present along with other dignitaries</p>"
            },
            {
                "id":"20",               
                "name":"President Murmu to visit Tripura for two days from Oct 13",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu to visit Tripura for two days from Oct 13",
                "description":"The President Droupadi Murmu will visit Tripura for two days from October 13  and will  inaugurate a number of  developmental projects in the state.",
                "url":"/news?id=20",
                "urlToImage":"News21.jpg",
                "publishedAt":"Agartala, October 7, 2022",
                "content":"<p>The President Droupadi Murmu will visit Tripura for two days from October 13  and will  inaugurate a number of  developmental projects in the state.</p><p>Official sources said that during the visit the President will inaugurate the Tripura Judicial Academy at Narsingarh and will also participate in the 75th anniversary celebration of MBB  College. On October 14 next, she will visit Tripura Sundari temple in Udaipur to offer prayers.</p><p>Sources added that the DGP Amitabh Ranjan held a high-level meeting on security arrangements for the President's proposed visit and top administrative officials had also attended a preparatory meeting for the President's visit and to finalize the receiving details of the tour programme as per the protocol.</p><p>After being elected as President, this will be her first visit to Tripura as President and Agartala Municipal Corporation (AMC) will give her civic reception at Agartala Town Hall in presence of Chief Minister Dr Manik Saha along with his cabinet colleagues.</p>"
            },
            {
                "id":"21",               
                "name":"City police burst motorbike lifter gang, one arrested",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"City police burst motorbike lifter gang, one arrested",
                "description":" In a successful attempt, the Agartala city police have burst a gang of motorcycle lifters and arrested a kingpin and seized two stolen motorcycles",
                "url":"/news?id=21",
                "urlToImage":"News22.JPG",
                "publishedAt":"Agartala, October 7, 2022",
                "content":"<p>In a successful attempt, the Agartala city police have burst a gang of motorcycle lifters and arrested a kingpin and seized two stolen motorcycles.</p><p>Giving details of the police operation during a media interaction here at East Agartala police station on Friday afternoon,  SDPO (Sadar) Ajoy Kumar Das said that on Thursday midnight  OC of East Agartala police station Rana Chatterjee over suspicious ground detained a suspected bike rider and after interrogation, suspected bike lifter spill the bean.</p><p>Based on the interrogation statement, police team has also recovered a stolen scooty under his possession, said SDPO Das and added that police have arrested a bike lifter identified as Jalauddin from Churaibari area under North Tripura district.</p><p>He said that a gang of property thefts and snatchers from North Tripura are staying in the capital city for months in rented houses and they were involved with many stolen incidents.</p><p>Das added that this active bike lifter gang never stayed in a rented house for two months and they were frequently changing their locations. He also said that police have identified all the gang members and soon they will be arrested. While arrested bike lifter Jalauddin has been produced before a local court with police remand appeals for further interrogation.</p><p>During the past one month, the capital city police have arrested a number of thieves and motor bike lifters involved in a series of stolen incidents and after the arrest of these criminals, the growing number of stolen incidents across Agartala has also started decreasing</p>"
            },
            {
                "id":"22",               
                "name":"Security agencies must destroy all routes of drug trafficking:  Amit Shah",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Security agencies must destroy all routes of drug trafficking:  Amit Shah",
                "description":"The Union Home Minister Amit Shah on Saturday stressed that seizing narcotics alone cannot make the country drug-free and enforcement agencies must target for  destroying all channels between traffickers and consumers.",
                "url":"/news?id=22",
                "urlToImage":"news23.jpg",
                "publishedAt":"Guwahati, October 9, 2022",
                "content":"<p>The Union Home Minister Amit Shah on Saturday stressed that seizing narcotics alone cannot make the country drug-free and enforcement agencies must target for  destroying all channels between traffickers and consumers.</p><p>Addressing the regional meeting on 'Drug Trafficking and National Security' at Guwahati, the Home Minister said under 'Azadi Ka Amrit Mahotsav', a target to destroy 75,000 kg narcotics was set but under the leadership of Prime Minister Narendra Modi, the country so far destroyed over 1.5 lakh kg narcotics , which is more than double the target set.</p><p>During the regional meeting, Tripura Chief Minister Dr Manik Saha along with Chief Secretary J K Sinha and DGP  Amitabh Ranjan were also present with other NE states CMs, CSs, DGPs and heads of other security agencies.</p><p>While chairing a meeting with Chief Ministers of Northeastern states and top police officials in Guwahati, Union Home Minister Amit Shah said that stern actions would be taken to check the drug menace in the region.</p><p>After destroying 1.5 lakh narcotics,  the war against drugs is not yet finished.  The country is now  dreaming for a drugs-free India and for that, all stakeholders should work together, said Shah.</p><p>Shah further said that the Union Government has formulated a two-fold approach to deal with the drug menace which has spread all over the country.</p><p>Strong actions will be taken against those involved in drug peddling, while those who are the victim and fell into this vicious cycle, government machinery will work to bring them into the mainstream of the society, said Shah.</p><p>The Union Home Minister also said that narcotic substances were primarily smuggled into the country from Myanmar and Afghanistan. In the meeting with NCB officials and security personnel he directed to increase the vigil along all  international borders.</p><p>The security of the nation can only be ensured if drug trafficking and all related channels are destroyed as insurgency, arms smuggling, and other anti-national activities are linked to trafficking, he said. Shah also said insurgency along with arms trade and drug trafficking are two sides of a coin.</p><p>He also urged the law-enforcing, health, revenue, and social revenue departments to adopt a   strategy  for ensuring that drug trafficking is stopped.</p><p>He urged the chief ministers, chief secretaries, and director generals of police of the Northeastern states to adopt strategies to eradicate drug menace from the region.</p><p>Apart from the NCB Guwahati zonal unit, three new zones at Manipur, Arunachal Pradesh and Tripura have been approved while a new regional office will come up at Guwahati, said Shah.</p>"
            },
            {
                "id":"23",               
                "name":"AIKS demands immediate roll back of hiked CNG prices",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"AIKS demands immediate roll back of hiked CNG prices",
                "description":"The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.",
                "url":"/news?id=23",
                "urlToImage":"News24.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The Tripura state committee of All India Kisan Sabha (AIKS) demanded immediate rollback abnormally hiked prices of CNG.</p><p>Speaking with media persons, AIKS, state secretary and veteran CPI(M) leader Pabitra Kar condemning the price hike decision of the government said that it’s a secret attempt of the government to increase the burden of high inflation among the general people.</p><p>The abrupt hike of Compressed Natural Gas (CNG) prices will directly impact on the daily earning of about 20,000 auto-rickshaws and other light motor vehicles, which are solely depend on CNG to run their passenger services, said Kar and added that government has also abnormally hiked prices of pipeline gas (PNG) at about 50 % during last four and half years.</p><p>Giving statistics on hiked CNG and PNG prices, Kar said that on April 1st, 2018 the price per kilogram of CNG was Rs. 41 and now it stands at Rs. 77.30 per kilogram.</p><p>It may be recalled here that amidst festivities of Durga Puja on October 1st , Tripura Natural Gas Company Limited (TNGCL) increased the prices of Compressed Natural Gas (CNG) with effect from October 2nd.</p><p>The abnormal hike of prices of CNG across the state has affected the festival spirit as most of the commercial small vehicles including auto-rickshaws and private four wheelers are running in the streets by consuming fuel as CNG.</p><p>TNGCL through a notice said that due to increase of Natural Gas prices by government of India with effect from October 1st, the CNG price of TNGCL have also been increased, which in accordance with the order of Union Ministry of Petroleum and Natural Gas has once again abruptly hiked the price of Compressed Natural Gas (CNG).</p><p>As per the notice of the new prices of CNG, the existing prices in West Tripura district is Rs.68 per kilogram and now revised price will be Rs. 77.30 per kg with a hike of Rs. 9.30 paisa.</p><p>Similarly, the prices of CNG in all other districts of the state have been increased at Rs. 9.30 per kg, which will now cost Rs. 81.30 per kilogram.</p><p>Kar also said that if any customer purchases CNG of Rs. 100, then he has to pay 4 % for VAT and 19.5% for Tripura Road Development Cess, that means Rs. 23.50  taxes only for purchase of Rs. 100.</p><p>Kar said that if the government cannot rollback their decision, then AIKS will organize statewide movements.</p>"
            },
            {
                "id":"24",               
                "name":"President Murmu to visit Tripura on Oct 12",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu to visit Tripura on Oct 12",
                "description":"The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "url":"/news?id=24",
                "urlToImage":"News25.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>The President Droupadi Murmu will visit Tripura for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Official sources said that the tour schedules of the President have been finalized and  during the visit the President will inaugurate the Tripura Judicial Academy at Narsingarh and will also participate in the 75th anniversary celebration of MBB College. On October 13 next, she will visit Tripura Sundari temple in Udaipur to offer prayers.</p><p>Sources added that Agartala Municipal Corporation (AMC) will give her civic reception at Agartala Town Hall in presence of Chief Minister Dr Manik Saha along with his cabinet colleagues.</p><p>During a programme at the hall number-1 of Rabindra Satabarshiki Bhavan, the President will virtually inaugurate and lay the foundation of various projects. On October 13, the President will flag off trains from Agartala railway station.</p><p>Sources added that the DGP Amitabh Ranjan held a high-level meeting on security arrangements for the President's proposed visit and top administrative officials had also attended a preparatory meeting for the President's visit and to finalize the receiving details of the tour programme as per the protocol.</p><p>Sources also said that the tour programme has been finalized and security measures are being taken as per the tour schedule of the President. After being elected as President, this will be her first visit to Tripura as President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"25",               
                "name":"Police destroyed huge quantities of seized drugs",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Police destroyed huge quantities of seized drugs",
                "description":"As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.",
                "url":"/news?id=25",
                "urlToImage":"News26.jpg",
                "publishedAt":"Agartala, October 9, 2022",
                "content":"<p>As part of nationwide destruction of seized drugs and contraband items, the Tripura State Level Drug Disposal Committee headed by DIGP (Southern Range) destroyed huge quantities of drugs and other contraband items, worth of cores, during the past two days.</p><p>Giving details, police said that on the first day of drug disposal, the state police had destroyed drugs worth Rs. 2.33 crore including 3990 kilograms, cannabis ( Ganja), 9416 bottles of contraband cough syrup and 33,525 Yaba tablets.</p><p>On the second day of disposal on Saturday, the DDC destroyed more items of seized drugs including huge quantities of cannabis, banned cough syrup Phensedyl, different kinds of tablets and Heroin.</p><p>Police added that the officials of Union Ministry of Home Affairs (MHA) Amit Shah from Guwahati through video conferencing monitored the entire drug disposal process along with other states of the country during the past two days.</p><p>The Narcotics Control Bureau (NCB) has monitored the disposal process along with state’s agencies, which have  confiscated different anti-drug operations by state police and other security forces.</p><p>Among all Northeast states, the highest quantity of 12,000 kg of drugs was destroyed in Tripura while 4,000 kg of narcotics was burnt in Arunachal Pradesh, 1,600 kg in Meghalaya, 1,900 kg in Manipur 1,900 kg, 1,500 kg in Mizoram and 398 kg in Nagaland and including Assam, a total of  40,000 kg of seized drugs were destroyed during past two days.</p><p>Official sources said that the Union Home Minister Amit Shah, who is currently on a three-day visit to Assam, will hold a meeting on narcotics control with the chief ministers, chief secretaries and directors general of police of the Northeastern states.</p>"
            },
            {
                "id":"26",               
                "name":"Govt committed for zero tolerance against drug trafficking, border security to be strengthen,  CM",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Govt committed for zero tolerance against drug trafficking, border security to be strengthen,  CM",
                "description":"The central government has stressed for concrete efforts by all agencies with better coordination among themselves along with neighbouring Bangladesh to control the drug trafficking in the region, said Chief Minister Dr Manik Saha.",
                "url":"/news?id=26",
                "urlToImage":"news27.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>The central government has stressed for concrete efforts by all agencies with better coordination among themselves along with neighbouring Bangladesh to control the drug trafficking in the region, said Chief Minister Dr Manik Saha.</p><p>After attending the two days plenary meeting of North East Council (NEC) held at Guwahati, Chief Minister Dr Manik Saha on Monday afternoon soon after his return , addressing a press conference here at Civil Secretariat on Monday afternoon accompanied by Chief Secretary J K Sinha and DGP Amitabh Ranjan said that Tripura being used a corridor for drug smuggling to its ultimate destination in Bangladesh and drugs are being smuggle through state’s border from Myanmar.</p><p>He said that Union Home Minister Shri Amit Shah chaired the meeting with Chief Ministers, Chief Secretaries and Director Generals of Police of all North Eastern States on ' Drug Trafficking and National Security ' in Guwahati  and it has elaborate discussion  over  drug abuse scenario in the NorthEast region and ways to reduce it. The meeting was also attended by the Union Home Secretary, Director General of Narcotics Control Bureau (NCB) and other senior officials.</p><p>He said that as the spread of drugs in the society ruins generations, the union government has given its maximum efforts to stop the menace from the region and the Union Home Minister takes it very seriously to make the region drug free. The policy and other agencies have adopted zero tolerance to thwart every attempt by organized mafia to harm the country's economy and national security, said Dr Saha.</p><p>While, giving details of over the achievement of the state to reduce the drug menace and steps being taken by the state government, Dr Saha highlighting his speech in the NEC meeting</p><p>On October 8th , the meeting held for regional cooperation and drug trafficking and held detailed discussion, Tripura highlighted that Tripura is a corridor for drug smuggling and its market  and drugs are being smuggled from Myanmar and via Tripura it reaches Bangladesh including different tablets, Heroin, Brown Sugar and other codeine based drugs. “We highlighted the issues that drugs are coming into our state from Mizoram and Assam state after being transported from Myanmar,” said Dr Saha.</p><p>The government of Tripura launched its ‘Nesha Mukta Tripura” drive and now Tripura police are getting largest seizure in the region and around 700 vehicles, till date has also been seized by the state police from 2018, said Saha and added that government has formed Special Investigation Team (SIT) and 19 cases were registered till September, 2022 and government is maintaining its close monitoring and coordination, resulting in conviction has received in seven cases.</p><p>Mentioning the drive and operations against drug trafficking, the state government also registered 39 cases against financial transaction and seized properties, freezes accounts and cash amount of Rs. 6.5 crore has also seized, said Dr Saha and through team work with central agencies, Narcotic Control Bureau (NCB), ED, Directorate of Revenue Intelligence (DRI), the state’s police are getting success to control the menace.</p><p>He also said that the government has also stressed on massive awareness and a group of guards has been formed in every school to protect the school students from drug abuse.</p><p>“There are challenges due to geographical location and for porous international border, smugglers are taking the advantages of unfenced border,”, said Dr Saha and added that they have urged the union government to complete the border fencing in remaining stress and install Naka point in bordering areas with Assam and Mizoram.</p><p>Tripura has also urged for setting up a NCB branch in the state and also stressed for better coordination with Bangladesh to abolish the menace from its root and its ultimate destination, said the Chief Minister.</p><p>The Chief Minister also said that this is for the first time, the Union Home minister held a meeting on drug trafficking with CMs and DGPs of the NE states and HM made it clear that the country will not allow its soil to be used for narcotics smuggling.</p><p>During the meeting Chief Minister also made some special proposals to curb drug smuggling and has also urged the Home Minister to strengthen vigil in bordering areas by strengthening the BSF.</p><p>Dr Saha sought financial support from the centre to improve the technological support against the drug menace and to boost surveillance measures across the border.</p>"
            },
            {
                "id":"27",               
                "name":"Massive security arrangements made for President visit",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Massive security arrangements made for President visit",
                "description":"Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.",
                "url":"/news?id=27",
                "urlToImage":"News28.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>Amidst tight security, massive preparation is going on in Agartala for the maiden visit of the President Droupadi Murmu, who will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state.</p><p>Tight security measures also took place in Agartala and Udaipur, where the President is scheduled to visit the temple town on October 13 next.</p><p>On Monday morning DGP Amitabh Ranjan accompanied by the officials of President’s security guard and other officials visited all venues including Agartala airport, railway station and Rabindra Satabarshiki Bhavan and reviewed the security measures.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Police sources said that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit.</p><p>Official sources said that President Droupadi Murmu will inaugurate several development projects in the state during her two-day visit from Wednesday.</p><p>The President is scheduled to land at Maharaja Bir Bikram Airport here on Wednesday at 11.15 am. It will be Murmu's first visit to the state after becoming the President. During the visit, Murmu will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>The President is scheduled to lay the foundation stone of Pushbanta Palace Museum, will inaugurate the Tripura Judicial Academy at Narsingarh in West Tripura district and will also participate in the 75th anniversary celebration of MBB College.</p><p>The state government plans to develop Pushbanta Palace which was built by Maharaja Birendra Kishore Mankya Bahadur in 1917 into a digital museum. The Pushbanta palace was the official residence of the Governor till April 2018.</p><p>The President  will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>The president is scheduled to visit Udaipur to offer prayer to Tripura Sundari temple on October 13 and will leave the state for Guwahati at 1.10 pm.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"28",               
                "name":"City police arrested 13 bike lifters, 5 stolen bikes recovered in past 15 days",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"City police arrested 13 bike lifters, 5 stolen bikes recovered in past 15 days",
                "description":"In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.",
                "url":"/news?id=28",
                "urlToImage":"News29.jpg",
                "publishedAt":"Agartala, October 10, 2022",
                "content":"<p>In the past fortnight, the Agartala city police have arrested 13 motor bike lifters and seized 5 stolen motorcycles under their possessions.</p><p>In their continuous investigations and operations, the city police has so far burst the inter-state motor bike lifter gang and based on the interrogation statements of previous arrested bike lifters, the West Agartala police station on Sunday midnight have also managed to detain two motor bike lifters.</p><p>While, giving details, SDPO(Sadar) Ajoy Kumar Das speaking with media persons on Monday afternoon here at West Agartala police station said that after thorough interrogation of two detained bike lifters identified as Sujjan Hussain of Madhupur and Kishore Paul of bordering Rajnagar area of Agartala, police recovered two stolen motor bikes under their possession.</p><p>He said that with the arrest of two new bike lifters, many gang members of inter-state bike lifters have been arrested so far and among them 11 are in jail custody. Das said that police arrested both Sujjan Hussain and Kishore Paul and they will be produced before a local court on Tuesday with police remand appeals for further interrogation.</p><p>He said that a gang of property thefts and snatchers from North Tripura are staying in the capital city for months in rented houses and they were involved with many stolen incidents. After snatching a number of motor bikes, they smuggled these stolen bikes to neighbouring Bangladesh through their international theft network.</p><p>He also said that police have identified all the gang members and soon they will be able to arrest more lifters.</p><p>During the past one month, the capital city police have arrested a number of thieves and motor bike lifters involved in a series of stolen incidents and after the arrest of these criminals, the growing number of stolen incidents  across Agartala has also started decreasing.</p>"
            },
            {
                "id":"29",               
                "name":"Tripura ready to welcome President Droupadi Murmu",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura ready to welcome President Droupadi Murmu",
                "description":"All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.",
                "url":"/news?id=29",
                "urlToImage":"News30.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>All preparations for the maiden visit of the President Droupadi Murmu in Tripura has been completed by the state administration with deployment of a large number of security forces in all venues in Agartala city and Udaipur.</p><p>President Droupadi Murmu, will visit the state for two days from October 12 and will inaugurate a number of developmental projects in the state. On Wednesday morning at about 11.15 AM through a special flight President will arrive at Agartala airport and Tripura Police will welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Giving details of the tour programmes of the President, DM and SP of the West Tripura district Debapriya Burdhan and Sankar Debnath addressing a press conference on Tuesday afternoon said that after guard-of-honour and reception of the President in the Airport, she will move for Narsingarh to inaugurate the new building of Judicial Academy and will lay the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present.</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>While giving details of the security measures SP(West) Sankar Debnath said that tight security measures had been and a large number of security forces were deployed in Agartala and Udaipur, where the President is scheduled to visit on both days.</p><p>A high level security team from Delhi has already arrived here to oversee the security arrangement for the President's visit. They visited the programme venues to review the security measures taken by the state police.</p><p>Debnath added  that a large number of security forces including Central Arms Police Forces (CAPFs) have already deployed in all areas, where the President has scheduled to visit. He said that during movement of the President's convoy, the road traffic system will be restricted and appealed to the people to cooperate with the security personnel during the proposed visit of the President.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT.</p>"
            },
            {
                "id":"30",               
                "name":"64 voters from PCC to cast votes for AICC president’s election",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"64 voters from PCC to cast votes for AICC president’s election",
                "description":"A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.",
                "url":"/news?id=30",
                "urlToImage":"News31.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>A total of 64 voters from Tripura Pradesh Congress Committee (TPCC) are eligible to cast their votes  for the election to the post of All India Congress Committee (AICC) president scheduled to come off on October 17.</p><p>AICC set up 67 polling booths  across the country  'Kharge vs Tharoor' fight on Oct 17, where the last electoral contest for the top post of the party took place in the year 2000 when Jitendra Prasada had suffered a crushing defeat at the hands of Sonia Gandhi.</p><p>For the Congress president election, Shashi Tharoor and Mallikarjun Kharge are the party's two contestants and the counting of ballots will be taken up on October 19 and results will be declared as to who between the two candidates, octogenarian Mallikarjun Kharge or shashi Tharoor, will win the election.</p><p>PCC president Birajit Sinha said that a ten member delegation of Tripura Congress led by PCC working president Sushanta Chakraborty, Niranjan Das and Abhijit Sarkar had gone to Guwahati and attended a meeting addressed by Kharge on Monday. He said that the PCC does not receive any communication from AICC, whether candidates Mallikarjun Kharge or shashi Tharoor will come into Tripura for the poll campaign.</p><p>Sinha said that senior Congress leader Abdul Hannan has been appointed as presiding officer for elections in Tripura which will come off at the Congress Bhavan on October 17 next and the Tripura Pradesh Congress’s working president Sushanta Chakraborty and Pancham Misra have been appointed as election agents.</p><p>He added that said that all the voters of TPCC have been informed of the election schedule and they will duly turn up on the scheduled day for casting their ballots in favour of their candidate  7. Elections will take place on October 17 in every state capital from 10 AM to 4 PM, Sinha said, adding that the vote will be by secret ballot. All the state’s ballot boxes will be brought to Delhi and counting will take place on October 19 and results will be declared the same day, he said.</p><p>Ballot papers will also be sent to the Bharat Jodo Yatra campsite in Karnataka and a booth will be set up there for the yatris, he said. More than 9,000 Pradesh Congress Committee (PCC) delegates will vote in the poll</p>"
            },
            {
                "id":"31",               
                "name":"Opposition will boycott President’s programmes",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Opposition will boycott President’s programmes",
                "description":"Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC)",
                "url":"/news?id=31",
                "urlToImage":"News32.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Opposition CPI(M) welcomed the two days visit of President Droupadi Murmu in Tripura starting from Wednesday, but decided to abstain from two programmes including a civic reception programme by Agartala Municipal Corporation (AMC).</p><p>CPI(M) state secretary Jitendra Chowdhury through a press statement said that the during the visit of President, the state government will organize civic reception and another government programme and the state government has sent invitations to the CPI(M) state secretary, party MLAs and former MPs, but the state secretariat members of the party welcome the visit of President and decided to be absent from both programmes in protest of four and half years long violence against opposition.</p><p>Chowdhury said that there are no rules of law and everyday there are attacks on personal liberty and citizen’s rights and now the present situation goes that even the rights to pay tribute to martyrs of the party have been snatched by the ruling party.</p><p>CPI(M) hoped that the President will realize the suffocation environment prevailed in the past four and half years and from her position will take steps to restore the rights of people in the state.</p>"
            },
            {
                "id":"32",               
                "name":"NF Railways to upscale its services and infrastructure in Tripura",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"NF Railways to upscale its services and infrastructure in Tripura",
                "description":"In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.",
                "url":"/news?id=32",
                "urlToImage":"News33.jpg",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>In a bid to enhance connectivity and improve services for the state the NF Railway has taken several measures including improving track and infrastructure, providing additional trains, and improving goods movement in the region.</p><p>Towards this direction it has again decided to extend the services of train number 02518/02517 to Agartala. This train was so far running between Kolkata and Guwahati. Now the passengers could board this train at Guwahati in the evening and will reach Agartala the next morning. Further, the recently introduced Jan Shatabdi Express train’s service between Agartala to Jiribam in Manipur will be extended up to Khongsang in Manipur. With this the train will run over an additional 55 km. distance and it will be able to cover a distance of 300 km in six hours. This train will also have a new LHB rake with latest amenities and a Vistadome coach to promote tourism in this section, informed the Divisional Railway Manager J.S. Lakra today at a press meet at the Agartala rail station.</p><p>The DRM of NF Railways further informed that a survey for a second line between Lumding – Badarpur via Lanka- Chandranathpur has been sanctioned by the Railway Board and will be completed by March 2023. The work of electrification of the Lumding-Agartala line is expected to be completed by December, 2023. Survey for new line between Dharmanagar-Pecharthal up to Belonia via Kamalpur-Khowai[1]Agartala measuring 178.72 km has been completed. The Railways has also started a survey for upgrading the Agartala rail station with modern state of the art facilities.</p><p>Two escalators are being constructed here and these are expected to be completed next month. Two more escalators are coming up at Dharmanagar rail station. Expanding commercial opportunities the NF Railway has opened two modular stalls at Agartala rail station and very soon such modular stalls will be opened at Udaipur, Belonia, Sabroom, Ambassa, Kumarghat and Dharmanagar station. This is being done under the ‘One Station One Product’ scheme to showcase the indigenous products of Tripura. Local artisans have been requested to make maximum use of this opportunity. At the same time NF Railway has introduced e-auction schemes to delegate parking, pay and use toilet, advertisement space at the rail stations in Tripura for commercial use. In an effort to improve freight transport and logistics, works for additional goods terminals at Sekerkote and Agartala have been shortlisted and one additional goods line at Agartala is being processed. The NF Railways has also been coordinating with local traders for boosting trade by providing parcel train facilities for the transport of rubber, timber, pineapple, jackfruit and other indigenous products of the region. In the international connectivity sector the Agartala-Akhaura rail line is expected to be completed in the next four-five months.</p>"
            },
            {
                "id":"33",               
                "name":"President Murmu on two-day visit to Tripura arrived",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Murmu on two-day visit to Tripura arrived",
                "description":"Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.",
                "url":"/news?id=33",
                "urlToImage":"News34.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security President Droupadi Murmu arrived Agartala on Wednesday at 11.20 AM on her maiden two-day visit to the state.</p><p>Soon after landing of her special flight in Agartala airport, President was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After rousing welcome, Tripura police welcome the President by presenting her ‘Guard-of-Honour’ by the women personnel of the state police.</p><p>Then, President leaves the airport towards the venue for inauguration of Tripura Judicial Academy in Narsingarh and inaugurated the new building of Judicial Academy and has also laid the foundation stone for Tripura National Law Academy.</p><p>On the same day at 3.30 PM, the President will arrive at Rabindra Satabarshiki Bhavan and virtually  inaugurate and  lay the foundation stone for a number of projects. At the special programme to be held at Hall No. 1 of Rabindra Satabarshiki Bhavan she will virtually inaugurate MLA Hostel built at Capital Complex, Agartala and lay foundation stone for up gradation of Hmunpui – Damchera road, improvement of Jatanbari – Mandirghat via Trithamukh road, Maharaja Birendra Kishore Manikya Museum and Cultural Centre at Pushpabanta Palace, Darbar Hall and ancillary building, multi-storied building at Gorkhabasti, infrastructure development of six higher secondary schools in different locations of Tripura, nine 100-seated boys, girls hostel at Indian Institute of Information Technology (IIIT), Agartala. During the programme Governor Satyadeo Narain Arya, Chief Minister Prof. (Dr.) Manik Saha and deputy chief minister Jishnu Dev Varma will also present</p><p>The President will be given a civic reception by the Agartala Municipal Corporation (AMC) at Town Hall at 6 PM on Wednesday where Chief Minister Manik Saha, AMC Mayor Dipak Majumder and cabinet ministers will remain present. The President will also  meet political leaders, dignitaries and the general public.</p><p>On next day of October 13, President will visit the Agartala railway station and will flag off Guwahati to Kolkata express up to Agartala and extension of Agartala-Jiribam-Agartala Jan Satabdi express up to Khongsang (Manipur) with new LHB rake and Vistadome coach.</p><p>She will also dedicate the trans-shiftment yard which was built at Nischintapur, crossing point of Indo-Bangla railway project to the nation, six km away from the state capital by video link.</p><p>Then, the President will visit Udaipur to offer her prayer before the Tripura Sundari temple through Air Force choppers and will return back to Agartala airport at 12 PM and will leave the state towards Guwahati. On Wednesday, the President will stay at Raj BHavan.</p><p>It may be recalled here that on July 5th  last, the NDA Presidential candidate Droupadi Murmu arrived in the state capital to seek support for the July 18 Presidential election and had met all the MPs and legislators of ruling BJP and its alliance partner IPFT. </p>"
            },
            {
                "id":"34",               
                "name":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Tripura will play an important role in making India a five trillion dollar economy by 2025, President",
                "description":"The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.",
                "url":"/news?id=34",
                "urlToImage":"News35.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>The President Droupadi Murmu has given a rousing welcome on Wednesday morning in the Agartala airport followed by a special gesture; the President  was accorded an all women Guard of Honour by the Tripura Police.</p><p>The President Droupadi Murmu in her maiden visit to Agartala arrived at the airport through a special flight and  was received by Governor Satyadev Narayan Arya, Chief Minister Dr Manik Saha, Union Minister of State, Smt Pratima Bhowmik, Chief Secretary, DGP and other top officials of the state administration.</p><p>After attending a series of programmes including inauguration of the National Law University (NLU) at Narsingarh and visiting the Durgabari tea estate in the West Tripura district's Mohanpur subdivision, and interacted with tea garden workers.</p><p>The President in another programme held at Rabindra Satabarshiki Bhavan inaugurates, lays foundation stones for various projects for strengthening the connectivity, education sector, Judicial Academy and Law University among the projects.</p><p>While, addressing the gathering the President said that development of the North Eastern region in getting new impetus with various new projects of Highway, Railway, Airway and Waterway after virtually inaugurated an MLA Hostel at Capital Complex, Agartala and laid foundation stones for Maharaja Birendra Kishore Manikya Museum and Cultural Centre; IIIT-Agartala; and various projects of government of Tripura related to roads, schools and hostels for students from Rabindra Satabarshiki Bhavan.</p><p>She said that projects inaugurated today will not only strengthen the connectivity, education, judiciary and legislature in Tripura, but also boost the rich culture of the state.</p><p>The President said that the youth of India have made a unique identity in the field of Information Technology, all over the world. She was confident that the permanent campus of Indian Institute of Information Technology, Agartala will set new benchmarks in the field of Information Technology.</p><p> The President said that a holistic education system is essential for the development of the nation and progress of the youth. ‘Along with higher education, we should give more emphasis on primary education,’ said President and added that she was happy to note that the Ministry of Development of North Eastern Region, in association with Tripura  government, has launched 'Vidya-Jyoti Mission 100' under which 100 existing higher secondary schools will be converted into quality education institutions with state-of-the-art facilities.</p><p>The President said that there is immense potential for development in the North-Eastern Region. Today, development of the Region is getting a new impetus with various new projects of highways, railways, airways and waterways.</p><p>The President said that India has become the 5th largest economy in the world. The North Eastern Region, including Tripura, will play an important role in making India a five trillion dollar economy by 2025. She expressed confidence that the aspirations, innovation and entrepreneurship of the talented and hardworking people, especially the youth of Tripura, will play an important role in achieving this goal.</p><p>While, attending Civic reception hosted by Agartala Municipal Corporation (AMC) here at Agartala Town Hall on Wednesday evening in presence of Chief Minister, Deputy Chief Minister, Urban Development Minister and Mayor of AMC, the President recalling great sacrifice and bravery of Elbert Ekka said that Tripura among the prosperous and proud state of the country, which has been known for producing least plastic waste.</p><p>The President thanked the people of Tripura for their warm welcome. She said that the composite culture of Tripura is the pride of India. The tribal community of Tripura has maintained a beautiful amalgamation of democracy and tradition.</p><p>The President said that living in harmony with nature is the specialty of tribal society. Most of the area of Tripura is rich in forest resources. In preserving this invaluable forest wealth, the natural lifestyle of the tribal society has played an important role.</p><p>Tripura was on the top place in achieving the target of ‘Responsible Consumption and Production’, included in the Sustainable Development Goal –12 during the year 2020-21, said Murmu and added that Tripura is one of the two states that generate the least plastic waste.</p><p>Tripura is a power-surplus state and it exports electricity to Bangladesh and the connectivity between Bangladesh and India has increased with the construction of ‘Maitri Setu’ over Feni River, said President and added that at the same time, it has become convenient for the entrepreneurs of Tripura to use the ports of Chittagong and Ashuganj.</p><p>From the very beginning, Tripura has played a major role in deepening India's friendship with Bangladesh, said Murmu and expressing happiness added that Tripura is making steady progress as an educational hub. She said that many institutions of higher and professional education are established in the state, where students from not only the North Eastern region but also from other parts of India and abroad come for education. She was also happy to note that Tripura has achieved the target of 100 percent enrollment at the level of elementary education.</p><p>Appreciating the artistic craft made by bamboo by thousands of bamboo artisans of the state, the President said that the government is taking holistic steps to improve the socio-economic  status of tribes including tea-garden workers.</p><p>Earlier, the President visited Albert Ekka War Memorial in Agartala and paid homage to brave soldiers who made the supreme sacrifice in the line of duty during the 1971 Bangladesh Liberation war.</p>"
            },
            {
                "id":"35",               
                "name":"Unidentified woman body recovered from drain in Agartala city",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Unidentified woman body recovered from drain in Agartala city",
                "description":"Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.",
                "url":"/news?id=35",
                "urlToImage":"News36.JPG",
                "publishedAt":"Agartala, October 12, 2022",
                "content":"<p>Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.</p><p>Soon after recovery of the body, panic triggered in that locality and police with a forensic team rushed to the spot to recover the body.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>While giving details SDPO(Sadar) Ajoy Kumar Das said that apparently there were no injury marks in the body and police cannot say anything in details till the finding of autopsy and forensic report.</p><p>He said that till night the identity of the deceased woman was yet to be established and even the local people were not able to identify the woman. Das added that police registering an unnatural death (UD) case started investigation to identify the woman and reason of her death and who the body has been found in the drain water.</p>"
            },
            {
                "id":"36",               
                "name":"President flags off two trains connecting Agartala with Guwahati, Manipur and Kolkata",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.",
                "description":"Amidst tight security across Agartala city over the visit of President Droupadi Murmu, a body of an unidentified woman was recovered in mysterious condition at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon.",
                "url":"/news?id=36",
                "urlToImage":"News37.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>President Droupadi Murmu on her second day of Tripura visit flagged off two trains Agartala-Guwahati-Kolkata Special Express and Jan Shatabdi Express, which would run from Agartala to Khongsang in Manipur and after the flagging off ceremony from Agartala railway station, the President accompanied by her daughter, Chief Minister and Tourism Minister visited Mata Tripura Sundari temple and offered her prayer in the temple.</p><p> On Thursday morning in a bid to further strengthen connectivity and boosting prosperity in the North Eastern region, the extended services of passenger train Agartala – Jiribam - Agartala Jan Shatabdi Express up to Khongsang in Manipur  and Guwahati – Kolkata - Guwahati Express up to Agartala has been flagged off by the President from Agartala station in presence of Chief Minister Dr Manik Saha, deputy chief minister Jishnu Dev Varma, union minister of state Pratima Bhowmik, Transport Minister Pranajit Singha Roy and Anshul Gupta, General Manager of Northeast Frontier Railway (NFR) along with other dignitaries was present.</p><p>The Agartala – Jiribam - Agartala Jan Shatabdi Express, which was the first direct train service connecting Tripura and Manipur has now been extended up to Khongsang in Manipur, which is a stretch of about 55 km. The train will run on Monday, Wednesday and Friday between Agartala and Khongsang. Khongsang station has been constructed as part of the ongoing Jiribam – Imphal new line project.</p><p>NFR said that this will be the first train service for this newly constructed station. People of a vast area of Manipur will be able to travel by train for the first time for their medical, educational and other needs. Train journey travel time will be less than half, as the journey time will be around 07 hrs covering a distance of 300 Km against about 15 hrs or so by road. The Jan Shatabdi Express will be having new Linke Hofmann Busch coaches with latest amenities for passengers. Moreover, a Vistadome coach has also been added in this train.  The entire route passes through very scenic hilly areas. This can be visualized by the passengers,tourists through the Vistadome coach. This train will connect people of three Northeast states Tripura, Manipur and Assam boosting economic activities.</p><p>The Guwahati – Kolkata - Guwahati Express which used to run between Kolkata and Guwahati, has now been extended up to Agartala once a week. The train will run on Wednesday between Agartala and Kolkata. This service will connect the capital of Tripura to Guwahati and other states. This train service will benefit people travelling between Agartala and Kolkata via Guwahati.</p><p>After flagging off both trains, President left the capital city through Air Force choppers towards Udaipur and visited Mata Tripura Sundari temple along with daughter, Chief Minister, Tourism Minister and local MLA Biplab Kumar Ghosh.</p><p>After arriving in the Agartala airport on Thursday afternoon through choppers, the  President Droupadi Murmu has left the state capital towards Guwahati after her two-day visit to the state . Governor Satyadeo Narain Arya and Chief Minister Prof. (Dr.) Manik Saha along with Chief Secretary J K Sinha,  DGP Amitabh Ranjan, West Tripura District Magistrate (DM) Debapriya Bardhan and Superintendent of Police of West Tripura district Shankar Debnath were also present in the airport.</p>"
            },
            {
                "id":"37",               
                "name":"Body recovered from drain identified, one detain for suspected murder",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"Body recovered from drain identified, one detain for suspected murder",
                "description":"The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.",
                "url":"/news?id=37",
                "urlToImage":"News36.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>The body of a woman recovered in mysterious condition from a drain located at the busiest tri-junction area of Kalyani and Water Supply road under East Agartala police station in drain on Wednesday afternoon has been identified and one suspected killer has also been detained by the city police.</p><p>Police sources said that on Wednesday afternoon at about 2 PM some pedestrians passing through the tri-junction area of Kalyani and Water Supply road noticed a floating body of a woman in the drain. They immediately informed some local residents as well as the police.</p><p>Police team from East Agartala police station rushed to the spot and they also brought the forensic team to collect evidence. Police recovered the body and shifted to GB Hospital morgue.</p><p>During the investigation process, police identified the body as Aparna Karmakar Ghosh (43), wife of on e-rickshaw driver Dipak Kumar Ghosh of Chittaranjan area under same police station, who had eloped with a group-D employee of MBB College library on January last leaving her two daughters alone.</p><p>After she eloped with her paramour, her two daughters tried their best to return their mother to their family, but she could not return.</p><p>On Wednesday amidst tight security across the Agartala city due to the maiden visit of President Droupadi Murmu, at about 2 PM some pedestrians noticed the floating body of Aparna Karmakar Ghosh in a drain in mysterious condition.</p><p>Soon after the recovery of body, the police led by SDPO (Sadar) started massive investigation to unearth the mystery of the death and within 24-hours, they established the identity of the victim woman and has also detained her paramour over suspicion of her murder.</p><p>While, police sources said that main accused of the murder is another man and police investigation and hunt to trace the main accused has been expedite and soon they will able to resolve the murder mystery, probably for a triangle love affairs.</p>"
            },
            {
                "id":"38",               
                "name":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "category":"NEH Report",
                "author":"Our Correspondent",
                "title":"CPI (M) to organize mass rally on Oct 21 in Agartala against failure of BJP govt",
                "description":"TJust few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government",
                "url":"/news?id=38",
                "urlToImage":"News38.JPG",
                "publishedAt":"Agartala, October 13, 2022",
                "content":"<p>Just few months before the Tripura assembly elections, opposition CPI(M) will organize a mass rally at Vivekananda stadium on October 21 next against the ‘misrule’ of BJP-IPFT government.</p><p>Addressing a press conference here at CPI(M) headquarters on Thursday evening, CPI(M) state secretary Jitendra Chowdhury said that CPI(M) general secretary Sitaram Yechury along with opposition leader and party’s polit bureau member Manik Sarkar will address the mass gathering, where party workers and their supporters from different parts of the state will gather.</p><p>Chowdhury said that the proposed rally on October 21st is not the party’s election rally, but the rally will be organized to show their protest against four and half years 'misrule' of the present state government and a protest against the prevailing lawlessness situation of the state.</p><p>Castigating the functioning of the state government, Chowdhury alleged that since the formation of BJP government, the rights of common people and the opposition party are being suppressed by the ruling party through their continuous violence.</p><p>He said that from August 16 to September 30 last, the party has organized about 175 to 180 meetings, rallies and demonstrations across the state against the misrule of the state government and in support of basic demand of the state’s people, which received massive support from the cross section of the society.</p><p>He said that day by day the law and order situation of the state is deteriorating and appealed to the state’s people to strengthen their agitation against the government to restore democracy in the state.</p><p>Mentioning the high unemployment rate and political violence in terms of National Crime Record Bureau (NCRB) data, which make Tripura top among all Northeastern states, Chowdhury said that now Chief Minister of the state in recently held Northeast Council (NEC) meeting has admitted Tripura now turns into safe corridor of drug smuggling, which are destroying the young generation of the state.</p><p>He also alleged that during the past four and half years of rule, the BJP government failed to introduce any new project for the benefit of the state's people and claimed that the state government defamed President Droupadi Murmu by inaugurating old projects.</p>"
            }
        
        ]
    }
}